[
  {
    "text": "You can't take screenshot easily. After three days I discovered taking screenshot by swapping screen. But this easy method for taking screenshot is not easy to find in its setting section.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Lookwise not goodDisplay qaulity is just good not bestSound quality is goodCamera not much good that I am expecting.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Wonderful touch and a decent processimg speed. Front cam does spoil the fun while watching full screen videos, like a small black dot bt can be lived wth.7.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "When Sealed Package open then phone display contain so much dust. Gorila Glass 3 protection under 25k i.e out dated glass protection after using 2 days with full care i got one scratch mark on display.9. While watching movie video in this phone or playing video in youtube brightness fluctuate fast too much automatically i.e Adaptive Brightness issue. Super amoled plus display2.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "display"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Finally I can delete SMS from notification now!!- Display is excellent with Blue light filter.- Performance is good. Not that thin, but ok.- Doesn't have Samsung Dex- Started to Boot Screen!!",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Display: The screen quality is good and has adjustment options for warm light and cold light.2.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Although it was seal packed, still many dust were on screen and back side.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "1. nice display2.",
    "brand": "Vivo",
    "model": "Vivo Y91i (Black, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "Battery :- 5/5Two day battery standby for normal easy2.Display:- 4.99/5Super amaload with full hd.. Superb Display3.Design:3/5It has a6000Mah battery,  still looking not bulky. Accessories : 2/5No earphone, No Back cover, No Screenguard..",
    "brand": "Samsung",
    "model": "Samsung Galaxy M21 (Iceberg Blue, 4GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "With 6gb ram,128 GB internal storage and Amoled display I am more than satisfied. Samsung's Amoled screen is what I am attracted to the most.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M21 (Iceberg Blue, 4GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Display is good .",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "Display is good3.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "The touch and feel iss awesome.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "Lots of intelligent features at this price like limiting screen time for each app and winddown function in the night etc.. Camera is decent for normal photo. The only thing which might be a downside for some people'could be compact size of screen especially if you're used to big screens. Overall it's much better than the so called value for money brands like Redmi Oppo Vivo Realme etc which are primarily winning customers by offering more storage battery and big screen but lack performance.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "My hand is small but still I found 6.5 inches display is good to handle as it is well managed for one hand use also. DISPLAY & FINGERPRINT.With Samsung SuperAmoled display you can truly trust the amazing view angle. I found it reliable for my 1920p to 4k level of movie watching without any distraction due to Infinite O display which gives Full Screen Ratio.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "50Rs??M31s is actually A51 without on screen fp.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Display is gorgeous.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "When turns into selife mode really shocked IS IT HD photo or Asian paints colored WALL.REALLY SHOCKED.THIS TIME SAMSUNG DISAPPOINTED.Videos display is also not so effective.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "purchased the phone on very first day, delivered by amazon on the next day - excellent serviceabout phoneused it for 2 days and then screen blacked out and phone not workingtried many things as suggested by amazon tech team but its still not workingreplacement order placed but it shows 20 days to deliver next onenever expected this quality from samsung",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "The display is Gorgeous.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "Feels like a high end device2. Specs say 6000 MaH battery. Power management is not up to the mark. Without using any power intensive app battery drain is quite pronounced and noticeable. Hopefully Samsung will release a patch to fix this3.Camera: Impressive. Overall quite ok for the price.4. Processor: Not the fastest out there  but does the job. Nothing to complain about5. Fingerprint scanner is decent.6. I believe the cost should have around 17K instead of 19.5k...!",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "Display is just Superfine even in direct sunlight it works Excellent. Touch is just Excellent.3.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "This product too much heating, display quality very low and touch screen not working, Camara is very worst like 2mp Camara, also don't trust Amazon.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Settings - an ocean of settings, wonderful touch sensor and additional features for lock facilities. EDIT : Corning Gorilla Glass 3 is fine,just on 10th day of my purchase, my phone fallen down with less than 1m height (slipped from hand) and display borken 💔Handle with care.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 (Space Black, 6GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "purchased the phone on very first day, delivered by amazon on the next day - excellent serviceabout phoneused it for 2 days and then screen blacked out and phone not workingtried many things as suggested by amazon tech team but its still not workingreplacement order placed but it shows 20 days to deliver next onenever expected this quality from samsung",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 6GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Now for readers this is a review unbiased and written after testing and continuous usage :-Pro's1.Screen ppi is great as entry level device✌2.Battery backup is awesome thanks to samsungs R&D even with .7mamp charger.👀3.Android go version 10 is cute without craps4.Reading pdfs is easy and comfort for eyes atleast samsung has guts to say the truth.5.No lag till now because i dont need gaming other than that all regular even without go apps are nicely running.6.fingerprint and face lock Overall out of 5.Camera-2  Gui-4  Screen ppi-5  speed-4  android-4Don't buy a phone only because of specifications must see integration and longevity overall a nice secondary option and primary for featured phone switchers.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "Samsung Galaxy M01 Core (Blue, 2GB RAM, 32GB Storage) -- is a small enough to keep in pockets and has all the Latest Android 10 OS with a Good Display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "and i purchased this phone for my mom so quad core porcessor is sufficient to my mom.2:- Battry life is good because of Quad Core Processor.3:- Ram is 2Gb that is also sufficient4:- Display as always awesome as samsung provide.5:-",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Clean and bloatfree OxygenOS, which runs as smooth as they come.2) AMOLED screen and 90Hz refresh rate really go along to make the display above average.3) The plastic frame (doesn't look like plastic but it is) is a worrying thing and makes the phone *comparatively* less durable.6) Fingerprint scanner being under the screen isn't as quick as a traditional fingerprint scanner on the back.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "For others, one plus 8T(lighter than pro model at 180 gms) would be ideal which should bring 120Hz refresh rate and maybe wireless charging too.. And for those who can afford and dont mind a heavy phone(200+ gms), One plus 8 pro or 8T Pro would be ideal ones.(As per Amazon reviews some users are reporting display issues with 8 pro, so 8T Pro hopefully will be a better model.) Camera quality on par with top model one plus devices in case of outdoor pictures, Indoor/low light pictures are not that good...Not a fan of punch hole cameras..would have preferred full screen with pop up instead.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "So here is my first impression:• Display is so nice and 90 hz refresh rate feels so nice and smooth.•Camera is okay, but not upto the mark..macro lens and depth sensor at the back is just crap. Don't know why they did that😅•Premium user-experience.•face unlock and in-display fingerprint is good.•Phone lacks a true premium feel due to the plastic frame.•The signature slide button delivers the same good experience.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Also don’t panic and nitpick with screen quality!",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "display"
  },
  {
    "text": "Reducing to 60Hz refresh rate would help.- Good Build Quality .- in-screen Finger print sensor is OK-OK.- Useless 5G-",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "2",
    "aspect": "display"
  },
  {
    "text": "Display tint issue? And btw it not an issue, it just characteristics of AMOLED Display. So if you are not sure to buy Nord for this display tint.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "display is in the top notch.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Due to something or the other defects (like headache giving screens, line marks at the back of the body, etc) as it's expensive!Phone boxes were puffed, torned, some displays were dull if noticed closely, more warm and yellowish. People go nuts like \"wow what a display\" not realizing that they are being given inferior quality displays of Samsung. My 5th device came altogether from a different location, excellent box, phone built and display feels more broader even with same dimensions, no two parallel lines design or defect at the back, it's clean and curvy like OnePlus 8 8gb variant (mine is the 6gb one). Screen display is still more warm which I didn't want but colors are very punchy and clearly shows the display is far better than previous returned devices.1st OnePlus 8 8gb - Had a very long permanent line mark at the back of the body if looked closely.2nd OnePlus 8 8gb - Display's blue light filter had issues I'm sure as it gave me headache in seconds, eye strain as well.3rd OnePlus 8 6gb - 2 parallel lines on edges of the back body if the device was tilted a little, was like a dent kind of design or defect (I believe though this one had the best display even than the 5th one that I'm keeping and so I thought it's normal and was okay with it, but display was yellowish and dull, playing pubg with graphics optimization made the game look more ugly in extreme hd settings (hdr sucks). Looking at Images on articles, etc were looking just good.5th OnePlus 8 6gb variant - As told above there are no 2 parallel lines, punchy colors, not dull and very good display, however still yellowish in large part of the screen and whitish around above and right & left edges of the screen in vivid mode (I did noticed in some displays it was not this warm). I also know screen being yellowish a bit makes video viewing an amazing experience to make it more natural for skin color, etc. However, I'm tierd and somewhat satisfied but will want OnePlus to correct if possible with software update without compromising any quality of the display.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)",
    "stars": "3",
    "aspect": "display"
  },
  {
    "text": "On the first glance you will feel the premium quality of the Oneplus 8.I have mentioned few good and bad points for quick understanding for every buyer -Good -Very good build qualityVivid displayExcellent performance and softwareSolid battery lifeDecent camera performanceChic designConsistent performanceOxygen OS is blissClass-leading displayBad-No IP rating or wireless chargingLow-light video could be betterBasic cameras setup",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "I have bought one plus 8 just 3 days back and now i am facing multiple issues like battery backup i am getting for just 3-4 hours of screen on time also facing issues with mobile hotspot as when i am connecting it with my laptop its getting reconnecting again and again however when i am conneting another device hotspot with the same network its working also its getting heat every time often i use lite application like facebook whtsapp no have apps or games are there i have tried to contact one plus support on call, whtsapp and chat but there is no response from there side",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "The last OnePlus phone I was using was Oneplus 5 and was quite happy with it until it screen got broken and replacement cost was higher than the selling price of the device itself. Hz refresh rate is a gimmick to sell this device. It will give you fluid experience but the soon it consumes battery you will always prefer to keep it to 60hz which is an option given in the display settings.",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "3",
    "aspect": "display"
  },
  {
    "text": "The amoeld display is stunning and camera is amazing. And it took me 40 min to charge from 2% to 100%.PROS:CAMERA - 4.8/5BATTERY- 5/5Display - 4.7/5Performance - 4.8/5Speed - 5/5Gaming experience- 4.8/5CONSNO",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "SCREEN RESOLUTION AND QUALITY OF THE SCREEN IS SO POOR. THERE IS GRAINS AND COLOR BANDING ISSUE IN SCREEN. IMAGES ON THE SCREEN IS SO BLURRRY2.",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "I am facing display issues in low brightness",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "i am using this phone just a day..but there are  two main problem i notice so far...one is in video black depth is more and the second one is adapive light censor is worst part.in low light it's horrible.it can't match half of the samsung note,or s mobile.battery back is good far better than samsung and processor is absolutely powerful.playing pubg isn't that great experience it's lag many time.pls oneplus fixed lowlight display problem..",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)",
    "stars": "3",
    "aspect": "display"
  },
  {
    "text": "The punch hole camera does not spoil the overall screen experience as some people have said. The 120 Hz Amoled screen is breathtaking. Certainly the best display on a phone. The afterimage of anything displayed for a period of time on the phone for a long time is displayed on the screen even after the original image is pulled off. This could be seen while watching Youtube videos in non-fill screen mode or videos that have any kind of frame visible or even games like PUBG where static elements of game like the map's frame or your controls would be visible on certain background colours even after you have turned the game off. Also, my screen had no green tints. The image retention issue could easily turn into permanent screen burns really soon.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)",
    "stars": "3",
    "aspect": "display"
  },
  {
    "text": "My oneplus 8 pro has this screen uniformity issues in low brightness.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "And some cool OnePlus Stickers.==== Display ====Firstly, OnePlus 7T Pro has a stunning display over its predecessors. I'm personally not a fan of notches nor do I click a lot of selfies, so I prefer the OnePlus 7T Pro's Fluid Display. Stock Android was butter smooth while I missed out on a lot of simple gestures like Longer Screenshots, Silence Button, Customized Navigational elements & much more which lacked on the Stock OS from Google. ROG 2 is hands down the best gaming phone with 120 HZ Display but lacks majorly on other aspects like software updates, Telephoto Camera, Splash Proof, Build Quality and security patches which are very essential for business professionals or regular consumers. If you're planning to upgrade from a device almost 2 years old then this would be the best upgrade in case you require a phone with no-notch and curved screen.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Display: It's amazing. Sharpness, brightness and 90Hz displays makes it one of the most beautiful displays.2.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Amazing phone with an unbelievably smooth and vivid display. Highlights:1)Buttery smooth, fast and bright display -The edge display is just wowwww. Once again a huge upgrade over the older models.4)90 Hz refresh rate - It is clearly faster and better than the usual 60Hz displays.5)Build and design - Just perfect... And I totally loved the edge display in OnePlus 7 pro. The charging is blazing fast and the battery very easily lasts a whole day,even with 90Hz refresh rate.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "I had been using the OnePlus 5T before and a big fan of OnePlus cameras and OS.But I've always felt the OnePlus display wasn't good enough.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Why?!Display seems to have a bit of yellow tint. Although fast, not really seeing the so called magic of 90Hz display.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "EXCELLENT PRODUCT WITH SUPER FAST SPEED!!Review :Camera - 4/5Battery - 4/5Display - 5/5Processor - 5/5Software- 5/5Overall 4.5/5Go for it!",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Infact I had one plus 6 which was much more better than this in terms of camera, I was comparing the images of one plus 6 saved to google which has much lesser resolution, one plus 6 pics looked great and near to reality where are 48 MP one plus 8 images looked blurry and full of senseless light and colour.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)",
    "stars": "3",
    "aspect": "display"
  },
  {
    "text": "You pay 50G for this hyped up device and chances are you will get a pre-applied screen protector with bubbles on it. Spend 50 grands worth to see bubbles on your screen?2.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Display:A stunning 120Hz display. Better brightness, even bright in low light also. Screen on time is approx 8 hrs.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Screen guard/Back cover:Use CaseU tempered glass or GlazedInc tempered glass.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Recieved a defective display",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "It wasn't expected from one plus,I am facing the same issue which is experienced by most users on one plus 8 pro ,something which is called black bar issue near front facing camera when brightness of the phone is set to low,really not expected one plus.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Following are some of my observations.- Display is stunning, probably second to none.-",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "But I can see a black bar running parallel to front camera module under the lowest brightness setting. But again I would suggest not use in full/high brightness all the time.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Btw I have removed 120hz refresh rate on the first week itself and all this battery issue is even when I am using it at 60hz refresh rate with default app/battery settings. Fingerprint lockscreen works mostly 70% of the time.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Especially look and feel, screen is really good.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "People who are saying the display is perfect have not done screen tests on dark mode. Below 30% brightness there is color shift,high contrast scenes are really bad whether on netflix,prime or youtube.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Pros - everything is perfect except display. but it's not worth with this faulty display. this display issues can be solved then they would have been solve it in past 2 months",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Black bar, black crush issue and red tint across the display. Significant discoloration on display with uneven brightness.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "OnePlus has tried to dampen the issue by increasing the minimum brightness, now its uncomfortable to use in the dark, with so bright screen glaring at you.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Started seeing some black bars in lower dialer screen with default wallpaper and also in chrome browser. Please check it thoroughly by sliding brightness where you can see RGB tint.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Not only this when I play game at bottom of the screen I can see some disturbance too which u can c in screenshots and videos I uploaded with the review. Yesterday I set it to full brightness to worship outside in sunlight and I received a prompt in phone about my phone's temperature",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "2",
    "aspect": "display"
  },
  {
    "text": "Display : 4.5/52.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Battery life is a question mark especially over 2-3 years as currently even with moderate usage It gets me through a day ( but most phones have this problem so its not a deal breaker )Display legibility is not great especially under direct sunlight. this could be corrected with adaptive brightness but then indoors it becomes too bright.so drains the batteryOther than display legibility most of the above cons can be fixed by software updates I guess.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "The screen isnt as bright as 3/3t. Legibility under sunlight can be an issue for some.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "I particularly find gestures (including alternate actions you can assign to navigation keys) and the left home screen pane very helpful.5. But After So Much Some Things Got Missed Like*OIS Camera Stabilizer*Not IPS Certified*2K Display Resolution*Also Dual Camera Needs Some FixesBut over all its a power packed phone with a reasonable price.#And 5T has made some improvements on camera which are missing on 5 but Front Fingerprint Scanner lover chosse",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Combined with the 6GB (or 8GB for the 128GB variant) of RAM, it can not only render graphics faster but is also more battery efficient.2. While the front camera is of 8-megapixel, the two rear cameras are a combination of a 16-megapixel lens and a 20-megapixel telephoto lens. Both the lens is made by Sony and the primary camera has an aperture of f/1.7 while the secondary camera has an aperture of f/2.6. The telephoto lens will offer up to 2x zoom and both the lenses will combine together to capture impressive photos with a greater depth of field, akin to the portrait mode of the iPhone 7 Plus.3.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Look is of flagship grade... little bit slippery,so u need to buy back cover to protect it..rating:8/10Display: Display is much better than any LCD but not as great as samsung super AMOLEDs.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "It went to the Oneplus logo screen but did nothing after that.",
    "brand": "OnePlus",
    "model": "OnePlus 6T McLaren Limited Edition (Speed Orange, 10GB RAM,256GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "8/10Rear Camera- 8/10Front Camera- 8/10Screen- 9/10Sound- 9/10Comes with a cover, ear phones and a charger which is indeed amazing.",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "Having 8gb of RAM is the best thing, the phone is fast, responsive. Overall the phone battery life is very good, quad camera produces top quality images.",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Phone has amoled display which makes it perfect in its category. Screen size, ram,memory, battery are great.",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Nice camera , nice display, nice battary ❤️❤️❤️",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Silicon back case (if you're looking for touch and feel of leather back, better not use.. but use a side bumper if available for protection) Do also post where we can find side bumper, cos it's hard finding for new phones.. Thanks!Looking for a Standout design in 15-20k range?",
    "brand": "OPPO",
    "model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "Touch is awesome.",
    "brand": "OPPO",
    "model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "Display is really good and it's out of my expectation as I'm using Samsung AMOLED previously.9.",
    "brand": "OPPO",
    "model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "It's a great phone im buy last 2 weaks ago oppo f9pro same all features on oppo a5s their is no change in this phone both are same of all features and battery backup is coming upto 2 days of once full charge with using mobile data display is asumne like oppo f9pro and for the cost its a superb phone to buy no hang problem in 2gb ram games is runing smoth with oppo game space its super thanks for the oppo and the seller for this great phone",
    "brand": "OPPO",
    "model": "OPPO A5S (Black, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Guys here m talking about pros n cros of A5s. Cros:1. 3gb ram 32gbmemory2. 8MP &13+2 MP front and rear camera. Great battery.2. Fast charging3. Great size4. Smart featuresIdle for first time smart phone user.",
    "brand": "OPPO",
    "model": "OPPO A5S (Black, 3GB RAM, 32GB Storage)",
    "stars": "2",
    "aspect": "display"
  },
  {
    "text": "Screen, a 120hz screen does make a huge difference compared to S9 that I own. Plus 5k discount and a one-time screen replacement warranty. In the last 15 years, I have dropped the phone only once in the pool, but at least 5 of them have got a broken screen.",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "I Just Loved the Build Quality and can’t Even tell u about the display but I can tell u one thing that Oppo Find X2 has the best display in any Smartphone on Planet Earth till today.",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "but it's not hurt that much because of 65W SuperVooc Charger2.Always got Accidental touches due to It's Curve Display3.Bit Slippery and got Fingerprint on Its back glass4.No Hardcase provided in the Box and the Quality of pre-applied screen protector is bad5.Not a Single Good Quality Screen Protector or Case Found on anywhere till now that's a bit annoying for me .But",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Display is top notch. I got a clear 7 hrs ON-screen time with heavy usage On 120 Hz , Auto Fhd-Qhd . Display is one of the best.2. If you are a person who would want a premium feel smartphone with excellent display, video streming experience , good design, good camera setup and fast charging : Go for this one .",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "but due to its unavailability and display issues , I went for this one",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Display is awesome,3.",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "It has eye protection & flicker free screen so now worry about web-series.",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Screen: That’s the main USP of product, I used apple, samsung earlier but find x2 is best of best in terms of screen. Be it 120Hz refresh rate or resolution everything is best.",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Sometimes the upper back button is not working due to edge display2.",
    "brand": "OPPO",
    "model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Display: Its awesome 3D edge smooth & bright display looks more premium (5/5)3.",
    "brand": "OPPO",
    "model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Again after one day of no response, I made an effort to reach out to Amazonand explain the entire issue and now is where the Amazon agent clearlydenies to take any responsibility for after sale customer service anddiverts me to get in touch with OPPO directly.",
    "brand": "OPPO",
    "model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Nice phone value for money but in inbox there is no earphone and screen protector receive being a regular customer of Amazon i am  unhappy there was  clearly written that these items are included in inbox.",
    "brand": "OPPO",
    "model": "OPPO A31 (Mystery Black, 4GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "It has got a decent battery backup, display's amazing (first time using an AMOLED display), the triple camera setup is quite useful and has good color reproduction but it somehow cannot try to get a good shot at night. The fingerprint reader is very fast but be careful to use a certified and original screen guards or protectors as the fingerprint does struggle in screen guards. PROS:--Supports fast charge and has pretty decent charge rates-Has NFC which enables in wireless payments and support for Android Beam (unless Android 10 comes)-Has a good 4000mAh battery, pretty decent for bit of heavy users-Has on-screen fingerprint which is good-Camera setup is goodCONS:--Camera struggles to shoot better pictures at night-The included night mode requires a little bit software upgrade-OneUI which is extremely good, but the icons are kind of kiddish-And mostly- Another thing i want to mention, please keep a 4D tempered glass screen protector otherwise a single hard drop in that AMOLED screen will cause a good beautiful crack in the screen.",
    "brand": "OPPO",
    "model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "Love the samsungProud to be a Samsung user love the design love the display yeah fingerprint sensor is little slow hope this will be improved by the upcoming updates",
    "brand": "OPPO",
    "model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "Undoubtedly the best mobile of 2019 so far. Camera - A+(Specially selfie camera with AI technology, where you will find features like face slim, nose slim, chin slim, 3D , bigger eyes and others. I bet you will like it, much better than Vivo)  2. Internal memory and Ram - A++  3. Build quality - A+  4. Battery - A+ (holding charge including heavy usage and game play till 2 days easily)  5. Charging - A+.Some says it doesn't support fast charging but it is neither a normal or slow charging. It's not a super fast charging but a good fast charging. Sound - A++ in one word awesome. Sound comes as 3D surround sound type. Superb Dolby digital sound quality.",
    "brand": "OPPO",
    "model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Camera full screen not displaying while taking photo, option is very limited like chinese camera,Sound is good, display picture quality is very poor, screen size is small it is not 6.5 inch comparision with other 6.5 inch phone",
    "brand": "OPPO",
    "model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Camera full screen not displaying while taking photo, option is very limited like chinese camera,Sound is good, display picture quality is very poor, screen size is small it is not 6.5 inch comparision with other 6.5 inch phone",
    "brand": "OPPO",
    "model": "OPPO A9 2020 (Space Purple, 4GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Screen in not working properlyThere are some different color lines coming in between & there are constant white color multiple dots seen in between....",
    "brand": "OPPO",
    "model": "OPPO Reno 2Z (Luminous Black, 8GB RAM, 256GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Best phone ever bought by me, earlier one plus user, first time tried oppo and luckily first impression is damn good, talk of anything and everything is good about the phone, must buy guys, u will forget all phones at thirs range after hdfc discount and exchange of old phone, i had to pay just 20k, happy customer, camera, heaphone, speaker, resolution and finger print is awesome",
    "brand": "OPPO",
    "model": "OPPO Reno 2Z (Luminous Black, 8GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Model Shape colour 5 stars2.pop up camera 5stars3.back camera 4.5stars4.Display 5stars5.fingure Touch 5stars (very glossy)6.Back Cover 5stars(very premium quality)7.Protective glass 5stars (very thin and good)8.",
    "brand": "OPPO",
    "model": "OPPO Reno 2Z (Luminous Black, 8GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "The display seems to be crisp enough, and the phone itself is pretty snappy (right now).Call quality is crisp, I don't have VoLTE in my locality though.",
    "brand": "MI",
    "model": "MI Poco M2 Pro (Green and Greener, 6GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "Good build qualitySharp displayPowerful processorSolid battery lifeDecent daylight camera performanceFast ⚡ chargingNo heating issue",
    "brand": "MI",
    "model": "MI Poco M2 Pro (Green and Greener, 6GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Amoled screen brightness is excellent and there is no issue in viewing display even while the display is directly facing towards the sun.7. The limitation of resolution of the screen FHD+. The bigger size of the screen results in lower ppi and thus stands nowhere near QHD+ displays.2. The battery is bigger compared to many devices but looses about 10 to 20% even when left untouched overnight thus I'd say not so good battery management.6. However in comparison with One plus 8 pro I feel that MI 10 is slightly behind because of the MIUI bugs related flaws, FHD+ display and outdated secondary camera hardware (including front camera.",
    "brand": "MI",
    "model": "Mi 10 (Twilight Grey, 8GB RAM, 256GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "Up to the mark 90Hz refresh rate display.6.",
    "brand": "MI",
    "model": "Mi 10 (Twilight Grey, 8GB RAM, 256GB Storage)",
    "stars": "4",
    "aspect": "display"
  },
  {
    "text": "Display width is too small( Feels like 5\" display)6.",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Display quality is top notch, overall the quality of the phone is very good. Touch smoothness is amazing.",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Thank you so much (If I will spend Rs.600 on a head phone then surely I can spend another 200 on a half decent phone case).The screen is awesome!!",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "3",
    "aspect": "display"
  },
  {
    "text": "So basically, you will get a sound or vibration that something app has got a notification but you cant see at the phone screen top status bar which is something a 3rd class phone also shows. So this means you will have either have to slide down the top of screen to check the hidden status bar or foolishly keep sliding and check which App has a notification.",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Very poor Rear camera quality, photos app Suddenly Hanging full black screen shown, mobile back side heating by online video streaming, Internet connection poor, very slow downloading, etc...,",
    "brand": "MI",
    "model": "Mi Redmi Note 7S (Ruby Red, 32GB, 3GB RAM)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "purchased the phone on very first day, delivered by amazon on the next day - excellent serviceabout phoneused it for 2 days and then screen blacked out and phone not workingtried many things as suggested by amazon tech team but its still not workingreplacement order placed but it shows 20 days to deliver next onenever expected this quality from samsung",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Black, 6GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "This phone to be bad not touch work thisPhone touch not work",
    "brand": "MI",
    "model": "Redmi Note 5 Pro (Rose Gold, 6GB RAM, 64GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "The screen shows vertical lines.",
    "brand": "MI",
    "model": "Redmi Note 5 Pro (Rose Gold, 6GB RAM, 64GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Nice phone only demerits is that screen size is a bit small and speaker  is a bit noisy",
    "brand": "MI",
    "model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)",
    "stars": "3",
    "aspect": "display"
  },
  {
    "text": "C) Touch response over screen is cool and finger print detection takes just fraction of second to unlock or activate any set of commands.",
    "brand": "MI",
    "model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "The screen size is pretty decent, fits in your pocket well & at the same time the iPhone 8 maintains the essence of an iPhone.",
    "brand": "Apple",
    "model": "Apple iPhone 8  - Gold",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "I was already a big fan of the 5.8' OLED display on the iPhone X. At 6.5' , 11 Pro Max offers the best OLED display I have come across smartphones.4.",
    "brand": "Apple",
    "model": "Apple iPhone 11 Pro Max  - Space Grey",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Display.",
    "brand": "Apple",
    "model": "Apple iPhone 11 Pro Max  - Space Grey",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Display could have been OLED in this price but if doesn’t matter .",
    "brand": "Apple",
    "model": "Apple iPhone 11  - White",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Touch ID improved5.",
    "brand": "Apple",
    "model": "Apple iPhone 11  - White",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "because xs max doesnt give you more screen space, it just enlarges the icons and the text. Even after upgrading the ios to 12.0.1, there seems to be no difference, I think the screen could have been used to fit in more text compared to the Xs. Also great touch interface!",
    "brand": "Apple",
    "model": "Apple iPhone Xs Max  - Gold",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "The iPhone XS Max combines a big OLED screen, great speakers, great cameras, great battery life, and blazing fast speed into the best user experience on a smartphone. The iPhone is also the ONLY smartphone that can stream all video apps in full screen. Android doesn’t have full screen built into the OS so video apps like HBO, Showtime, Cinemax, STARZ, Encore, and EPIC are all tiny on the Note 9...those apps are all full screen on the iPhone.",
    "brand": "Apple",
    "model": "Apple iPhone Xs Max  - Gold",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Finally I decided to go with Apple as it now has an LED screen instead of IPS LCD screens that Iphone 8+ and previous versions had.. ( I also used my dads iphoneX for around 2 months and decided to go for this when I was convinced)",
    "brand": "Apple",
    "model": "Apple iPhone XS  - Space Grey",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "When I inquired about Apple Care protection on the device, he mentioned that Apple does not have any warranty against Screen damages in India and it is available in US and other countries.1. Is Apple expecting its users to change the phone which costs almost 1 lakh just becuse there is a crack on the screen?2. One Plus is providing free screen replacement warranty for a year that costs half the price of iPhone.3. This strongly discourages Indian consumers to go for an expensive phone if screen damages are not covered.",
    "brand": "Apple",
    "model": "Apple iPhone XS  - Space Grey",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "When I visited the center, the service person told me that I had to pay a fee of INR 33,000/- to get the screen fixed. 33,000/- for repairing a display !!",
    "brand": "Apple",
    "model": "Apple iPhone XS  - Space Grey",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Price is definitely high and i got it in a nice deal from amazon which knocked off 20k on the price tagPlus got free screen replacement cover, no interest EMITips:Wait for a SALE to get maximum savings.",
    "brand": "Apple",
    "model": "Apple iPhone XS  - Space Grey",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Invest in a good case, front screen protector and a rear glass protector- Such expensive phones should come with 128GB of storage as base, instead of 64GB.",
    "brand": "Apple",
    "model": "Apple iPhone X  - Space Grey",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Videos get heavily cropped when watching in full screen mode.",
    "brand": "Apple",
    "model": "Apple iPhone X  - Space Grey",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Screen resolution (Super retina HD) and the contrast ratio makes the viewing experience breathtaking3)",
    "brand": "Apple",
    "model": "Apple iPhone X  - Space Grey",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "In 10 days display is blank and battery over heat no response from service center when we request for replacement......really very panic when we put this much of price cant they treat properly this product i personally requesting all dont choose this brand...Because i dont want see the others to struggle like me....very worst",
    "brand": "Vivo",
    "model": "Vivo Y20 (Obsidian Black, 4GB RAM, 64GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Charger is not type C. Also display is not upto the mark.",
    "brand": "Vivo",
    "model": "Vivo Y20i (Nebula Blue, 3GB RAM, 64GB Storage)",
    "stars": "3",
    "aspect": "display"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 (Black, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Good for multitasking...5. Display E3 Super Amoled,picture quality very nice stream any video in full HD like Amazon prime video, Netflix6.",
    "brand": "Vivo",
    "model": "Vivo V19 (Piano Black, 8GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "All the above complaints works randomly, I had screen recored and shots for proof to show.",
    "brand": "Vivo",
    "model": "Vivo V19 (Piano Black, 8GB RAM, 256GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "When loading - screen flickering occurs often in many common applications.",
    "brand": "Vivo",
    "model": "Vivo V19 (Piano Black, 8GB RAM, 256GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Very good camera quality, display is a very big and colour is very beautiful",
    "brand": "Vivo",
    "model": "Vivo Y50 (Iris Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "I NVR thought a phone with 8 gb ram and 128gb rom will hang,especially Google Chrome ...whtsapp chess dream11 r the only apps which I use but still it works like 5000rs phone...its functions r so typical,it's not handy to use,heavy wight,with too large screen,,don't waste money on this Phone",
    "brand": "Vivo",
    "model": "Vivo Y50 (Iris Blue, 8GB RAM, 128GB Storage)",
    "stars": "3",
    "aspect": "display"
  },
  {
    "text": "Don't buy this product mobile was very slow and one week charge is standard but one week after automatically charge is decreased point to pointAnd touch is also response is very lowBut now decided to replace the item return policy amzon description given to 10 days but they gave only one week",
    "brand": "Vivo",
    "model": "Vivo Y30 (Dazzle Blue, 4GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "Its 16.15 cms display is quite impressive.",
    "brand": "Vivo",
    "model": "Vivo U10",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Do'nt go for it i received it today, totally disappointed from camera quality provided by vivo,MI 7s & reamle u1 better than it.if u go for camera quality & display never go for it",
    "brand": "Vivo",
    "model": "Vivo U10",
    "stars": "1",
    "aspect": "display"
  },
  {
    "text": "There are lots of feature in this phone like low power mode, ultra power saving mode, game mode, one hand mode, etc... Check YouTube videos for the features.7. Finger print reader and face recognition is fast. I prefer finger print and turn off face recognition for saving battery life.8.",
    "brand": "Vivo",
    "model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "Very good camera quality, display is a very big and colour is very beautiful",
    "brand": "Vivo",
    "model": "Vivo Y50 (Pearl White, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "display"
  },
  {
    "text": "I NVR thought a phone with 8 gb ram and 128gb rom will hang,especially Google Chrome ...whtsapp chess dream11 r the only apps which I use but still it works like 5000rs phone...its functions r so typical,it's not handy to use,heavy wight,with too large screen,,don't waste money on this Phone",
    "brand": "Vivo",
    "model": "Vivo Y50 (Pearl White, 8GB RAM, 128GB Storage)",
    "stars": "3",
    "aspect": "display"
  }
]