[
  {
    "text": "GLASTIC seems to be a discovery of new material (Glass+Plastic) because its looks transparent and shining.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Camera, display etc. are satisfactory. Overall GOOD non Chinese phone. However, for their improvement, I tried to give some critical feedback to the company over phone but it was not so easy, so, I am writing here sothat Samsung India can take this critical review for their improvement. Battery:Battery is 7K mha but it is draining so fast that its overall backup time is slightly better than any other average phone. In this price segment, Samsung can easily provide metallic back for better appearance and transfer of heat. Overall, its good non chini phone with good camera and display, a bit bulky, satisfactory speed, scope of tremendous improvement in UI and setting, and bit overpriced.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "if you use it continuously then you feel pain in your  hand, designed is out dated, poor quality material.. camera is just okay..",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "build"
  },
  {
    "text": "Few highlights:1. Seamless fingerprint scanner. Side fingerprint scanner on the power button really makes it stylish and too easy to handle as well.2. Camera quality is really gud wth many features which luks tempting which im yet to explore. Have all latest features like slow mo, 10x zoom, focus lens, panorma view and other added features.3. Wonderful touch and a decent processimg speed. Front cam does spoil the fun while watching full screen videos, like a small black dot bt can be lived wth.7. C to C charging cable capable of reverse charging too.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Plain Plastic back design at 25K which attract too much scratches.6.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "build"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "No issue at all.- Feels delicate in hand but a Rs.49 cover was good enough. Feedback- Feels good in hand and in use. It is a powerhouse and you feel it.- Will update after few days of use, but don't have any doubt as of now.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Battery: Samsung may claim the battery will last for two days but it didnt last that long - no Netflix, Prime Video, heavy games being used. Amazon's Policy: In case you don't like the phone, Amazon has made sure you are stuck with it. The switch from 10 day \"return\" policy to 10 day \"replacement\" policy is dowright wrong! When you do request for replacement, there is an inspection of the phone at buyer's site - which I understand but the fact that replacement will occur almost on the 10th day from my purchase still keeps me at unease. Display: The screen quality is good and has adjustment options for warm light and cold light.2. Performance: Streaming videos and playing heavy games was smooth for the first 4 days but then again Samsung is known for fast deterioration of performance, so I will keep my eyes and ears open.3. Sound: Speaker quality is okay",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "build"
  },
  {
    "text": "Superb Display3.Design:3/5It has a6000Mah battery,  still looking not bulky.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M21 (Iceberg Blue, 4GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "Perfect size* Samsung brand* Good build quality for this price* Android 10* One UI 2Cons.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "Small, handy and light weight2.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Durability \"It has a plastic body and looks premium but extremely light and durable\"cons:1.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Lots of intelligent features at this price like limiting screen time for each app and winddown function in the night etc.. Camera is decent for normal photo. The only thing which might be a downside for some people'could be compact size of screen especially if you're used to big screens. It might take some time to get accustomed if you are a frequent movie watcher. Overall it's much better than the so called value for money brands like Redmi Oppo Vivo Realme etc which are primarily winning customers by offering more storage battery and big screen but lack performance. A good to buy phone for  9000",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "BUILD QUALITY.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Lookwise it doesn't feel like an M series phone.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Feels like a high end device2.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "Hi all,From Samsung M31s. I have to take care my SaM31s like a baby. Size wise bit bigger that 1+6 (6.5\")Comparing to Nord, we have Memory card slot - no dependency. Battery lasts more than 36hrs (with Bluetooth earphone at times).Charging happened in 70-75 mins with intermediate usage in between. Earphone Jack available comparing to Nord, better than Bluetooth earphone which consumes charge and needs charge for earphones too. Settings - an ocean of settings, wonderful touch sensor and additional features for lock facilities. Audio - Its so good with clear audio in all needs. Photo - Video : Excellent quality of photos and Videos even in a 3x Zoom. Front camera is bit down. Macro Mode is giving a great pic of Close shots. Has Slowmo, Super slowmo, Hyperlapse, Panaroma. AR zone is pure magical. Different features for Front cam and Back cam. Reverse charging facility is amazing. Overall - M31s is a price worthy with sooo many options. EDIT : Corning Gorilla Glass 3 is fine,just on 10th day of my purchase, my phone fallen down with less than 1m height (slipped from hand) and display borken 💔Handle with care.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 (Space Black, 6GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Now for readers this is a review unbiased and written after testing and continuous usage :-Pro's1.Screen ppi is great as entry level device✌2.Battery backup is awesome thanks to samsungs R&D even with .7mamp charger.👀3.Android go version 10 is cute without craps4.Reading pdfs is easy and comfort for eyes atleast samsung has guts to say the truth.5.No lag till now because i dont need gaming other than that all regular even without go apps are nicely running.6.fingerprint and face lock Camera below average still expected but samsung should work more on this front if they wanna beat chinese phones.2.Not for gamers and thats expected buy a 4gb Ram 🤔 based phone why reading me?😉3.finger print and face lock missing I Can manage but most indians can't.4.Battery takes 3.15 hours to charge to work for 12 hours of calling and surfing and thats not bad at all but can be issue for chinese phone lovers who have habit of charging again and again to play pubg. Overall out of 5.Camera-2  Gui-4  Screen ppi-5  speed-4  android-4Don't buy a phone only because of specifications must see integration and longevity overall a nice secondary option and primary for featured phone switchers.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "While charging the phone heats up to an extent that one may feel that it could blast.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)",
    "stars": "1",
    "aspect": "build"
  },
  {
    "text": "The design actually fits the hand well as it is shorter than usual on breadth, and a bit more on length, all the more better viewing experience.6) Gaming performance is average. The phone looks and feels premium while using.8)",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "Most phones these days look and feel alike with the camera being one aspect that sets the winners apart from ordinary phones...i dont know what you guys did here.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "3",
    "aspect": "build"
  },
  {
    "text": "Battery usage update: Drains faster than other one plus models...so for the ones travelling frequently, this might not be an ideal phone...fast charging is a relief for ones who have access to charging point.... For others, one plus 8T(lighter than pro model at 180 gms) would be ideal which should bring 120Hz refresh rate and maybe wireless charging too.. And for those who can afford and dont mind a heavy phone(200+ gms), One plus 8 pro or 8T Pro would be ideal ones.(As per Amazon reviews some users are reporting display issues with 8 pro, so 8T Pro hopefully will be a better model.) I still use 7T pro which provides the best of One Plus experience...INITIAL IMPRESSIONS:No tint issue which has been widely reported. Camera quality on par with top model one plus devices in case of outdoor pictures, Indoor/low light pictures are not that good...Not a fan of punch hole cameras..would have preferred full screen with pop up instead.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "Reducing to 60Hz refresh rate would help.- Good Build Quality .- in-screen Finger print sensor is OK-OK.- Useless 5G- I am fan of stock android feel , one of the reason to buy this phone .",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "2",
    "aspect": "build"
  },
  {
    "text": "Regarding the one plus feeling.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "2",
    "aspect": "build"
  },
  {
    "text": "Their was a feeling of giving the most with every penny spend from oneplus till now..",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "2",
    "aspect": "build"
  },
  {
    "text": "My 5th device came altogether from a different location, excellent box, phone built and display feels more broader even with same dimensions, no two parallel lines design or defect at the back, it's clean and curvy like OnePlus 8 8gb variant (mine is the 6gb one). Screen display is still more warm which I didn't want but colors are very punchy and clearly shows the display is far better than previous returned devices.1st OnePlus 8 8gb - Had a very long permanent line mark at the back of the body if looked closely.2nd OnePlus 8 8gb - Display's blue light filter had issues I'm sure as it gave me headache in seconds, eye strain as well.3rd OnePlus 8 6gb - 2 parallel lines on edges of the back body if the device was tilted a little, was like a dent kind of design or defect (I believe though this one had the best display even than the 5th one that I'm keeping and",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)",
    "stars": "3",
    "aspect": "build"
  },
  {
    "text": "Great phone!Gaming performance is so great, device don't get heat up at all even at high settings!I played PUBG Mobile and details it provides were so exciting and make it feel real.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "On the first glance you will feel the premium quality of the Oneplus 8.I have mentioned few good and bad points for quick understanding for every buyer -Good -Very good build qualityVivid displayExcellent performance and softwareSolid battery lifeDecent camera performanceChic designConsistent performanceOxygen OS is blissClass-leading displayBad-No IP rating or wireless chargingLow-light video could be betterBasic cameras setup",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "There is only one way you will be happy with this purchase and that is, if you are looking for a slim, elegant, powerful, light weight device offering a premium in-hand feel. Conclusion: Feels expensive and has a nice balance in the hand (Its very light and is a joy to use).",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Weight: It weighed too much I felt like holding a brick.",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "3",
    "aspect": "build"
  },
  {
    "text": "No premium-feeling anymore.",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "3",
    "aspect": "build"
  },
  {
    "text": "Camera design could have been made better (But I feel better compared to Apple 11 pro)Overall: 4.7/5  One Plus proves again why its the BEST MOBILE right now.",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "DESIGN OF THE PHONE IS MESS. ALSO THERE IS NO PREMIUM FEELING AFTER HOLDING THIS PHONE AS WAS WITH THE ONE PLUS 5T.3.",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "1",
    "aspect": "build"
  },
  {
    "text": "The design is top-notch. Very sleek and premium looking design-wise.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)",
    "stars": "3",
    "aspect": "build"
  },
  {
    "text": "====I am a Design Specialist by Profession & also into Mobile Photography, hence I was hooked in using the Pixel 2XL. Feels more luxurious over the 7T. ROG 2 is hands down the best gaming phone with 120 HZ Display but lacks majorly on other aspects like software updates, Telephoto Camera, Splash Proof, Build Quality and security patches which are very essential for business professionals or regular consumers. ASUS is also not known to provide regular updates to it's consumers over the OnePlus which has a closely knit community among the developers and has more Brand Value than ASUS & nevertheless to mention that the OnePlus 7T Pro feels premium out of the box. 7T Pro feels very slippery when compared to the 7T. I wish they made smaller devices.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "I would recommend using a case so that the edges don't feel slippery.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Lots of gestures, shortcuts and very lightweight. The only Con I think it has is its weight.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "I ordered this at 11 PM in the night and It was there in my hand in the morning 9 AM.I have used iPhone X, Samsung s9 plus and Samsung s10 plus before coming to One Plus 7T. Display: It's amazing. Sharpness, brightness and 90Hz displays makes it one of the most beautiful displays.2. Camera: All of my previous mobiles had great cameras. 7t Pro is nothing less than that. For a normal user, it's just perfect.3. Battery: I am getting a very good battery backup. 30T Warp charger is a booom.4. Performance: Blazing and Lightning fast.5. One of the USP of OnePlus mobiles is its Oxygen OS. After using iPhone and Samsungs One UI, I can tell you that it's the best.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "It is clearly faster and better than the usual 60Hz displays.5)Build and design - Just perfect...",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "A well designed phone",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "My personal review regarding OnePlus 8 Pro Ultramarine blue after using 24 hrs. Display:A stunning 120Hz display. Better brightness, even bright in low light also. No green tint / black crush issue found on my device. Camera:It is clear that only 3 rear camera are working right now. No color filter is working. It may redeaign and enable later via software update. Rather than every sensor of all camera working fine. Pictures taken by rear camera with all mode is so bright that u can find every details in the pictures.48 MP wide angle camera is take so wide and beautiful pictures. On front camera section it take good bright pictures, but i think in portrait mode it take little bit artistic image than real. Slow-Mo working fine. Macro working fine. Battery:Battery backup is good. 30 W Warp charger  chage the device very fast. 19 hrs before charging and its still 6 hrs left. Screen on time is approx 8 hrs. No wireless charger so dont know about wireless chaging. Oxygen OS:This is my 3rd OP devices and the best part which i love is its Oxygen OS. OnePlus own gestures is also missing this time. Proximity sensor working fine. Pocket mode working fine. Fingerprint sensor is superfast. Face unlock also superfast. Sound & Vibration:Sound is good but i think ring volume is little bit low. Speaker is loud, you can use Dolby Atmos enhancement also. Heptic feedback is low which is good. Network:OP 8 Pro not support our own navigation system NavIC right now. No announcement from OnePlus also. Qualcomm announced that its 865 Snapdragon processor support NavIC system. So dont worry ur hardware support NavIC. Maybe software update comes later.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Writing the review from my new OP8 Pro, it just feels great.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Haptic feedback while not the greatest, is still very good.- Even though the phone is heavy, I feel it's very well balanced. Very difficult to use with one hand.- Fingerprint scanner and Face unlocks works like a charm.- Design is great and the available color options are different and awesome.- Earpiece volume during calls are not the greatest but adequate. OP3 earpiece volume had deteriorated very much over time.- Rear Camera has improved a lot, but I can already feel that there are still rooms for improvement.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Wide angle is the only thing I felt is worth compared to oneplus 5.Apart from the above rest of the things are good I feel.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "build"
  },
  {
    "text": "Especially look and feel, screen is really good. Even the build quaility feels nice.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "build"
  },
  {
    "text": "The outer looks of the phone is just delightful, SD865 is just wow!!. Started seeing some black bars in lower dialer screen with default wallpaper and also in chrome browser. Front and rear camera really sucks. Camera seem to be ordinary as <15k budgeted phone. Battery is really utter waste thing with less usage it lasted for 4 hours. If someone is looking for great flagship. I was amazed by the youtube review videos about this phone. But it don't deserve to be a flagship phone. Green tint has not been fixed yet. Please check it thoroughly by sliding brightness where you can see RGB tint. If your are looking for a great camera and battery.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "1",
    "aspect": "build"
  },
  {
    "text": "The touch is super smooth, face unlock is fast as a blink of an eye, I constantly use google assistant which response pretty well, I am blown away with the camera quality and audio quality that is powered by Dolby Atmos. Apart from the strong base of hardware and software the phone has some pretty cool features that I have been loving for instance Digital Wellbeing, Work-Life Balance mode, Quick reply in landscape ,Zen Mode, customization for each application that helps in optimization and intelligent functioning. The phone connects pretty fast to wifi and Bluetooth devices. I have used this phone for my online meetings as well, the screen renders images and videos pretty well. and I highly recommend buying this phone.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Haptic vibration feedback on ONEPLUS 8 is awesomeDevice is very light weight in hands. Overall look , feel , battery and everything is great and cameras are decent for day to day usage.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "(8+128, glacier green)I will give some ratings according to me after 4days of usage.1. Display : 4.5/52. Camera : 3.5/53. OS : 5/54. Charging : 5/55. Battery : 5/5 (1 day easily as i am normal user)6. Case : 3/5I loved the color. Also smoothness of phone. (:",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "( had also replaced the battery last year)Within 3 weeks I had done my research on various models at various price pointssome of the phones I considered wereMoto G5 plus----> excellent reviews all over, but camera is a compromiseMoto Z play------> good battery life...but specs wise ok and additionally it is made to support the moto mods so design looks funny with the pins at the backHonor Pro 8----> phone has some heating issues while using cameraOne Plus 5---> other than jelly effect no significant issues seen on the internetIPhone 6S ----> if IOS fan, then go for it but take the higher memory version as 32gb is too small for Ios apps. I would not rate it as good as pixel, but produces very acceptable quality in most lighting conditionsdesign is very slim.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "OOS 4.5.x looks and feels better than the version in 3/3T. I am sure the little issues will be taken care of, soon.7.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "The OnePlus5 is the first phone in India to have the advanced Octacore 10-nanometer design Qualcomm Snapdragon 835 chipset.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Great value for money... Look is of flagship grade... little bit slippery,so u need to buy back cover to protect it..rating:8/10Display: Display is much better than any LCD but not as great as samsung super AMOLEDs. Rating: 8/10Performance: For this only one word.. awesome!!! Great performance...no heating at all.. blazing fast processor.. iam loving it's speed..rating 10/10Camera: Nice camera.. Daylight photo quite good(samples attached).Night photo though manageable but not as great as samsung flagships.. Selfy photos are very nice.. Overall a great camera... rating:8/10Battery: Great battery.. easily lasts whole day despite heavy use and dash charging is like Cherry on the cake. rating:10/10Sound: Very good loudness and sound clarity from the single speaker...with headphones too. Rating:8.5/10Recommended to buy if you want overall a good package within the price range...it will not disappoint you..",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "And its bragging rights for sure!Overall, I am really satisfied with this device and feels great to be a part of OnePlus Community!",
    "brand": "OnePlus",
    "model": "OnePlus 6T McLaren Limited Edition (Speed Orange, 10GB RAM,256GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Sounds quality : 5/5 (unexpected, dual side stereo and Dolby is awesome, loudness, clarity and effects are far better then any other phone i.e. mi 7 pro, Lenovo, Samsung or honor)Photography : it's similar to other available options in market, day light as usual is very clear and crisp, didn't get time for more night photography, but few repetitive uploaded pics are in night mode with very minimal light which are good. Performance : not played many games but seems good, while opening any game auto memory cleaner will run,lag and heat issue is not there (checked continuously 1.5 hours)Memory space : 46 GB free space, all basic apps are pre installed, separate as card slot is available (apart from 2 SIM slot), 1.86 GB ram available after all updation, while playing any game also 900 to 1 GB space is availablePros : apart from above mentioned points :1)Front cam is good like other similar phone (mi, real me, honor, Samsung)2) earphones quality/look is very good in this range.3) dual speaker position is in front top of display and near to charging pin, so stereo comes properly4)face detection is fast5)no heating issue while charging /YouTube",
    "brand": "OPPO",
    "model": "OPPO A5 2020 (Dazzling White, 4GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Good deviceBattery backup is goodFast ChargingLight WeightHas 3.5 MM headphone jack",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Pros - Leather back warmth feelCons - Back Camera's not upto the mark when compared to the phones in market and of this price range, though it has given a sleek and leather finish with minimized thickness. . Silicon back case (if you're looking for touch and feel of leather back, better not use.. but use a side bumper if available for protection) Do also post where we can find side bumper, cos it's hard finding for new phones.. Thanks!Looking for a Standout design in 15-20k range?",
    "brand": "OPPO",
    "model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "Now about Oppo 17, this is very light weight, speed is good, I ordered dynamic orange.",
    "brand": "OPPO",
    "model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "Weight of the Phone is very less when compared to any phone in this segment and this matters a lot to me while carrying or casual music listening or any stuff.2. Design is excellent and it is the slimmest phone at 7.43mm6.",
    "brand": "OPPO",
    "model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "It's not worth for this amount after Unboxing and using it for a moment I feels like that, because I am using oppo mobiles more than 3 yearsBut this product is okay by weightless,fast charging  but not okay with with cameras,finger print accessibility, battery performances,And processor is snap dragon 662 nothing more specific things .So oppo have to launch little bit better quality product for this amountDynamic orange 🍊,first you realise the colour of orange and this phones colourDon't try to give fake colour or spread fake informationsSo I don't suggest to buy this product to anyone",
    "brand": "OPPO",
    "model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "build"
  },
  {
    "text": "The curved edges and design are beautiful . If you are a person who would want a premium feel smartphone with excellent display, video streming experience , good design, good camera setup and fast charging : Go for this one .",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "I was aware that oneplus is manufactured by oppo, hence quality & durability never a barrier. They make sure customer feel premium from first look itself, have to admit they invest lot in box.",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Suparb profermance soupar lookAfter 3day experience  feeling real ultimateToo many new experience with this phoneMay be cost is to much but best look and proforms",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "If this is the quality if oppo wants to release in the market at this price range, better don't make audience feel awful with the products.",
    "brand": "OPPO",
    "model": "OPPO A1K (Black, 2GB RAM, 32GB Storage)",
    "stars": "3",
    "aspect": "build"
  },
  {
    "text": "Design: Its a killer look, definitely gives a premium look (5/5)2.",
    "brand": "OPPO",
    "model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Reno4 pro phone truely feels like a premium phone.",
    "brand": "OPPO",
    "model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Here's how I feel.",
    "brand": "OPPO",
    "model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "build"
  },
  {
    "text": "Firstly speaking, samsung claims to have a 4000mAh battery, which sounds good but use it and you will feel that it is not actually keeping the charge for the required hoped time. Also i feel like the speaker of this phone is not upto the mark.",
    "brand": "OPPO",
    "model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "The back glass design is just awfull. If you feel like the glass back design looks just awesome(specially black one), just go ahead and fall in love with that design!!",
    "brand": "OPPO",
    "model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "Love the samsungProud to be a Samsung user love the design love the display yeah fingerprint sensor is little slow hope this will be improved by the upcoming updates",
    "brand": "OPPO",
    "model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "It's not worth for this amount after Unboxing and using it for a moment I feels like that, because I am using oppo mobiles more than 3 yearsBut this product is okay by weightless,fast charging  but not okay with with cameras,finger print accessibility, battery performances,And processor is snap dragon 662 nothing more specific things .So oppo have to launch little bit better quality product for this amountDynamic orange 🍊,first you realise the colour of orange and this phones colourDon't try to give fake colour or spread fake informationsSo I don't suggest to buy this product to anyone",
    "brand": "OPPO",
    "model": "Oppo F17 (Classic Silver, 6GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "build"
  },
  {
    "text": "Build quality - A+  4.",
    "brand": "OPPO",
    "model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "After lots of research with around 30K budget initially i wanted to go for K20 Pro but have been using MI phones for last 4 years so it seemed only hardware upgrade with everything feeling same.",
    "brand": "OPPO",
    "model": "OPPO Reno 2Z (Luminous Black, 8GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Good build qualitySharp displayPowerful processorSolid battery lifeDecent daylight camera performanceFast ⚡ chargingNo heating issue",
    "brand": "MI",
    "model": "MI Poco M2 Pro (Green and Greener, 6GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Hi guys,In general the phone is nice and does manages to provide you the feeling of a premium phone. However in comparison with One plus 8 pro I feel that MI 10 is slightly behind because of the MIUI bugs related flaws, FHD+ display and outdated secondary camera hardware (including front camera.",
    "brand": "MI",
    "model": "Mi 10 (Twilight Grey, 8GB RAM, 256GB Storage)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "Awesome performance beautiful design fall in love excellent Mobile battery back up 2 Days overall my rating out of 5star budget phone keep All buy this product",
    "brand": "MI",
    "model": "Mi Redmi 8 Phone (Sapphire Blue, 4GB RAM, 64GB Storage))",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Awesome performance beautiful design fall in love excellent Mobile battery back up 2 Days overall my rating out of 5star budget phone keep All buy this product",
    "brand": "MI",
    "model": "Mi Phone Redmi 8 (Emerald Green, 4GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Awesome performance beautiful design fall in love excellent Mobile battery back up 2 Days overall my rating out of 5star budget phone keep All buy this product",
    "brand": "MI",
    "model": "Mi Redmi 8 Ruby Red, 4GB RAM, 64GB Storage Smartphone",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Awesome performance beautiful design fall in love excellent Mobile battery back up 2 Days overall my rating out of 5star budget phone keep All buy this product",
    "brand": "MI",
    "model": "Mi Redmi 8 Smartphone (Onyx Black, 4GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "The phone feels somewhat cheap in red to be honest. I also feel they should have not supplied with the cheap *** and flimsy phone case (Its an insult lol).",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "3",
    "aspect": "build"
  },
  {
    "text": "Overall the phone feels bit heavy given the small form factor, which indeed feels good in hand.",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "Build quality of phone is good.",
    "brand": "MI",
    "model": "Mi Redmi -Note 7S (Onyx Black, 64GB, 4GB RAM)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "The iPhone 8 if compared with its predecessors (iPhone 6 / 7) is truly a powerhouse when it comes to performance. The A11 Bionic chip has played an absolute  role in maximising the efficiency of the iPhone 8. As for the battery, it’s always better to turn off the mobile data or Wi-Fi on an iPhone when not in use to make the battery last longer than usual. When it comes to make a choice between an iPhone 8 and an iPhone 8 Plus, I’d personally recommend the 8. The screen size is pretty decent, fits in your pocket well & at the same time the iPhone 8 maintains the essence of an iPhone. However, if you’re into larger phones or photography (Dual Camera & the Portrait Mode), the 8 Plus is a great option. The all-glass panel makes the iPhone 8 a bit heavier than the iPhone 7 however, it adds to the style making the device look more premium. I’m not really into photography so wouldn’t comment about the camera but the iPhone cameras have always been the eye candy for almost everyone.",
    "brand": "Apple",
    "model": "Apple iPhone 8  - Gold",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "I feel pathetic that after spending big amount i had to suffer so much.",
    "brand": "Apple",
    "model": "Apple iPhone 8  - Gold",
    "stars": "1",
    "aspect": "build"
  },
  {
    "text": "This space grey 64 GB base model was delivered to me on Oct 19th. Obviously the price tag. The base model should certainly begin at 128 GB or higher. 64 GB is not gonna be enough when storing 4K videos.3. Optical zoom in camera is still 2X, where as Android phones already have 5X zooms. The Camera. 4K video recording support on front camera is an additional bonus.2. Battery Life. Display. Face ID is faster. Dark mode is a welcome change.",
    "brand": "Apple",
    "model": "Apple iPhone 11 Pro Max  - Space Grey",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "The iPhone design is good and the camera quality is awesome.",
    "brand": "Apple",
    "model": "Apple iPhone 11  - White",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Slightly bulky and weighty - if u r shifting from iPhone 7 or 83.",
    "brand": "Apple",
    "model": "Apple iPhone 11  - White",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "having used both, I definitely feel iphones are quite premium and offer the best tech.",
    "brand": "Apple",
    "model": "Apple iPhone Xs Max  - Gold",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "The iPhone XS Max combines a big OLED screen, great speakers, great cameras, great battery life, and blazing fast speed into the best user experience on a smartphone. For the record, Apple will support this phone with software updates for 5 years...the Note 9 is a 2018 phone running 2017 Android software and Samsung gives software updates for 3 years. I’ll list some pros and cons and also what the tech media won’t tell you. Pros:- battery life is all day- upgraded speakers get real loud- fast and smooth- Siri has been given shortcuts- upgraded cameras are just as good as Samsung cameras now and the front camera is better than the Note 9 front cameraCons:- expensive- slow speed charger- A case is almost mandatory especially if you are clumsyBottom line...the iPhone and Galaxy phones are the best phones on the market right now. The iPhone is a step ahead because iOS gets frequent updates and starting with iOS 12 Apple actually sped up old iPhones and iPads which will allow users to keep their devices longer. An iPhone is now like a laptop and something you only need to upgrade once it breaks. The iPhone is also the ONLY smartphone that can stream all video apps in full screen. Android doesn’t have full screen built into the OS so video apps like HBO, Showtime, Cinemax, STARZ, Encore, and EPIC are all tiny on the Note 9...those apps are all full screen on the iPhone.",
    "brand": "Apple",
    "model": "Apple iPhone Xs Max  - Gold",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "It’s an iPhoneGold colour colour done the job very wellA12 Bionic chip processor is strongBuilt quality is good then iphone xr and iphone 11Camera perfectPeople will love this 2camera design not the iPhone 11 pro max design",
    "brand": "Apple",
    "model": "Apple iPhone Xs Max  - Gold",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Though it is expensive, i believe its worth the money.. I feel its much more secure than Android and its not forcing me to have Facebook, Youtube etc that my Previous Samsung phones always did...",
    "brand": "Apple",
    "model": "Apple iPhone XS  - Space Grey",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "I identified issue with main camera)Contacted Apple service centre and their response is “that is how iPhone X & iPhone Xs designed”Raised issue to Apple customer care number and shared the sample pics and other required data to analyse.",
    "brand": "Apple",
    "model": "Apple iPhone XS  - Space Grey",
    "stars": "1",
    "aspect": "build"
  },
  {
    "text": "From its seem less design to its attention to minute details (thx to the designing team behind it) , it will force you to agree that its insane price tag is justified the moment you hold it .",
    "brand": "Apple",
    "model": "Apple iPhone XS  - Space Grey",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "No matter how much you hate the design it seems this is quite an \"IN\" thing now for almost all phone manufacturers have started copying Apple.",
    "brand": "Apple",
    "model": "Apple iPhone X  - Space Grey",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "I love this ❤️ mobile because it's designed so good 🤩🤩 and performance is also  good ☺️ but phone charger is so slow 😣 😑 but overall phone is so good 👌",
    "brand": "Vivo",
    "model": "Vivo Y20i (Nebula Blue, 3GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 (Black, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "Superb phone 👍👌 light weight and have a premium look , camera quality is outstanding and the phone contains to many animations..which makes the phone more interesting ..must buy it guys..profermance is also good , music is loud",
    "brand": "Vivo",
    "model": "Vivo V19 (Piano Black, 8GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "After 1 month Use1.Look and Build quality Good2.",
    "brand": "Vivo",
    "model": "Vivo V19 (Piano Black, 8GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "build"
  },
  {
    "text": "front camera awesomerear camera good and better in sunlightbattery back awesome with 4500 mahawesome designawesome black with blue graphicsfast charging good4 gb 128 gb still no laggingheadphone good8 out of 10must go for it",
    "brand": "Vivo",
    "model": "Vivo S1 (Skyline Blue, 6GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "build"
  },
  {
    "text": "Once you will keep the device handy it will give you a feel of it.",
    "brand": "Vivo",
    "model": "Vivo U10",
    "stars": "5",
    "aspect": "build"
  }
]