[
  {
    "text": "Camera, display etc. are satisfactory. Overall, its good non chini phone with good camera and display, a bit bulky, satisfactory speed, scope of tremendous improvement in UI and setting, and bit overpriced.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "User Interface:User interface needs tremendous improvement. You can't take screenshot easily. You need to learn fine motor coordination between your fingers and power&volume button with microsecond precision. After three days I discovered taking screenshot by swapping screen. But this easy method for taking screenshot is not easy to find in its setting section. Automatic redial isn't available. also in setting section, searching for basic operation like redial, call waiting etc are either missing or very difficult to access. UI should be more intelligent and intuitive.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "if you use it continuously then you feel pain in your  hand, designed is out dated, poor quality material.. camera is just okay.. Lookwise not goodDisplay qaulity is just good not bestSound quality is goodCamera not much good that I am expecting.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Indeed its a big and bulky phn but easy to handle. I hv heard tht recent samsung phns have ths issue , however i dnt see any in ths phn. Its as gud as my past phns Asus 6z and Vivo v15pro. Battery ofcourse was the highlight while buying ths phn. I received this phn at 43%. And even after a rigorous 3 hr session of data transfer and apps installation it still holds at 33%. I believe it gonna last 2 days easily wth heavy net usage , mild games and gud 2 hrs of talk time.4. I tried playing 7-8 apps at the same time and it never hanged or lagged despite 50% memory up. Yet to try on heavy games though.6. Its one of the best non chinese phn available in the market for those who r luking for a huge battery wth a decent cam and light gaming purpose. Wld update on battery and cam after few days of usage",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Camera quality is really gud wth many features which luks tempting which im yet to explore. Have all latest features like slow mo, 10x zoom, focus lens, panorma view and other added features.3. Front cam does spoil the fun while watching full screen videos, like a small black dot bt can be lived wth.7.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "There's something wrong with the new Samsung M51 mobile. We are unable to connect through Wi-Fi on Samsung M51.Meanest Monster Ever ... HahahahaThis meanest monster is performing poorly within 5 min of unboxing. Issue: When you trying connecting through Wi-Fi, on giving correct password, it says \"Incorrect Password\". I have done every troubleshooting step suggested by Samsung Tech support:1. The most irritating thing is how can a company like Samsung mess-up such a basic feature & to the surprise, even the tech support has now run out of troubleshooting solutions. Instead of replacing it with new phone, tech support has now told me to get the hardware fixed from Samsung Service centre. I don't get it why should I take a brand new phone to service center & get it opened. Instead a replacement of this phone should be there, I have not even used it for more than an hour. Last year I ordered an MI phone from Flipkart, the battery was getting drained very fast. Within the next day, the phone was replaced without questions asked. Don't spend your hard-earned money on this phone. Unfortunately, if your phone turns-out to be faulty, then there is a never ending process to take care of issue.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Camera Zoom quality is not good. i.e saturation level is too much high in this phone (Image attached).16. While watching movie video in this phone or playing video in youtube brightness fluctuate fast too much automatically i.e Adaptive Brightness issue. Camera quality Good3. 7000 Mah battery4.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Charged fast.- Mobile speakers sound is good, but I prefer external speakers for better bass in music.- Camera is really good. Macro performance is very good - look at skin in tatoo photo and dust perticles in deskphone photo!! (photos of M31 are from other phone). Both front and rear camera support FHD video 3840x2160.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Camera Quality: Picture quality is just awful. Its worse than a 8MP camera. The pixelization is obvious and it is definitely not a 64MP camera. The quad camera is of no use as the macro camera reminds me of the decade when VGA cameras were common.2.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Battery: Samsung may claim the battery will last for two days but it didnt last that long - no Netflix, Prime Video, heavy games being used. Performance: Streaming videos and playing heavy games was smooth for the first 4 days but then again Samsung is known for fast deterioration of performance, so I will keep my eyes and ears open.3.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Phone camera is not good , samsung says it's 64 mega pixel but its photos like 8 megapixels .photo detailing are not good  .",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "Not a Samsung performance. But got shocked to see the poor performance n battery life. Battery life worst then M30 which has 5000mh. Mobile heats on charging.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "3",
    "aspect": "camera"
  },
  {
    "text": "decent camera4.",
    "brand": "Vivo",
    "model": "Vivo Y91i (Black, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Camera: 3/5Back camera pretty good but front camera's low light output is very low.. many features available such as slow and super slow videos available..",
    "brand": "Samsung",
    "model": "Samsung Galaxy M21 (Iceberg Blue, 4GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Display is good . Battery will last 1 day with normal usage.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "It is perfect size , perfect placement of power and volume buttons, has dust on phone after opening the box but the box was sealed, same thing happened to me when I bought M31,Pros.* Perfect size* Samsung brand* Good build quality for this price* Android 10* One UI 2Cons.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "camera is below average* Average display quality*",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "The cameras are not as good as other smartphones in this price but it gets the job done. cameras are not good compared to other smartphones.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Lots of intelligent features at this price like limiting screen time for each app and winddown function in the night etc.. Camera is decent for normal photo.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "CAMERA.This time M series did a honest job by giving us a INTELLI camera of 64 mwgapixel with Single Take feature. My usage of Camera is high & I found no complaints at all in focusing a shoot.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "BATTERY.Main Tested. Good color saturated. Well bright night shots. Macro shots r OSM.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Camera is overall good. Can't say it's a camera centric phone obviously.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "People who r looking for camera please don't buy m31s.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Hopefully Samsung will release a patch to fix this3.Camera: Impressive.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Canera - Excellent camera - Good low light photography.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Photo - Video : Excellent quality of photos and Videos even in a 3x Zoom. Front camera is bit down.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Bought it on Amazon Prime day sale. Placed the order by 00:04 of 6th August (Day-1 of the sale) and got it very next day Noon 2pm itself. Kudos Amazon India. Grabbed it for 15,999 with a 2k coupon code and HDFC's 10% discount. Delivery date is 18th to 25th Aug which is pathetic. Charged a 100% and had an extensive usage (not a gamer).",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "But, ordered a Matte Back cover and Matte Temper glass (As it didn't come with the box and also wasn't available near me in Chennai). (Earlier was using OnePlus 6) While updating the phone on first start, i felt bit heat. But, doesn't have indicator on the front face (which shows if notifications are received)No option to find app usage statistics. But the box doesn't have USB - charge cable.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 (Space Black, 6GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Camera below average still expected but samsung should work more on this front if they wanna beat chinese phones.2.Not for gamers and thats expected buy a 4gb Ram 🤔 based phone why reading me?😉3.finger print and face lock missing I Can manage but most indians can't.4.Battery takes 3.15 hours to charge to work for 12 hours of calling and surfing and thats not bad at all but can be issue for chinese phone lovers who have habit of charging again and again to play pubg. Overall out of 5.Camera-2  Gui-4  Screen ppi-5  speed-4  android-4Don't buy a phone only because of specifications must see integration and longevity overall a nice secondary option and primary for featured phone switchers.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "After using 4/5 days suddenly without notice, the phone shutdown automatically and I couldn't restart it. So contact with amazon for replacing it and get very quick response from their end and they book a time slot to verify it by a technician. But after few hours later I found in start up guide send by Samsung,  how to restart when it stops working or hanged( by pressing power and volume key simultaneously for seven seconds or more). The fault is from the end of Samsung company I suppose, because they should mention the process on the front page with bold letter. I faced hanging problem for one day only till now , which can be easily solved by pressing volume down key and power key simultaneously for 7 seconds or more.8.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "After using one month I want to add some extra points which impressed me.1. Sound quality and graphics are very good.2. Smooth touch sensitivity3. Ringtones are much louder.4.Two volte nano SIM s work fine together.5.Battery backup is good. Charging time is not so lengthy.6.Any SIM can be switched off manually, that impressed me.7. 2GB ram and 32 GB storage is better option for budget friendly people.8.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "-- All latest version of Apps in a lite mode which means what we need only will be loaded and given instead of \"loading all forever\" and wasting our Precious Data.-- A good Camera with Samsung Reliability is known for its Crisp Camera and Displays.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "We ordered \"Samsung Galaxy M01 Core (Blue, 2GB RAM, 32GB Storage)\" and thrown away the chinese phone Salomi as it had 100 other Apps Pre-Installed without our information and heating phone and draining battery. Samsung Galaxy M01 Core (Blue, 2GB RAM, 32GB Storage) -- is a small enough to keep in pockets and has all the Latest Android 10 OS with a Good Display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Me and my friend both purchased the same phone for our aunts and are facing the same issues. The main issue I am facing is that the phone switched off 2 days back and since then I am trying to switch it on but its leading me nowhere. Phone heats up while charging as well as in normal usage conditions. While charging the phone heats up to an extent that one may feel that it could blast. My friend also faced the phone off issue but it was resolved automatically after 2 days when he connected a fast carger to the phone. His phone still switches off on its own again and again now and then... All we both are able to do is to regret on wastage of our money.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "I have recieved this phone on 14th of August 2020 and today is 24th of August 2020.So After 10 Days i am reviewing this phone because i have seen many negative reviews on amazon review portal so now my true experience is about this phone following.1:- Processor Media tek Quad core Is best because quad core take less power from battry than the octa core processor. and i purchased this phone for my mom so quad core porcessor is sufficient to my mom.2:- Battry life is good because of Quad Core Processor.3:- Ram is 2Gb that is also sufficient4:- Display as always awesome as samsung provide.5:- Mike and Speaker's quality is too good as always samsung provide.6:- Many People said in the review that the mobile is automatically swiched off and on automatically. every new phone have done this one time because of system works smoothly. and after one time switch off on things happen then never repeated till my 10 days of use this phone. this is one time process when phone is new sometimes phone may swich off and on automatically. most of the people want to replace the phone because of one time switch off on problem then i have to say one thing that your first phone is the only phone who is brand new and the replaced phone never be a new phone at all . so never replace your new phone. this is my own experience.8:- I am fully satisfied from this phone in this price of 6499.9:-This is all the reason that is why i am giving 5 star this phone. Thank U Samsung.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "4K video recording @ 60fps is absent but 1080@60fps performance is quite good. Also, if you're expecting flagship camera performance, you might want to consider other phones.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "The camera is not as good as it was expected. The macro lens is pretty useless, and the main camera lacks depth and the colors aren't as vibrant as OnePlus 8. (The camera is better than most phones out there but it isn't what we were promised)2) (Pixel 4a is about to release, that's far better probably)Update: Pixel 4a camera is surely much better that Nord's camera.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "While i am still exploring the phone, the one aspect that is a complete let down is the camera. Most phones these days look and feel alike with the camera being one aspect that sets the winners apart from ordinary phones...i dont know what you guys did here.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "3",
    "aspect": "camera"
  },
  {
    "text": "Camera quality on par with top model one plus devices in case of outdoor pictures, Indoor/low light pictures are not that good...Not a fan of punch hole cameras..would have preferred full screen with pop up instead.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Morning to Night usage possible with moderate to slightly heavy usage.... Battery usage - needs to be tested but seems to be ok....",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "So here is my first impression:• Display is so nice and 90 hz refresh rate feels so nice and smooth.•Camera is okay, but not upto the mark..macro lens and depth sensor at the back is just crap. Wide angle is okay, but images are too smooth without any crispness.•60 fps video recording at 4K is not there at rear cam, but is present for front cam.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "So much of hype and the camera is not even upto the mark.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "Grainy pictures, looks like I have applied some kind of filter for my selfies.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "Got it delivered yesterday , used for about 5-6 hours , to tell you this is my first mid ranger previously I was using s9 plus , before that s7 edge and iphones in stone age .My first one plus , a mid ranger , I assure you it's no less a flagship experience , forget bout negative reviews, no device is perfect .This one has looks , power and performance , don't know how useful is 5G modem but who cares that's the baggage we consider it as of nowCamera unit is also awesome perfoms well and remember it's a bloat free and advt free experience of OXYGEN OS .Cons , I am yet to discoverENJOY the NORD",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Camera could've been a little better.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Got it delivered yesterday , used for about 5-6 hours , to tell you this is my first mid ranger previously I was using s9 plus , before that s7 edge and iphones in stone age .My first one plus , a mid ranger , I assure you it's no less a flagship experience , forget bout negative reviews, no device is perfect .This one has looks , power and performance , don't know how useful is 5G modem but who cares that's the baggage we consider it as of nowCamera unit is also awesome perfoms well and remember it's a bloat free and advt free experience of OXYGEN OS .Cons , I am yet to discoverENJOY the NORD",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Ash, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Sound quality is not good- Good Camera but it should improve with sw update, since hw is capable.- Below Average Battery.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "No battery indication or notification led when screen is off. You have to tap button to see these on screen.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "Camera: I don't use the camera much so can't comment about this aspect.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Battery: Getting 8-9 hrs of SOT even with 1-1.5 hr of casual gaming. Performance: 90 Hz ref rate makes app opening, scrolling super smooth. No lag faced during gaming, scrolling through social media. A bit slow fingerprint scanner.2) Slight heating during charging and extended gaming periods.3) Didn't find appropriate customisation options for font.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "The front camera is just waste.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "and I was still impressed with that phone in every aspect camera & performance.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "90hz is much smoother!About camera.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Front 4/5Back 4.5/5Best NightmodeUse with Gcam💥Processor. ⚡4.5/5Battery 4.5/5Strong reasons to buy: oxygen OSMan",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Camera is superb as expected.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Looking at Images on articles, etc were looking just good.5th OnePlus 8 6gb variant - As told above there are no 2 parallel lines, punchy colors, not dull and very good display, however still yellowish in large part of the screen and whitish around above and right & left edges of the screen in vivid mode (I did noticed in some displays it was not this warm). I also know screen being yellowish a bit makes video viewing an amazing experience to make it more natural for skin color, etc.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)",
    "stars": "3",
    "aspect": "camera"
  },
  {
    "text": "On the first glance you will feel the premium quality of the Oneplus 8.I have mentioned few good and bad points for quick understanding for every buyer -Good -Very good build qualityVivid displayExcellent performance and softwareSolid battery lifeDecent camera performanceChic designConsistent performanceOxygen OS is blissClass-leading displayBad-No IP rating or wireless chargingLow-light video could be betterBasic cameras setup",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Camera quality is worst than OnePlus 6T",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Obviously, you might have done extensive research, watched many review videos before coming here to make your purchase decision. Camera is going to serve you well on many occasions (when the lighting is good). People might have told you that the camera system is mediocre. There have been few software updates and I can confidently say that yes, the camera is neither great nor is it bad. It delivers decent pictures (when the lighting is good) and if you are not a absolute camera geek, then this will meet and succeed all of your expectations. Incase you are a camera geek, then get the 8Pro and dont think about saving money.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Day to day, if this is what is most important to you, then this is the device to get. It will easily get you through more than a day with a full charge. Cant go wrong - Just buy the damn thing!",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Pls, note I have bought it with my own money unlike leading reviewers or unboxing video geeks who get it for free. I have clicked a magazine cover picture with my Oneplus 5 which had only 16 MP camera but pic quality was natural and good. No camera quality, no battery life, no sound quality on calls, getting wounds on holding it for long.",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "3",
    "aspect": "camera"
  },
  {
    "text": "Camera: Then I had to go for a conference there I tried clicking pictures. Picture quality did not come out well. So I continued clicking pictures which really missed detailing. As you zoom in it will make it blurred. It clicks blur pics may it has to do with image Stabilization.3.",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "3",
    "aspect": "camera"
  },
  {
    "text": "Awesome experience..best in class camera... oxygen os..love",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "The amoeld display is stunning and camera is amazing. And it took me 40 min to charge from 2% to 100%.PROS:CAMERA - 4.8/5BATTERY- 5/5Display - 4.7/5Performance - 4.8/5Speed - 5/5Gaming experience- 4.8/5CONSNO Camera design could have been made better (But I feel better compared to Apple 11 pro)Overall: 4.7/5  One Plus proves again why its the BEST MOBILE right now.",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "3 CAMERAS ARE ONLY FOR NAME SAKE.I WAS VERY HAPPY ONE PLUS CUSTOMER, BUT NOW I WON'T RECOMMEND THIS PHONE TO ANYONE.",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "IMAGES LOOKS GRAINY AND UNSHARP IN COMPARISION TO ONE PLUS 5T OR 6T. PHONE RATIO IS 20:9 SO INSTAGRAM IMAGES WILL BE IN SHOWN IN PORTRAIT MODE INSTEAD OF LANDSCAPE MODE. IMAGES ON THE SCREEN IS SO BLURRRY2. SO MUCH CAMERA BULK. CAMERA QUALITY IS AVERAGE. NO INCREASE IN PICTURE QUALITY.",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "It doesn't require PIN/ fingerprint sensor sometimes. It gets unlocked by side power button which creates a big security issue.",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "i am using this phone just a day..but there are  two main problem i notice so far...one is in video black depth is more and the second one is adapive light censor is worst part.in low light it's horrible.it can't match half of the samsung note,or s mobile.battery back is good far better than samsung and processor is absolutely powerful.playing pubg isn't that great experience it's lag many time.pls oneplus fixed lowlight display problem..",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)",
    "stars": "3",
    "aspect": "camera"
  },
  {
    "text": "The punch hole camera does not spoil the overall screen experience as some people have said. I have found the cameras to be decent enough. Videos are very stable though. This has come close to the iPhone cameras as a video shooter. This might even offer better stabilization than the iPhone videos. The colour filter camera is disabled out of the box. You'll find a Dolby sample video in your gallery. The phone that I had received, I used it for about 2 weeks and discovered it had this image retention issue. The afterimage of anything displayed for a period of time on the phone for a long time is displayed on the screen even after the original image is pulled off. This could be seen while watching Youtube videos in non-fill screen mode or videos that have any kind of frame visible or even games like PUBG where static elements of game like the map's frame or your controls would be visible on certain background colours even after you have turned the game off. The image retention issue could easily turn into permanent screen burns really soon.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)",
    "stars": "3",
    "aspect": "camera"
  },
  {
    "text": "During charging its heat a lot .Front camera of this phone is Just pathetic. In whatsapp video call is worse. Even with default camera app,the front camera is bad. Back camera is decent.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "You can see red tint in lower part of screen in first 2 images and crushes in colour in third image that is even at normal brightness.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "====I am a Design Specialist by Profession & also into Mobile Photography, hence I was hooked in using the Pixel 2XL. RAM Management is splendid & 8GB RAM is recommended unless you want to get the 12 Gig McLaren Edition to save on a few seconds everyday.==== Camera ====I honestly have to admit that it's not the best out there as I was expecting a leap from it's predecessors. It still uses the Sony IMX 586 (48 MP) for it's main sensor and it's Telephoto at 2.2X optical (3X lossless) and is at par with iPhone. But when compared with the GCam Mod, the OnePlus Camera seems to have improved a lot from it's previous versions. Although not the fastest charger in the industry, it still gets through a day on heavy usage.==== What could've been improved ====- Minor improvements on Camera.- ROG 2 is hands down the best gaming phone with 120 HZ Display but lacks majorly on other aspects like software updates, Telephoto Camera, Splash Proof, Build Quality and security patches which are very essential for business professionals or regular consumers.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "What's in the Box? User Manual. Transparent Silicon Case.SIM Ejector Tool. Warp 30T Charging Brick. Type C USB Cable. I would recommend using a case so that the edges don't feel slippery.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Nightscape is now available for Wide Angle shots too.==== Video ====If you're into Video Recording, then be a bit disappointed to hear this as it isn't the best while it can still take average videos without much shake utilizing the OIS and EIS at 1080P and just OIS at 4K 60FPS. OIS and EIS combined together has a lot of warping and rolling shutter which is a turn off for video producers. The videos look oversaturated too which can be fixed by shooting on a Third Party app like Filmic Pro.====",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Camera: All of my previous mobiles had great cameras.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Its fastest phone that I have ever experienced. Overall smooth experience between switching apps and regular functions. The phone is so fast it takes some getting used to. Charging speed as advertised.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Magnificent Macro mode and Night mode  in camera.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "You just can't stop admiring it.2)Excellent camera - The pictures come out so well in all kinds of lighting and modes. *Portrait*- The new zoom mode in portrait is just wow. You get crisp and clear pictures without any noise. Popup camera - If you are hesitant or doubtful about popup cameras...I am telling you there is nothing to worry... It is Soo smooth and quick that you never will notice it is a hardware controlled camera.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "I had been using the OnePlus 5T before and a big fan of OnePlus cameras and OS.But I've always felt the OnePlus display wasn't good enough. Loved the camera setup in OnePlus 7T but hated the circular bump.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "I was really happy to have this phone, switching from apple to android. The phone is really big and has lot of power in it, no problem in playing games, its like silk smooth games, navigation between apps, super fast.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "I was not able to perform any action, it made me handicapped for 3 hours, where I cannot do anything... Check the videoFinally, I am returning it after long conversation with Amazon support and the OnePlus team.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "EXCELLENT PRODUCT WITH SUPER FAST SPEED!!Review :Camera - 4/5Battery - 4/5Display - 5/5Processor - 5/5Software- 5/5Overall 4.5/5Go for it!",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "After 3 days of use..Battery - 5/5Camera- 4/5RAM performance- 5/5Superb phone- a real flagship killer.. Must buy",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "It's about how the rendered images look and feel. Some images are washedout as indicated on many online reviews and if you feel like zooming in on your shots, you will regret clicking that picture in the first place.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "OnePlus 3T had a better camera than this, in my opinion.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Camera:It is clear that only 3 rear camera are working right now. Rather than every sensor of all camera working fine. Pictures taken by rear camera with all mode is so bright that u can find every details in the pictures.48 MP wide angle camera is take so wide and beautiful pictures. On front camera section it take good bright pictures, but i think in portrait mode it take little bit artistic image than real.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "It wasn't expected from one plus,I am facing the same issue which is experienced by most users on one plus 8 pro ,something which is called black bar issue near front facing camera when brightness of the phone is set to low,really not expected one plus.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "OP3 earpiece volume had deteriorated very much over time.- Rear Camera has improved a lot, but I can already feel that there are still rooms for improvement. Also, watch YT videos in landscape mode.- Lack of the 3.5mm headphone jack is the biggest let down for me in this phone.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Also, the camera bump is quite prominent.- But I can see a black bar running parallel to front camera module under the lowest brightness setting.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "I dont play any games, my phone usage is mainly social media, instagram,facebook,reddit, twitter and bunch of other photo edit tools like lightroom and snapseed. I bought the oneplus 8 pro selling my DSLR camera so that I can record all my videos on phone itself plus its waterproof. Recently I shot a video at 4k 60fps and I guess within few minutes the phone got so heated that it disabled the camera from video shooting until the phone cooled down!! Now whats the use if I cant record a video even for few minutes straight on 4K?Camera - To be honest, stabilization is really great while recording video however photos are almost as good as oneplus 5 if not slightly better. Video clarity is really great, far better than the oneplus 5.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "It lasts comfortably until night one one charge. Yes war charging is faster, but the charge which doesn't last one full day is conerning for me. Since I travel long distances most of the days. Especially look and feel, screen is really good. Even the build quaility feels nice. Tested in rain couple of times and it worked great.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "( Attached photos for reference)2. ( clearly visible in the photos)3.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Front and rear camera really sucks. Camera seem to be ordinary as <15k budgeted phone. I was amazed by the youtube review videos about this phone. If your are looking for a great camera and battery.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "I have been a OnePlus user from few years. And I have upgraded it from OP 6.I must say I have made the right decision. Pros: fast phone, 24 hours + battery backup, wonderful screen, no hanging, no lagging, optimzed oxygen OS.Cons: 8GB + 128GB is good enough for moderate users. PS: people who are still waiting for \"pro\" just don't think about the price. There are lot of things which you will be bound to buy if you get pro model. (4000₹) wireless charger, etc.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Camera is still not upto the mark, especially in low light. Sometimes it over expose images.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "The touch is super smooth, face unlock is fast as a blink of an eye, I constantly use google assistant which response pretty well, I am blown away with the camera quality and audio quality that is powered by Dolby Atmos. I have used this phone for my online meetings as well, the screen renders images and videos pretty well.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Cameras are decent and produce decent pictures in day light and struggle little bit in artificial lighting. Overall look , feel , battery and everything is great and cameras are decent for day to day usage.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Not only this when I play game at bottom of the screen I can see some disturbance too which u can c in screenshots and videos I uploaded with the review. Go through the images n video n ull get to understand that y u shud wait for another version or look for another options.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "Camera : 3.5/53.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Battery - pretty impressive, charges constantly in 1hour time, gives 2 full days with Screen on time around 5-6 hours, in one week just charged 3 times- 90HZ to say it is awesome- So many sensors like heart rate, step counts, Health app etcOverall at current market this device looks good for the money spent, will post future experiences too after some time",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "( had also replaced the battery last year)Within 3 weeks I had done my research on various models at various price pointssome of the phones I considered wereMoto G5 plus----> excellent reviews all over, but camera is a compromiseMoto Z play------> good battery life...but specs wise ok and additionally it is made to support the moto mods so design looks funny with the pins at the backHonor Pro 8----> phone has some heating issues while using cameraOne Plus 5---> other than jelly effect no significant issues seen on the internetIPhone 6S ----> if IOS fan, then go for it but take the higher memory version as 32gb is too small for Ios apps. IPhone 7----> camera not as good as galaxy s8 , pixel or one plus. I will not speak about the specs as most reviews highlight it in detailwhat I liked!Blazing fast  while opening closing apps etcCamera is quite good! but I would recommend a case as it is slippery especially while trying to take selfiesVideos are with Electronic image stabilisation ( 4K too) which is brilliant!Dash charge is very good!latest OS 4.5.8 update is available also to downloadwhat I dislikedCamera app is very basic.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "I have also uploaded some pictures I took under different condtions. I just pointed and shot as I am no expert in photography :)",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Quick processor2. Nice ram management3. Ultra fast storage4. Unparalleled DASH charge5. EIS - the hype is real.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Camera is better than 3/3T. Videos look great after update. Decent front camera. Dual camera setup. OP should have opted for a wide angle combi instead of zoom. Pictures in low light are still noisy.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Camera:OnePlus5 also comes bundled with a dual camera setting. But After So Much Some Things Got Missed Like*OIS Camera Stabilizer*Not IPS Certified*2K Display Resolution*Also Dual Camera Needs Some FixesBut over all its a power packed phone with a reasonable price.#And 5T has made some improvements on camera which are missing on 5 but Front Fingerprint Scanner lover chosse",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "While the front camera is of 8-megapixel, the two rear cameras are a combination of a 16-megapixel lens and a 20-megapixel telephoto lens. Both the lens is made by Sony and the primary camera has an aperture of f/1.7 while the secondary camera has an aperture of f/2.6. The telephoto lens will offer up to 2x zoom and both the lenses will combine together to capture impressive photos with a greater depth of field, akin to the portrait mode of the iPhone 7 Plus.3.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Once you add a good back cover it is very handy. Battery charges very fast and you can get along a whole day with it.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Camera of one plus 5 is best in this price range. Dual camera really makes a lot of difference. Avoids noise because of 2x zoom.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Dash charge is very fast, within 30 min it will be enough charged, but the software upgrade is little buggy, some apps gets crashed and a popup comes in saying \"___ app has stopped, open again\",camera in day is excellent, but night needs improvement.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "iam loving it's speed..rating 10/10Camera: Nice camera.. Daylight photo quite good(samples attached).Night photo though manageable but not as great as samsung flagships.. Selfy photos are very nice.. Overall a great camera... rating:8/10Battery: Great battery.. easily lasts whole day despite heavy use and dash charging is like Cherry on the cake.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Phone is simply superb in all aspects...low light performance of the camera is outstanding...you simply cannot go wrong with this phone",
    "brand": "OnePlus",
    "model": "OnePlus 6T McLaren Limited Edition (Speed Orange, 10GB RAM,256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Quad camera gives good quality photos...6) Selfie camera is also decent considering cost 68007) Other good brands like MI, VIVO, MOTO, etc sells 48MP camera phones for 12000 and so...2) Accessories like back cover, tempered glass are yet not in market...",
    "brand": "OPPO",
    "model": "OPPO A5 2020 (Dazzling White, 4GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "5000mAh battery8) can be use as power bank for other phonesCons:1) Though 1 transparent back cover is included in Mobile Box...",
    "brand": "OPPO",
    "model": "OPPO A5 2020 (Dazzling White, 4GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "how could you think , it can compete other brands by low photography where other brands comes with 48MP quad rear camera",
    "brand": "OPPO",
    "model": "Oppo A52 (Twilight Black, 6GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "Selfie camera outperforms the primary camera which is according to the specs. Primary camera is actually bad2.",
    "brand": "OPPO",
    "model": "Oppo A52 (Twilight Black, 6GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Nice camera",
    "brand": "OPPO",
    "model": "Oppo A52 (Twilight Black, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "how could you think , it can compete other brands by low photography where other brands comes with 48MP quad rear camera",
    "brand": "OPPO",
    "model": "Oppo A52 (Twilight Black, 6GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "Nice camera",
    "brand": "OPPO",
    "model": "Oppo A52 (Twilight Black, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "If you want to buy in terms of display camera then don't buy this phone..",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "8/10Rear Camera- 8/10Front Camera- 8/10Screen- 9/10Sound- 9/10Comes with a cover, ear phones and a charger which is indeed amazing. It has a good camera which has multiple modes to click photos. It's front camera is top notch.",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Very Light and very slim2) 30Watt Charging adapter is too heavy of course it's a 30watt charger4) it's really very very light and slim",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "VOOC charge which charges phone in less than an hour3) Display4) Battery Backup ( not a gamer )5) Rear Quad Camera has separate separate lens cover for each lens which makes easy for replacing lens cover later. I think Camera is not up to the mark2) and I am not a gamer and I am not a heavy camera user. So For camera lovers and Gamers this I don't recommend this phone. It's really awesome however camera is good but not the best.",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "It is good phone but not best in this price range as it is not value for money product. Phone has amoled display which makes it perfect in its category. Screen size, ram,memory, battery are great.",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Excellent working ,good camera features ,ear phones were awsome with real sound tracking technology ,value for money 10/10 ,charging is too good and fast charging.",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Nice camera , nice display, nice battary ❤️❤️❤️",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "It's pro fades out its Con so can go for it blindly but only if you think \"CAMERA'S\" not your \"PRIORITY\"Features I thought would be there was 9.1 surround music/Dolby Atmos",
    "brand": "OPPO",
    "model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "I was using Ralme Xt earlier and it's camera was much better. I am a part time photographer and often I use my phone to click pics.",
    "brand": "OPPO",
    "model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Camera is decent for video calls/ normal phots not that great especially for shotting long-distance objects/ sceneries.",
    "brand": "OPPO",
    "model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "1st Buyer  of OPPO F17Awssm back leather and fantastic phone camera is very excellent",
    "brand": "OPPO",
    "model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "It's not worth for this amount after Unboxing and using it for a moment I feels like that, because I am using oppo mobiles more than 3 yearsBut this product is okay by weightless,fast charging  but not okay with with cameras,finger print accessibility, battery performances,And processor is snap dragon 662 nothing more specific things .So oppo have to launch little bit better quality product for this amountDynamic orange 🍊,first you realise the colour of orange and this phones colourDon't try to give fake colour or spread fake informationsSo I don't suggest to buy this product to anyone",
    "brand": "OPPO",
    "model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "8MP &13+2 MP front and rear camera.",
    "brand": "OPPO",
    "model": "OPPO A5S (Black, 3GB RAM, 32GB Storage)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "emails, conf calls and video. I don't worry about IP68 and Camera. I don't use the camera on the phone much.",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Not for games but professional use. Cons - The charger shape is not ideal. If I plug it in, it interferes with the next plug point or the switch. Should have been lighter and the cable should have been higher quality.ColorOS It is minimalist, material design, and fast.",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Good Camera not the best needs some Software Upgrades6.Better Haptic Motor as Compared to other flagships7.Best Sound In this Price Range or In Android MarketNow",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Video Streaming is an absolute pleasure using this phone. Photos were good. Videos were far better than I expected . EDIT -I have attatched camera samples .After Camera is good and it depends on the individuals use , as to what that person demands from the cam. Front camera was really good and gave decent selfies. But did observe some while recording video . Its almost identical to what Oneplus has to offer except for the smaller ultrawide camera sensors and an increase in price by 5k . If you are a person who would want a premium feel smartphone with excellent display, video streming experience , good design, good camera setup and fast charging : Go for this one .",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Video streaming-",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Battery life is little concern but over all superb phone. Overall it's superb better than one plus 8 pro...",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Screen: That’s the main USP of product, I used apple, samsung earlier but find x2 is best of best in terms of screen. Be it 120Hz refresh rate or resolution everything is best. Charging: 65W charging unbelievable, I never have to wait for charging my phone. Just plug in and you phone is ready for single day. After watching Netflix for 2 hours only 5% battery consumed. I has best qualcomm 865 processor, just don’t think about slow speed. Its history now.5G enabled: Cherry on the cake, what better can expect from any flagship phone. You don’t have to think for next two year to upgrade the phone. Wifi 6: Never thought wifi version make such a difference in network speed, lag free, never found any delay in opening any page. Don’t think twice, if you really want to purchase phone not invest on Brand, then go for OPPO Find X2.",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Pros1.Superb display on par with OnePlus 8 pro, samsung S20 series line2.120hz qhd screen is breathtaking3.Main camera nd selfie cameras are good.. Screen tempered glass is pre-installed...phone back cover given in box also goodCons1.Ultrawide camera is average compared to OnePlus 8 pro2.Type c earphones given in box is mediocre for the 65k price",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Camera quality not good",
    "brand": "OPPO",
    "model": "OPPO A1K (Black, 2GB RAM, 32GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Good mobile 5plens camara is very good",
    "brand": "OPPO",
    "model": "OPPO A1K (Black, 2GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Prise wise Good ProductNice CameraNice soundOverall Nice Phone",
    "brand": "OPPO",
    "model": "OPPO A1K (Black, 2GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Night flare is not available in selfie camera",
    "brand": "OPPO",
    "model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Camera: It's good. the front camera is better than the rear.",
    "brand": "OPPO",
    "model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Pathetic phone, at this price after a week it has lost volume if i shoot from rear camera & from front camera video volume has also come down, Amazon is not responding properly to my complaint, lost hope for replacement.",
    "brand": "OPPO",
    "model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Some camera samples",
    "brand": "OPPO",
    "model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "i have recently bought this phone..on 18 may 2020.. delivery is good but there was no headphones in a box.features r awesome nd phone is working gud.but camera quality is bit bad.",
    "brand": "OPPO",
    "model": "OPPO A31 (Mystery Black, 4GB RAM, 64GB Storage)",
    "stars": "3",
    "aspect": "camera"
  },
  {
    "text": "It has got a decent battery backup, display's amazing (first time using an AMOLED display), the triple camera setup is quite useful and has good color reproduction but it somehow cannot try to get a good shot at night. I mean the pictures are not so bad, but there is definitely some tuning required to make the camera take good shots at night. PROS:--Supports fast charge and has pretty decent charge rates-Has NFC which enables in wireless payments and support for Android Beam (unless Android 10 comes)-Has a good 4000mAh battery, pretty decent for bit of heavy users-Has on-screen fingerprint which is good-Camera setup is goodCONS:--Camera struggles to shoot better pictures at night-The included night mode requires a little bit software upgrade-OneUI which is extremely good, but the icons are kind of kiddish-And mostly-",
    "brand": "OPPO",
    "model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "how could you think , it can compete other brands by low photography where other brands comes with 48MP quad rear camera",
    "brand": "OPPO",
    "model": "OPPO A52 (Stream White, 8GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "Nice camera",
    "brand": "OPPO",
    "model": "OPPO A52 (Stream White, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "1st Buyer  of OPPO F17Awssm back leather and fantastic phone camera is very excellent",
    "brand": "OPPO",
    "model": "Oppo F17 (Classic Silver, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "It's not worth for this amount after Unboxing and using it for a moment I feels like that, because I am using oppo mobiles more than 3 yearsBut this product is okay by weightless,fast charging  but not okay with with cameras,finger print accessibility, battery performances,And processor is snap dragon 662 nothing more specific things .So oppo have to launch little bit better quality product for this amountDynamic orange 🍊,first you realise the colour of orange and this phones colourDon't try to give fake colour or spread fake informationsSo I don't suggest to buy this product to anyone",
    "brand": "OPPO",
    "model": "Oppo F17 (Classic Silver, 6GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "camera"
  },
  {
    "text": "Camera - A+(Specially selfie camera with AI technology, where you will find features like face slim, nose slim, chin slim, 3D , bigger eyes and others.",
    "brand": "OPPO",
    "model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Camera full screen not displaying while taking photo, option is very limited like chinese camera,Sound is good, display picture quality is very poor, screen size is small it is not 6.5 inch comparision with other 6.5 inch phone",
    "brand": "OPPO",
    "model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Camera is 48 megapixel but looking as 5 megapixel and 1080 video is not supported nothing like itFrom Now onwards I will never purchase any producs from Amazon because they deal worthless products...",
    "brand": "OPPO",
    "model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Camera full screen not displaying while taking photo, option is very limited like chinese camera,Sound is good, display picture quality is very poor, screen size is small it is not 6.5 inch comparision with other 6.5 inch phone",
    "brand": "OPPO",
    "model": "OPPO A9 2020 (Space Purple, 4GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Camera is 48 megapixel but looking as 5 megapixel and 1080 video is not supported nothing like itFrom Now onwards I will never purchase any producs from Amazon because they deal worthless products...",
    "brand": "OPPO",
    "model": "OPPO A9 2020 (Space Purple, 4GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "I am not a gamer and focussed on mainly camera & storage and its totally worth it.",
    "brand": "OPPO",
    "model": "OPPO Reno 2Z (Luminous Black, 8GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Best phone ever bought by me, earlier one plus user, first time tried oppo and luckily first impression is damn good, talk of anything and everything is good about the phone, must buy guys, u will forget all phones at thirs range after hdfc discount and exchange of old phone, i had to pay just 20k, happy customer, camera, heaphone, speaker, resolution and finger print is awesome",
    "brand": "OPPO",
    "model": "OPPO Reno 2Z (Luminous Black, 8GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "The video blur option of front and back cam is beast.7. 256 gb storage is too enoughOnly back cam and display is not up to the mark",
    "brand": "OPPO",
    "model": "OPPO Reno 2Z (Luminous Black, 8GB RAM, 256GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Front camera is up to the mark of oppo reno2z4.",
    "brand": "OPPO",
    "model": "OPPO Reno 2Z (Luminous Black, 8GB RAM, 256GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "The phone arrived today. The phone charges really fast. Like I mentioned earlier, the phone arrived today, so I am not sure how the phone will age.",
    "brand": "MI",
    "model": "MI Poco M2 Pro (Green and Greener, 6GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "There is a considerable amount of bloatware - MI apps/junk. There are other good phones in this category that offer very much the same, for instance the Moto One Power, which would definitely have less bloatware. Except for the bloatware!",
    "brand": "MI",
    "model": "MI Poco M2 Pro (Green and Greener, 6GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "The camera is also not bad but it blurs and does applies beautify filters, which I am sure I don't like, have to turn this off, or the pictures look unnatural.",
    "brand": "MI",
    "model": "MI Poco M2 Pro (Green and Greener, 6GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Good build qualitySharp displayPowerful processorSolid battery lifeDecent daylight camera performanceFast ⚡ chargingNo heating issue",
    "brand": "MI",
    "model": "MI Poco M2 Pro (Green and Greener, 6GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Very nice phone camera superbA very good budget smart phoneWith pinch hole camera sight mounted fingers print sensor",
    "brand": "MI",
    "model": "MI Poco M2 Pro (Green and Greener, 6GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Nice camera with with very good quality low light or night photography which still many flagship phones lack.5. Super steady video from rear camera because of presence of both EIS & OIS.9.Bigger battery 4780 mAH as compared to other flagship phones.10. Outdated front camera and supporting rear cameras hardware. (The 20 MP front camera and that too without EIS, 2 MP macro camera, 2 MP depth camera and 13 MP ultrawide camera seems like a joke for a 2020 flagship phone with the price of 50k.)5. Though the low light photography is good but daylight photography is not that exceptional as one might expect from 108 MP camera.8. I think that the phone is slightly overpriced at 50k but if we compare it with it`s biggest competitor the One plus 8 I will always choose MI 10 as so many things are missing in One plus 8 (like wireless charging, LP DDR RAM 4x is present instead of 5, comes with smaller battery 4300mAH and Sony IMX 586 Camera sensor which is quite outdated now) and have a price difference of only 5k. However in comparison with One plus 8 pro I feel that MI 10 is slightly behind because of the MIUI bugs related flaws, FHD+ display and outdated secondary camera hardware (including front camera.",
    "brand": "MI",
    "model": "Mi 10 (Twilight Grey, 8GB RAM, 256GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "(Better experience while watching videos or playing games)4.",
    "brand": "MI",
    "model": "Mi 10 (Twilight Grey, 8GB RAM, 256GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "A cute mobile...super performance and good camera",
    "brand": "MI",
    "model": "Mi 10 (Twilight Grey, 8GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "A cute mobile...super performance and good camera",
    "brand": "MI",
    "model": "Mi 10 (Coral Green, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "A cute mobile...super performance and good camera",
    "brand": "MI",
    "model": "Mi 10 (Twilight Grey, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "A cute mobile...super performance and good camera",
    "brand": "MI",
    "model": "Mi 10 (Coral Green, 8GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "till now mobile is working as expected like fast operating anything and mobile charging coming more than 24 hours once fully charged, the Picture quality is very nice, I will give review again after 6months, Thank you MI and Amazon.",
    "brand": "MI",
    "model": "Mi Redmi 8 Phone (Sapphire Blue, 4GB RAM, 64GB Storage))",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "till now mobile is working as expected like fast operating anything and mobile charging coming more than 24 hours once fully charged, the Picture quality is very nice, I will give review again after 6months, Thank you MI and Amazon.",
    "brand": "MI",
    "model": "Mi Phone Redmi 8 (Emerald Green, 4GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "till now mobile is working as expected like fast operating anything and mobile charging coming more than 24 hours once fully charged, the Picture quality is very nice, I will give review again after 6months, Thank you MI and Amazon.",
    "brand": "MI",
    "model": "Mi Redmi 8 Ruby Red, 4GB RAM, 64GB Storage Smartphone",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "till now mobile is working as expected like fast operating anything and mobile charging coming more than 24 hours once fully charged, the Picture quality is very nice, I will give review again after 6months, Thank you MI and Amazon.",
    "brand": "MI",
    "model": "Mi Redmi 8 Smartphone (Onyx Black, 4GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Don't buy this MI 6 Pro ,Speaker volume is very bad & LowCamera pics are not good at all special back cam having dual cam stabilization problem front cam like VGA picsHeating issueBattrey drained very Fast",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Mobile network signal reception is very weak and says service unavailable.2. Slow charging3. Internet speed too slow5. Display width is too small( Feels like 5\" display)6. 4g signal is weak8.",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Camera is good too.",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Camera is good.",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "3",
    "aspect": "camera"
  },
  {
    "text": "About the phone:Android Version:*Android v8.1 (Oreo) based on MIUIPerformance*Snapdragon 625 battery efficient*Octa Core, 2 GHz processor*4GB RAM enough for daily useDisplay*5.84 inches (14.83 cm)*1080x2280 px, 432 PPI crisp display*IPS LCD beautiful colourCamera*12 MP + 5 MP Dual Primary Cameras*LED Flash*5 MP Front CameraBattery*4000 mAh 1 day+ battery life*Non-Removable*4G Supports Indian bands*VoLTE*64 GB + 256 GB Expandable*Dual SIM: Nano + Nano*Dedicated Micro SD Slot*Fingerprint sensor*USB OTG SupportReview: Camera performance is average.",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Processor SD 625 is aged not the latest (but still good). Battery life is sufficient. Good for average user.",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Camera is average.5.MIUI being 9.6 is very disaapointing and not user friendly.",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Very poor Rear camera quality, photos app Suddenly Hanging full black screen shown, mobile back side heating by online video streaming, Internet connection poor, very slow downloading, etc...,",
    "brand": "MI",
    "model": "Mi Redmi Note 7S (Ruby Red, 32GB, 3GB RAM)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Battery and camera ok in this price",
    "brand": "MI",
    "model": "Mi Redmi Note 7S (Ruby Red, 32GB, 3GB RAM)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "nice product, camera, RAm performance was good so far, delivery also really excited me because delivered product on 4th day, much appreciated.",
    "brand": "MI",
    "model": "Mi Redmi -Note 7S (Onyx Black, 64GB, 4GB RAM)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Camera quality is excellent in this price tag, cant expect more from Xiaomi..",
    "brand": "MI",
    "model": "Mi Redmi -Note 7S (Onyx Black, 64GB, 4GB RAM)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Type C charger helps to charge the phone faster.... Fingerprint reader is worth and working faster.....",
    "brand": "MI",
    "model": "Mi Redmi -Note 7S (Sapphire Blue, 64GB, 4GB RAM)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Its Kind of Bend. It has to rectify while manufacturing itself. I have raised case replacement but the process is like painful. Technician will take 5 to 7 working days to visit you to see the issue, once he sends the report to seller then they will proceed for replacement. The whole process takes 20 days approx or even more it seems. Mean while I booked this via No cost EMI offer, Now that also getting affected like once you raise replacement case, the Initial contact with back will be terminated and  for that bank will charge some money it seems. Even though issue was from seller, customer also need to suffer.",
    "brand": "MI",
    "model": "Redmi Note 5 Pro (Rose Gold, 6GB RAM, 64GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Good phone in this price better  performance redmi 6 double camera fingerprint  charger is so good battery backup is best",
    "brand": "MI",
    "model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "E) Camera clarity is above average and do justice to the megapixel it claims. The portrait mode adds blur and make a good picture if you are in a well lit environment, or else it simply blurs portion of the space around the subject.",
    "brand": "MI",
    "model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Anyway gaming for more than 1.5 hours adds a little heat in time. J) Battery backup is really good and it will last for 1.5 days on moderate to heavy usage. K) Lacks fast charging feature and hence take almost 2 hours to get fully charged.",
    "brand": "MI",
    "model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "However, if you’re into larger phones or photography (Dual Camera & the Portrait Mode), the 8 Plus is a great option. I’m not really into photography so wouldn’t comment about the camera but the iPhone cameras have always been the eye candy for almost everyone.",
    "brand": "Apple",
    "model": "Apple iPhone 8  - Gold",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Camera is superb.",
    "brand": "Apple",
    "model": "Apple iPhone 8  - Gold",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Battery is good, have been using the phone a little over a week, but battery seems promising. With heavy usage of around 6-7 hours in the day I still get 30% remaining by 10 PM.",
    "brand": "Apple",
    "model": "Apple iPhone 8  - Gold",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "ASince I am interested in street photography the camera works pretty good for me.",
    "brand": "Apple",
    "model": "Apple iPhone 8  - Gold",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "The triple cameras on the iPhone 11 Pro Max now give Apple the best camera phone, thanks to its great Night mode and improved Smart HDR,a huge improvement in battery life Up to 20 hours video playback; up to 12 hours video streaming ... With Display of 6.5-inch Super Retina XDR display with HDR,True Tone, Splash, Water, and Dust Resistant, Water-resistant to a depth of 4 meters for up to 30 minutes (IP68)), Triple 12MP cameras (Ultra Wide, Wide, Telephoto) with Portrait mode, Night mode, Auto Adjustments, next-generation Smart HDR and 4K video up to 60 fps with extended dynamic range.",
    "brand": "Apple",
    "model": "Apple iPhone 11 Pro Max  - Space Grey",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "The Ultrawide lens, the improved telephoto lens, night mode, improved portrait options, all give exceptional results. The 11 Pro Max is definitely a phone for amateur & professional photographers.",
    "brand": "Apple",
    "model": "Apple iPhone 11 Pro Max  - Space Grey",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "64 GB is not gonna be enough when storing 4K videos.3. Optical zoom in camera is still 2X, where as Android phones already have 5X zooms. The Camera. 4K video recording support on front camera is an additional bonus.2.",
    "brand": "Apple",
    "model": "Apple iPhone 11 Pro Max  - Space Grey",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "The iPhone design is good and the camera quality is awesome. You can also take pictures in wide angles and the image quality is awesome.",
    "brand": "Apple",
    "model": "Apple iPhone 11  - White",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Phone got delivered at 9am on 28th September (I pre-order it on 27th September at 3am in the morning), I got my phone before the delivery date with nice and secured packaging. I grabbed this phone with HDFC 6K Instant Discount Offer at Just 64K (128 GB Variant).Cons:1. The phone comes with 5W charger which charge your phone slowly. I recommend you to prefer using 18W charger.",
    "brand": "Apple",
    "model": "Apple iPhone 11  - White",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Mobile is heating up within seconds and also camera modes aren’t working properly.",
    "brand": "Apple",
    "model": "Apple iPhone 11  - White",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "In my opinion, don’t  think much about the phone , just get it . Long day Battery Life4. Its an iPhone after all . Display could have been OLED in this price but if doesn’t matter . This retina lcd is really awesome.2. Slightly bulky and weighty - if u r shifting from iPhone 7 or 83. Thick bezelsGuys , I am both Samsung as well as iPhone fan. But this price range I would suggest you to order iPhone 11. And if u r a long time iPhone user .",
    "brand": "Apple",
    "model": "Apple iPhone 11  - White",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "I am attaching night-mode on and off pictures.",
    "brand": "Apple",
    "model": "Apple iPhone 11  - White",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Check the differencePros-1. Best Camera2.",
    "brand": "Apple",
    "model": "Apple iPhone 11  - White",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "The iPhone XS Max combines a big OLED screen, great speakers, great cameras, great battery life, and blazing fast speed into the best user experience on a smartphone. fast and smooth- Siri has been given shortcuts- upgraded cameras are just as good as Samsung cameras now and the front camera is better than the Note 9 front cameraCons:- expensive- slow speed charger- The iPhone is also the ONLY smartphone that can stream all video apps in full screen. Android doesn’t have full screen built into the OS so video apps like HBO, Showtime, Cinemax, STARZ, Encore, and EPIC are all tiny on the Note 9...those apps are all full screen on the iPhone.",
    "brand": "Apple",
    "model": "Apple iPhone Xs Max  - Gold",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "It’s an iPhoneGold colour colour done the job very wellA12 Bionic chip processor is strongBuilt quality is good then iphone xr and iphone 11Camera perfectPeople will love this 2camera design not the iPhone 11 pro max design",
    "brand": "Apple",
    "model": "Apple iPhone Xs Max  - Gold",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "In comparison with my old iPhone6s, I vote for 6s for low light/indoor photography. I identified issue with main camera)Contacted Apple service centre and their response is “that is how iPhone X & iPhone Xs designed”Raised issue to Apple customer care number and shared the sample pics and other required data to analyse. I am not sure why very less people has raised this issue in Xs Camera reviews (started digging more and observed in reviews only after facing the issue)Please note that, iPhone can’t be returned to Amazon without the approval from Apple.",
    "brand": "Apple",
    "model": "Apple iPhone XS  - Space Grey",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Camera : trustworthy , reliable , takes very aggressive HDR shots at times but generally neutral with its performance , you will find yourself editing the pictures a lot and I never complained it as I love doing it and when the base material is so detailed and accurate to begin with that you never lose any significant amount of quality after many editing cycles .Battery :",
    "brand": "Apple",
    "model": "Apple iPhone XS  - Space Grey",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Considering the XR is now priced higher than X. XS is only marginally better, and didn't feel it was worth the extra 30K.- Even after a year of being on the market, this phone is an absolute beast in terms of performance, especially after iOS 12.- The Camera is a beauty.",
    "brand": "Apple",
    "model": "Apple iPhone X  - Space Grey",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "If you record 4K videos, it will eat up your storage really quickly.- Videos get heavily cropped when watching in full screen mode.",
    "brand": "Apple",
    "model": "Apple iPhone X  - Space Grey",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Best picture Nd photo clarityBattery and the phone are great",
    "brand": "Apple",
    "model": "Apple iPhone X  - Space Grey",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Personally, I love the notch as it gives character to the phone. No matter how much you hate the design it seems this is quite an \"IN\" thing now for almost all phone manufacturers have started copying Apple. So all you detractors out there of Apple and the notch - take a chill pill :)!! Pros:1) A11 Bionic Processor is blazing fast and coupled with 3GB ram you will never have any issues with any of the heavy duty tasks you throw at it2) Screen resolution (Super retina HD) and the contrast ratio makes the viewing experience breathtaking3) Got the A1865 model ( iPhone X A1865 uses the Qualcomm MDM9655 Snapdragon X16 LTE modem while the iPhone X A1901 has the Intel XMM 7480 modem) which is better than the A1901 model as A1865 covers more cellular bands (GSM and CDMA networks and frequencies) and the performance of Qualcomm’s chips has always been better than Intel’s. LTE speeds and cellular receptions in case of weak signals also are a shade better than A1901.Cons:1) So recommend having a case around it (preferably a transparent one so that the beauty of the original phone can still be enjoyed!)2) I have to say that battery life is average - a shade better than iPhone 8.3)",
    "brand": "Apple",
    "model": "Apple iPhone X  - Space Grey",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Best phone ever , camera is best , i love iPhone , better than any phone in the world",
    "brand": "Apple",
    "model": "Apple iPhone X  - Space Grey",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "as Rear camera get Freeze due to faulty camera sensor.",
    "brand": "Apple",
    "model": "Apple iPhone 7  - Rose Gold",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Redmi phones cameras are great, of course iPhone is better but is the 6 more Redmi phones that I can get for 1 iPhone justifiable for such a difference in price? Well, absolutely yes.iPhone camera is not just better, it is so much better than comparing them are like comparing a Alto with BMW, yes both have 4 wheels, both have AC, both can run at 100 kmph, but you know the difference. The high price of iPhone is so justified by the sheer brilliance of camera it has. All these phones are superb, no doubt, but once you use the iPhone 7, you know that the difference between these phones and iPhone 6s has got much bigger because of the camera.",
    "brand": "Apple",
    "model": "Apple iPhone 7  - Rose Gold",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "It is not a necessity like the laptop, it is just for calling and taking pics occasionally, and I have my SLR for photography.",
    "brand": "Apple",
    "model": "Apple iPhone 7  - Rose Gold",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Very good specs which can handle updates for next 4 yrs .Good phone for people who don't use power hungry apps for long durations ,camera definitely upto the mark",
    "brand": "Apple",
    "model": "Apple iPhone 7  - Rose Gold",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "The camera is great.",
    "brand": "Apple",
    "model": "Apple iPhone 7  - Rose Gold",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Always wanted to know why the iOS is so popular. I don’t feel the need to upgrade to some other device (iphone 8, x or xs) because it works flawlessly without any lag or delay whatsoever. The only problem is the battery life which isn’t enough for a complete day.",
    "brand": "Apple",
    "model": "Apple iPhone 7  - Rose Gold",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "This is best phon but camera quality is not too good",
    "brand": "Vivo",
    "model": "Vivo Y20 (Obsidian Black, 4GB RAM, 64GB Storage)",
    "stars": "3",
    "aspect": "camera"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 (Black, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Superb phone 👍👌 light weight and have a premium look , camera quality is outstanding and the phone contains to many animations..which makes the phone more interesting ..must buy it guys..profermance is also good , music is loud",
    "brand": "Vivo",
    "model": "Vivo V19 (Piano Black, 8GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Camera Quality and feature mind blowing3. Good for multitasking...5. Display E3 Super Amoled,picture quality very nice stream any video in full HD like Amazon prime video, Netflix6.",
    "brand": "Vivo",
    "model": "Vivo V19 (Piano Black, 8GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Front camera outstanding.",
    "brand": "Vivo",
    "model": "Vivo V19 (Piano Black, 8GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "C. Receivers are not seeing my face in whatsapp app video call, in duo its working fine.",
    "brand": "Vivo",
    "model": "Vivo V19 (Piano Black, 8GB RAM, 256GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Camera I did not test much, but I didn't see any issues.",
    "brand": "Vivo",
    "model": "Vivo V19 (Piano Black, 8GB RAM, 256GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "front camera awesomerear camera good and better in sunlightbattery back awesome with 4500 mahawesome designawesome black with blue graphicsfast charging good4 gb 128 gb still no laggingheadphone good8 out of 10must go for it",
    "brand": "Vivo",
    "model": "Vivo S1 (Skyline Blue, 6GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "📷 camera is not good back camera and not front flash",
    "brand": "Vivo",
    "model": "Vivo S1 (Skyline Blue, 6GB RAM, 64GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "All is goods but only camera quality  is little poor",
    "brand": "Vivo",
    "model": "Vivo S1 (Skyline Blue, 6GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Nice phone camera super super fast",
    "brand": "Vivo",
    "model": "Vivo S1 Pro (Jazzy Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Superb cameraBattery backup awesomeNice perfomance",
    "brand": "Vivo",
    "model": "Vivo S1 Pro (Jazzy Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Got the phone yesterday,functioning is good but I am not able to access the front camera as it's showing another camera is broken can not switch.",
    "brand": "Vivo",
    "model": "Vivo S1 Pro (Jazzy Blue, 8GB RAM, 128GB Storage)",
    "stars": "3",
    "aspect": "camera"
  },
  {
    "text": "Worest mobile ...don't by it friends .I got one month back this mobile .. battery backup 0 only camera good",
    "brand": "Vivo",
    "model": "Vivo S1 Pro (Jazzy Blue, 8GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "665 chipset and 13mp camera in the price of 18000/- trying to make us fool, not more than 8000₹ phone, check the price of vivoz1 pro",
    "brand": "Vivo",
    "model": "Vivo Y50 (Iris Blue, 8GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Very good camera quality, display is a very big and colour is very beautiful",
    "brand": "Vivo",
    "model": "Vivo Y50 (Iris Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Vivo mobile battery life is very good rear camera is very good",
    "brand": "Vivo",
    "model": "Vivo Y91i (Ocean Blue, 2GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "Product is good but rear camera quality is not like 13mp and its size also is not 6''22 inch but overall product is good so only 4 star",
    "brand": "Vivo",
    "model": "Vivo Y91i (Ocean Blue, 2GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "camera"
  },
  {
    "text": "I opted for 6 months EMI considering zero percent interest. But HDFC bank charged me around 12% interest plus GST etc.",
    "brand": "Vivo",
    "model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Poor camera",
    "brand": "Vivo",
    "model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Mobile is a very good battery backup nice camera very good but video picture quality is low",
    "brand": "Vivo",
    "model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)",
    "stars": "3",
    "aspect": "camera"
  },
  {
    "text": "Good camera, wide angle features should have been better. Good front camera n excellent battery backup.",
    "brand": "Vivo",
    "model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Everything is good except Camera, if ur looking for perfect camera then dnt buy this phone, if u are ok and can manage low camera feature then go for it 👌",
    "brand": "Vivo",
    "model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)",
    "stars": "3",
    "aspect": "camera"
  },
  {
    "text": "Phone is good only is looking ,battery backup is not good like 5000 MAH,camera quality is very poor,I think not should purchase .",
    "brand": "Vivo",
    "model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "The camera is also excellent.",
    "brand": "Vivo",
    "model": "Vivo U10",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "I love taking pictures of mine and surrounding too. So great camera quality is one of my main priority, after using it now I must say that it has the best camera available in this budget. With the brand tag line of Vivo “Camera & Music” it really impressed me. ● 5000Ah battery, allows to watch many hours online video● HD+ screen Resolution and balanced colour contrast makes the viewing experience really pleasure and never hurt eyes● Triple camera with AI and image editing options are among the best features for me● Fast charging support with 18 watt inbox adaptor● Snapdragon 665 processor is really a power pack performer even in multitaskingCons:-● Lags in PubG (However in a device with 4 GB it’s expected as the game itself take 2 GB space)●",
    "brand": "Vivo",
    "model": "Vivo U10",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "No headphones included● Front Camera struggles in low light.",
    "brand": "Vivo",
    "model": "Vivo U10",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Nice looking and very nice phone Battery is good and ... camera is good",
    "brand": "Vivo",
    "model": "Vivo U10",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Good phoneBut camera is ok",
    "brand": "Vivo",
    "model": "Vivo U10",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Do'nt go for it i received it today, totally disappointed from camera quality provided by vivo,MI 7s & reamle u1 better than it.if u go for camera quality & display never go for it",
    "brand": "Vivo",
    "model": "Vivo U10",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Camera is ok for this price range.4.",
    "brand": "Vivo",
    "model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Battery life stands three days with moderate gaming of aproximate 1 hr per day (free fire) on low power mode.3. Gaming performace is good when playing freefire in smooth and standard settings.6.",
    "brand": "Vivo",
    "model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "There are lots of feature in this phone like low power mode, ultra power saving mode, game mode, one hand mode, etc... Check YouTube videos for the features.7.",
    "brand": "Vivo",
    "model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "Superb battery backup, till now no hanging issue noticed. No issues with the mobile network & 4G data connectivity, data reception is very good.",
    "brand": "Vivo",
    "model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "camera"
  },
  {
    "text": "665 chipset and 13mp camera in the price of 18000/- trying to make us fool, not more than 8000₹ phone, check the price of vivoz1 pro",
    "brand": "Vivo",
    "model": "Vivo Y50 (Pearl White, 8GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "camera"
  },
  {
    "text": "Very good camera quality, display is a very big and colour is very beautiful",
    "brand": "Vivo",
    "model": "Vivo Y50 (Pearl White, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "camera"
  }
]