["﻿The Project Gutenberg eBook of Winnie-the-Pooh\n    \nThis ebook is for the use of anyone anywhere in the United States and\nmost other parts of the world at no cost and with almost no restrictions\nwhat", "soever. You may copy it, give it away or re-use it under the terms\nof the Project Gutenberg License included with this ebook or online\nat www.gutenberg.org. If you are not located in the United States", ",\nyou will have to check the laws of the country where you are located\nbefore using this eBook.\n\nTitle: Winnie-the-Pooh\n\nAuthor: A. A. Milne\n\nIllustrator: Ernest H. Shepard\n\nRelease date: January 3, 2", "022 [eBook #67098]\n                Most recently updated: December 31, 2024\n\nLanguage: English\n\nOriginal publication: Canada: McClelland & Stewart, Ltd, 1926\n\nCredits: Greg Weeks, Mary Meehan, Iona Va", "ughan, David T. Jones and the online Distributed Proofreaders Canada team at http://www.pgdpcanada.net\n\n\n*** START OF THE PROJECT GUTENBERG EBOOK WINNIE-THE-POOH ***\n\nThe Project Gutenberg eBook of Wi", "nnie-the-Pooh, by A. A. Milne\n\nThis eBook is for the use of anyone anywhere in the United States and\nmost other parts of the world at no cost and with almost no restrictions\nwhatsoever. You may copy i", "t, give it away or re-use it under the terms\nof the Project Gutenberg License included with this eBook or online at\nwww.gutenberg.org. If you are not located in the United States, you\nwill have to che", "ck the laws of the country where you are located before\nusing this eBook.\n\nTitle: Winnie-the-Pooh\n\nAuthor: A. A. Milne\n\nIllustrator: Ernest H. Shepard\n\nRelease Date: January 3, 2022 [eBook #67098]\n[Mo", "st recently updated: October 12, 2022]\n\nLanguage: English\n\nProduced by: Greg Weeks, Mary Meehan, Iona Vaughan, David T. Jones and the\n             online Distributed Proofreaders Canada team at\n      ", "       http://www.pgdpcanada.net\n\n*** START OF THE PROJECT GUTENBERG EBOOK WINNIE-THE-POOH ***\n\n\n\n\n\n                            WINNIE-THE-POOH\n\n                            _BY A. A. MILNE_\n\n\n\n\n      ", "                        _JUVENILES_\n\n                        When We Were Very Young\n\n    \"_The best book of verses for children_ _ever written._\"--A. EDWARD\n    NEWTON in _The Atlantic Monthly_.\n\n   ", "           Fourteen Songs from When We Were Very Young\n\n    Words by A. A. Milne. Music by H. Fraser-Simson. Decorations by\n    E. H. Shepard.\n\n                         The King's Breakfast\n\n    Words", " by A. A. Milne. Music by H. Fraser-Simson. Decorations by\n    E. H. Shepard\n\n\n                               _ESSAYS_\n\n                          Not That It Matters\n                          The Sunn", "y Side\n                          If I May\n\n\n                            _MYSTERY STORY_\n\n                         The Red House Mystery\n\n\n\n\n                            WINNIE-THE-POOH\n                ", "            BY A. A. MILNE\n\n                      McCLELLAND & STEWART, LTD.\n\n                      PUBLISHERS  -  -   TORONTO\n\n\n\n\n                        Copyright, Canada, 1926\n                    B", "y McClelland & Stewart, Limited\n                          Publishers, Toronto\n\n                    First  Printing, October, 1926\n                    Second   \"       July, 1927\n                     T", "hird   \"       December, 1928\n                    Fourth   \"       December, 1929\n                     Fifth   \"       March, 1931\n\n                           Printed in Canada\n\n\n\n\n                   ", "              TO HER\n\n    HAND IN HAND WE COME\n      CHRISTOPHER ROBIN AND I\n    TO LAY THIS BOOK IN YOUR LAP.\n        SAY YOU'RE SURPRISED?\n        SAY YOU LIKE IT?\n        SAY IT'S JUST WHAT YOU WAN", "TED?\n          BECAUSE IT'S YOURS----\n          BECAUSE WE LOVE YOU.\n\n\n\n\n                              INTRODUCTION\n\nIf you happen to have read another book about Christopher Robin, you may\nremember t", "hat he once had a swan (or the swan had Christopher Robin, I\ndon't know which) and that he used to call this swan Pooh. That was a\nlong time ago, and when we said good-bye, we took the name with us, a", "s\nwe didn't think the swan would want it any more. Well, when Edward Bear\nsaid that he would like an exciting name all to himself, Christopher\nRobin said at once, without stopping to think, that he wa", "s\nWinnie-the-Pooh. And he was. So, as I have explained the Pooh part, I\nwill now explain the rest of it.\n\nYou can't be in London for long without going to the Zoo. There are some\npeople who begin the ", "Zoo at the beginning, called WAYIN, and walk as\nquickly as they can past every cage until they get to the one called\nWAYOUT, but the nicest people go straight to the animal they love the\nmost, and sta", "y there. So when Christopher Robin goes to the Zoo, he goes\nto where the Polar Bears are, and he whispers something to the third\nkeeper from the left, and doors are unlocked, and we wander through dar", "k\npassages and up steep stairs, until at last we come to the special cage,\nand the cage is opened, and out trots something brown and furry, and\nwith a happy cry of \"Oh, Bear!\" Christopher Robin rushes", " into its arms.\nNow this bear's name is Winnie, which shows what a good name for bears\nit is, but the funny thing is that we can't remember whether Winnie is\ncalled after Pooh, or Pooh after Winnie. W", "e did know once, but we have\nforgotten....\n\nI had written as far as this when Piglet looked up and said in his\nsqueaky voice, \"What about _Me_?\" \"My dear Piglet,\" I said, \"the whole\nbook is about you.", "\" \"So it is about Pooh,\" he squeaked. You see what it\nis. He is jealous because he thinks Pooh is having a Grand Introduction\nall to himself. Pooh is the favourite, of course, there's no denying it,\nb", "ut Piglet comes in for a good many things which Pooh misses; because\nyou can't take Pooh to school without everybody knowing it, but Piglet\nis so small that he slips into a pocket, where it is very co", "mforting to\nfeel him when you are not quite sure whether twice seven is twelve or\ntwenty-two. Sometimes he slips out and has a good look in the ink-pot,\nand in this way he has got more education than ", "Pooh, but Pooh doesn't\nmind. Some have brains, and some haven't, he says, and there it is.\n\nAnd now all the others are saying, \"What about _Us_?\" So perhaps the\nbest thing to do is to stop writing Int", "roductions and get on with the\nbook.\n\n                                                                A. A. M.\n\n\n\n\n                                CONTENTS\n\n\n        I. IN WHICH WE ARE INTRODUCED TO W", "INNIE-THE-POOH AND SOME\n           BEES, AND THE STORIES BEGIN\n\n       II. IN WHICH POOH GOES VISITING AND GETS INTO A TIGHT PLACE\n\n      III. IN WHICH POOH AND PIGLET GO HUNTING AND NEARLY CATCH A\n  ", "         WOOZLE\n\n       IV. IN WHICH EEYORE LOSES A TAIL AND POOH FINDS ONE\n\n        V. IN WHICH PIGLET MEETS A HEFFALUMP\n\n       VI. IN WHICH EEYORE HAS A BIRTHDAY AND GETS TWO PRESENTS\n\n      VII. I", "N WHICH KANGA AND BABY ROO COME TO THE FOREST, AND\n           PIGLET HAS A BATH\n\n     VIII. IN WHICH CHRISTOPHER ROBIN LEADS AN EXPOTITION TO THE\n           NORTH POLE\n\n       IX. IN WHICH PIGLET IS E", "NTIRELY SURROUNDED BY WATER\n\n        X. IN WHICH CHRISTOPHER ROBIN GIVES A POOH PARTY, AND WE SAY\n           GOOD-BYE\n\n\n\n\n                            WINNIE-THE-POOH\n\n\n\n\n                              ", " CHAPTER I\n\n                      IN WHICH WE ARE INTRODUCED TO\n                     WINNIE-THE-POOH AND SOME BEES,\n                          AND THE STORIES BEGIN\n\n\nHere is Edward Bear, coming downst", "airs now, bump, bump, bump, on the\nback of his head, behind Christopher Robin. It is, as far as he knows,\nthe only way of coming downstairs, but sometimes he feels that there\nreally is another way, if", " only he could stop bumping for a moment and\nthink of it. And then he feels that perhaps there isn't. Anyhow, here he\nis at the bottom, and ready to be introduced to you. Winnie-the-Pooh.\n\nWhen I firs", "t heard his name, I said, just as you are going to say, \"But\nI thought he was a boy?\"\n\n\"So did I,\" said Christopher Robin.\n\n\"Then you can't call him Winnie?\"\n\n\"I don't.\"\n\n\"But you said----\"\n\n\"He's Win", "nie-ther-Pooh. Don't you know what '_ther_' means?\"\n\n\"Ah, yes, now I do,\" I said quickly; and I hope you do too, because it\nis all the explanation you are going to get.\n\nSometimes Winnie-the-Pooh like", "s a game of some sort when he comes\ndownstairs, and sometimes he likes to sit quietly in front of the fire\nand listen to a story. This evening----\n\n\"What about a story?\" said Christopher Robin.\n\n\"_Wha", "t_ about a story?\" I said.\n\n\"Could you very sweetly tell Winnie-the-Pooh one?\"\n\n\"I suppose I could,\" I said. \"What sort of stories does he like?\"\n\n\"About himself. Because he's _that_ sort of Bear.\"\n\n\"", "Oh, I see.\"\n\n\"So could you very sweetly?\"\n\n\"I'll try,\" I said.\n\nSo I tried.\n\n                 *        *        *        *        *\n\nOnce upon a time, a very long time ago now, about last Friday,\nWinn", "ie-the-Pooh lived in a forest all by himself under the name of\nSanders.\n\n(_\"What does 'under the name' mean?\" asked Christopher Robin._\n\n\"_It means he had the name over the door in gold letters, and l", "ived\nunder it._\"\n\n_\"Winnie-the-Pooh wasn't quite sure,\" said Christopher Robin._\n\n_\"Now I am,\" said a growly voice._\n\n_\"Then I will go on,\" said I._)\n\nOne day when he was out walking, he came to an op", "en place in the middle\nof the forest, and in the middle of this place was a large oak-tree,\nand, from the top of the tree, there came a loud buzzing-noise.\n\nWinnie-the-Pooh sat down at the foot of the", " tree, put his head between\nhis paws and began to think.\n\nFirst of all he said to himself: \"That buzzing-noise means something.\nYou don't get a buzzing-noise like that, just buzzing and buzzing,\nwitho", "ut its meaning something. If there's a buzzing-noise, somebody's\nmaking a buzzing-noise, and the only reason for making a buzzing-noise\nthat _I_ know of is because you're a bee.\"\n\nThen he thought anot", "her long time, and said: \"And the only reason for\nbeing a bee that I know of is making honey.\"\n\nAnd then he got up, and said: \"And the only reason for making honey is\nso as _I_ can eat it.\" So he bega", "n to climb the tree.\n\nHe climbed and he climbed and he climbed, and as he climbed he sang a\nlittle song to himself. It went like this:\n\n    Isn't it funny\n    How a bear likes honey?\n    Buzz! Buzz! B", "uzz!\n    I wonder why he does?\n\nThen he climbed a little further ... and a little further ... and\nthen just a little further. By that time he had thought of another song.\n\n    It's a very funny though", "t that, if Bears were Bees,\n    They'd build their nests at the _bottom_ of trees.\n    And that being so (if the Bees were Bears),\n    We shouldn't have to climb up all these stairs.\n\nHe was getting r", "ather tired by this time, so that is why he sang a\nComplaining Song. He was nearly there now, and if he just stood on that\nbranch ...\n\n_Crack!_\n\n\"Oh, help!\" said Pooh, as he dropped ten feet on the br", "anch below him.\n\n\"If only I hadn't----\" he said, as he bounced twenty feet on to the next\nbranch.\n\n\"You see, what I _meant_ to do,\" he explained, as he turned\nhead-over-heels, and crashed on to anothe", "r branch thirty feet below,\n\"what I _meant_ to do----\"\n\n\"Of course, it _was_ rather----\" he admitted, as he slithered very\nquickly through the next six branches.\n\n\"It all comes, I suppose,\" he decided", ", as he said good-bye to the last\nbranch, spun round three times, and flew gracefully into a gorse-bush,\n\"it all comes of _liking_ honey so much. Oh, help!\"\n\nHe crawled out of the gorse-bush, brushed ", "the prickles from his nose,\nand began to think again. And the first person he thought of was\nChristopher Robin.\n\n(_\"Was that me?\" said Christopher Robin in an awed voice, hardly daring\nto believe it._", "\n\n\"_That was you._\"\n\n_Christopher Robin said nothing, but his eyes got larger and larger, and\nhis face got pinker and pinker._)\n\nSo Winnie-the-Pooh went round to his friend Christopher Robin, who live", "d\nbehind a green door in another part of the forest.\n\n\"Good morning, Christopher Robin,\" he said.\n\n\"Good morning, Winnie-_ther_-Pooh,\" said you.\n\n\"I wonder if you've got such a thing as a balloon abou", "t you?\"\n\n\"A balloon?\"\n\n\"Yes, I just said to myself coming along: 'I wonder if Christopher Robin\nhas such a thing as a balloon about him?' I just said it to myself,\nthinking of balloons, and wondering.", "\"\n\n\"What do you want a balloon for?\" you said.\n\nWinnie-the-Pooh looked round to see that nobody was listening, put his\npaw to his mouth, and said in a deep whisper: \"_Honey!_\"\n\n\"But you don't get hone", "y with balloons!\"\n\n\"_I_ do,\" said Pooh.\n\nWell, it just happened that you had been to a party the day before at\nthe house of your friend Piglet, and you had balloons at the party. You\nhad had a big gre", "en balloon; and one of Rabbit's relations had had a big\nblue one, and had left it behind, being really too young to go to a\nparty at all; and so you had brought the green one _and_ the blue one\nhome w", "ith you.\n\n\"Which one would you like?\" you asked Pooh.\n\nHe put his head between his paws and thought very carefully.\n\n\"It's like this,\" he said. \"When you go after honey with a balloon, the\ngreat thing", " is not to let the bees know you're coming. Now, if you have\na green balloon, they might think you were only part of the tree, and\nnot notice you, and, if you have a blue balloon, they might think you", "\nwere only part of the sky, and not notice you, and the question is:\nWhich is most likely?\"\n\n\"Wouldn't they notice _you_ underneath the balloon?\" you asked.\n\n\"They might or they might not,\" said Winni", "e-the-Pooh. \"You never can\ntell with bees.\" He thought for a moment and said: \"I shall try to look\nlike a small black cloud. That will deceive them.\"\n\n\"Then you had better have the blue balloon,\" you ", "said; and so it was\ndecided.\n\nWell, you both went out with the blue balloon, and you took your gun\nwith you, just in case, as you always did, and Winnie-the-Pooh went to a\nvery muddy place that he kne", "w of, and rolled and rolled until he was\nblack all over; and then, when the balloon was blown up as big as big,\nand you and Pooh were both holding on to the string, you let go\nsuddenly, and Pooh Bear ", "floated gracefully up into the sky, and stayed\nthere--level with the top of the tree and about twenty feet away from\nit.\n\n\"Hooray!\" you shouted.\n\n\"Isn't that fine?\" shouted Winnie-the-Pooh down to you", ". \"What do I look\nlike?\"\n\n\"You look like a Bear holding on to a balloon,\" you said.\n\n\"Not,\" said Pooh anxiously, \"--not like a small black cloud in a blue\nsky?\"\n\n\"Not very much.\"\n\n\"Ah, well, perhaps f", "rom up here it looks different. And, as I say, you\nnever can tell with bees.\"\n\nThere was no wind to blow him nearer to the tree, so there he stayed. He\ncould see the honey, he could smell the honey, b", "ut he couldn't quite\nreach the honey.\n\nAfter a little while he called down to you.\n\n\"Christopher Robin!\" he said in a loud whisper.\n\n\"Hallo!\"\n\n\"I think the bees _suspect_ something!\"\n\n\"What sort of th", "ing?\"\n\n\"I don't know. But something tells me that they're _suspicious_!\"\n\n\"Perhaps they think that you're after their honey.\"\n\n\"It may be that. You never can tell with bees.\"\n\nThere was another little", " silence, and then he called down to you again.\n\n\"Christopher Robin!\"\n\n\"Yes?\"\n\n\"Have you an umbrella in your house?\"\n\n\"I think so.\"\n\n\"I wish you would bring it out here, and walk up and down with it, ", "and\nlook up at me every now and then, and say 'Tut-tut, it looks like rain.'\nI think, if you did that, it would help the deception which we are\npractising on these bees.\"\n\nWell, you laughed to yoursel", "f, \"Silly old Bear!\" but you didn't say it\naloud because you were so fond of him, and you went home for your\numbrella.\n\n\"Oh, there you are!\" called down Winnie-the-Pooh, as soon as you got\nback to the", " tree. \"I was beginning to get anxious. I have discovered\nthat the bees are now definitely Suspicious.\"\n\n\"Shall I put my umbrella up?\" you said.\n\n\"Yes, but wait a moment. We must be practical. The imp", "ortant bee to\ndeceive is the Queen Bee. Can you see which is the Queen Bee from down\nthere?\"\n\n\"No.\"\n\n\"A pity. Well, now, if you walk up and down with your umbrella, saying,\n'Tut-tut, it looks like rai", "n,' I shall do what I can by singing a little\nCloud Song, such as a cloud might sing.... Go!\"\n\nSo, while you walked up and down and wondered if it would rain,\nWinnie-the-Pooh sang this song:\n\n    How ", "sweet to be a Cloud\n      Floating in the Blue!\n    Every little cloud\n    _Always_ sings aloud.\n\n    \"How sweet to be a Cloud\n      Floating in the Blue!\"\n    It makes him very proud\n    To be a litt", "le cloud.\n\nThe bees were still buzzing as suspiciously as ever. Some of them,\nindeed, left their nests and flew all round the cloud as it began the\nsecond verse of this song, and one bee sat down on t", "he nose of the cloud\nfor a moment, and then got up again.\n\n\"Christopher--_ow!_--Robin,\" called out the cloud.\n\n\"Yes?\"\n\n\"I have just been thinking, and I have come to a very important\ndecision. _These ", "are the wrong sort of bees._\"\n\n\"Are they?\"\n\n\"Quite the wrong sort. So I should think they would make the wrong sort\nof honey, shouldn't you?\"\n\n\"Would they?\"\n\n\"Yes. So I think I shall come down.\"\n\n\"How", "?\" asked you.\n\nWinnie-the-Pooh hadn't thought about this. If he let go of the string,\nhe would fall--_bump_--and he didn't like the idea of that. So he\nthought for a long time, and then he said:\n\n\"Chr", "istopher Robin, you must shoot the balloon with your gun. Have you\ngot your gun?\"\n\n\"Of course I have,\" you said. \"But if I do that, it will spoil the\nballoon,\" you said.\n\n\"But if you _don't_,\" said Po", "oh, \"I shall have to let go, and that would\nspoil _me_.\"\n\nWhen he put it like this, you saw how it was, and you aimed very\ncarefully at the balloon, and fired.\n\n\"_Ow!_\" said Pooh.\n\n\"Did I miss?\" you a", "sked.\n\n\"You didn't exactly _miss_,\" said Pooh, \"but you missed the _balloon_.\"\n\n\"I'm so sorry,\" you said, and you fired again, and this time you hit the\nballoon, and the air came slowly out, and Winni", "e-the-Pooh floated down\nto the ground.\n\nBut his arms were so stiff from holding on to the string of the balloon\nall that time that they stayed up straight in the air for more than a\nweek, and whenever", " a fly came and settled on his nose he had to blow it\noff. And I think--but I am not sure--that _that_ is why he was always\ncalled Pooh.\n\n                 *        *        *        *        *\n\n\"Is th", "at the end of the story?\" asked Christopher Robin.\n\n\"That's the end of that one. There are others.\"\n\n\"About Pooh and Me?\"\n\n\"And Piglet and Rabbit and all of you. Don't you remember?\"\n\n\"I do remember, ", "and then when I try to remember, I forget.\"\n\n\"That day when Pooh and Piglet tried to catch the Heffalump----\"\n\n\"They didn't catch it, did they?\"\n\n\"No.\"\n\n\"Pooh couldn't, because he hasn't any brain. Di", "d _I_ catch it?\"\n\n\"Well, that comes into the story.\"\n\nChristopher Robin nodded.\n\n\"I do remember,\" he said, \"only Pooh doesn't very well, so that's why he\nlikes having it told to him again. Because the", "n it's a real story and\nnot just a remembering.\"\n\n\"That's just how _I_ feel,\" I said.\n\nChristopher Robin gave a deep sigh, picked his Bear up by the leg, and\nwalked off to the door, trailing Pooh behi", "nd him. At the door he turned\nand said, \"Coming to see me have my bath?\"\n\n\"I might,\" I said.\n\n\"I didn't hurt him when I shot him, did I?\"\n\n\"Not a bit.\"\n\nHe nodded and went out, and in a moment I heard", " Winnie-the-Pooh--_bump,\nbump, bump_--going up the stairs behind him.\n\n\n\n\n                               CHAPTER II\n\n                     IN WHICH POOH GOES VISITING AND\n                         GETS ", "INTO A TIGHT PLACE\n\n\nEdward Bear, known to his friends as Winnie-the-Pooh, or Pooh for\nshort, was walking through the forest one day, humming proudly to\nhimself. He had made up a little hum that very ", "morning, as he was doing\nhis Stoutness Exercises in front of the glass: _Tra-la-la, tra-la-la_,\nas he stretched up as high as he could go, and then _Tra-la-la,\ntra-la--oh, help!--la_, as he tried to r", "each his toes. After breakfast\nhe had said it over and over to himself until he had learnt it off by\nheart, and now he was humming it right through, properly. It went like\nthis:\n\n      _Tra-la-la, tra", "-la-la,_\n      _Tra-la-la, tra-la-la,_\n    _Rum-tum-tiddle-um-tum._\n      _Tiddle-iddle, tiddle-iddle,_\n      _Tiddle-iddle, tiddle-iddle,_\n    _Rum-tum-tum-tiddle-um._\n\nWell, he was humming this hum ", "to himself, and walking along gaily,\nwondering what everybody else was doing, and what it felt like, being\nsomebody else, when suddenly he came to a sandy bank, and in the bank\nwas a large hole.\n\n\"Aha", "!\" said Pooh. (_Rum-tum-tiddle-um-tum._) \"If I know anything about\nanything, that hole means Rabbit,\" he said, \"and Rabbit means Company,\"\nhe said, \"and Company means Food and Listening-to-Me-Humming ", "and such\nlike. _Rum-tum-tum-tiddle-um._\"\n\nSo he bent down, put his head into the hole, and called out:\n\n\"Is anybody at home?\"\n\nThere was a sudden scuffling noise from inside the hole, and then\nsilence", ".\n\n\"What I said was, 'Is anybody at home?'\" called out Pooh very loudly.\n\n\"No!\" said a voice; and then added, \"You needn't shout so loud. I heard\nyou quite well the first time.\"\n\n\"Bother!\" said Pooh. ", "\"Isn't there anybody here at all?\"\n\n\"Nobody.\"\n\nWinnie-the-Pooh took his head out of the hole, and thought for a little,\nand he thought to himself, \"There must be somebody there, because\nsomebody must ", "have _said_ 'Nobody.'\" So he put his head back in the\nhole, and said:\n\n\"Hallo, Rabbit, isn't that you?\"\n\n\"No,\" said Rabbit, in a different sort of voice this time.\n\n\"But isn't that Rabbit's voice?\"\n\n\"", "I don't _think_ so,\" said Rabbit. \"It isn't _meant_ to be.\"\n\n\"Oh!\" said Pooh.\n\nHe took his head out of the hole, and had another think, and then he put\nit back, and said:\n\n\"Well, could you very kindly", " tell me where Rabbit is?\"\n\n\"He has gone to see his friend Pooh Bear, who is a great friend of his.\"\n\n\"But this _is_ Me!\" said Bear, very much surprised.\n\n\"What sort of Me?\"\n\n\"Pooh Bear.\"\n\n\"Are you su", "re?\" said Rabbit, still more surprised.\n\n\"Quite, quite sure,\" said Pooh.\n\n\"Oh, well, then, come in.\"\n\nSo Pooh pushed and pushed and pushed his way through the hole, and at\nlast he got in.\n\n\"You were q", "uite right,\" said Rabbit, looking at him all over. \"It _is_\nyou. Glad to see you.\"\n\n\"Who did you think it was?\"\n\n\"Well, I wasn't sure. You know how it is in the Forest. One can't have\n_anybody_ coming", " into one's house. One has to be _careful_. What about a\nmouthful of something?\"\n\nPooh always liked a little something at eleven o'clock in the morning,\nand he was very glad to see Rabbit getting out ", "the plates and mugs; and\nwhen Rabbit said, \"Honey or condensed milk with your bread?\" he was so\nexcited that he said, \"Both,\" and then, so as not to seem greedy, he\nadded, \"But don't bother about the ", "bread, please.\" And for a long time\nafter that he said nothing ... until at last, humming to himself in a\nrather sticky voice, he got up, shook Rabbit lovingly by the paw, and\nsaid that he must be goi", "ng on.\n\n\"Must you?\" said Rabbit politely.\n\n\"Well,\" said Pooh, \"I could stay a little longer if it--if you----\" and\nhe tried very hard to look in the direction of the larder.\n\n\"As a matter of fact,\" sa", "id Rabbit, \"I was going out myself directly.\"\n\n\"Oh, well, then, I'll be going on. Good-bye.\"\n\n\"Well, good-bye, if you're sure you won't have any more.\"\n\n\"_Is_ there any more?\" asked Pooh quickly.\n\nRab", "bit took the covers off the dishes, and said, \"No, there wasn't.\"\n\n\"I thought not,\" said Pooh, nodding to himself. \"Well, good-bye. I must\nbe going on.\"\n\nSo he started to climb out of the hole. He pul", "led with his front paws,\nand pushed with his back paws, and in a little while his nose was out in\nthe open again ... and then his ears ... and then his front paws ...\nand then his shoulders ... and th", "en----\n\n\"Oh, help!\" said Pooh. \"I'd better go back.\"\n\n\"Oh, bother!\" said Pooh. \"I shall have to go on.\"\n\n\"I can't do either!\" said Pooh. \"Oh, help _and_ bother!\"\n\nNow by this time Rabbit wanted to go ", "for a walk too, and finding the\nfront door full, he went out by the back door, and came round to Pooh,\nand looked at him.\n\n\"Hallo, are you stuck?\" he asked.\n\n\"N-no,\" said Pooh carelessly. \"Just restin", "g and thinking and humming to\nmyself.\"\n\n\"Here, give us a paw.\"\n\nPooh Bear stretched out a paw, and Rabbit pulled and pulled and\npulled....\n\n\"_Ow!_\" cried Pooh. \"You're hurting!\"\n\n\"The fact is,\" said R", "abbit, \"you're stuck.\"\n\n\"It all comes,\" said Pooh crossly, \"of not having front doors big\nenough.\"\n\n\"It all comes,\" said Rabbit sternly, \"of eating too much. I thought at\nthe time,\" said Rabbit, \"only", " I didn't like to say anything,\" said\nRabbit, \"that one of us was eating too much,\" said Rabbit, \"and I knew\nif wasn't _me_,\" he said. \"Well, well, I shall go and fetch Christopher\nRobin.\"\n\nChristophe", "r Robin lived at the other end of the Forest, and when he came\nback with Rabbit, and saw the front half of Pooh, he said, \"Silly old\nBear,\" in such a loving voice that everybody felt quite hopeful aga", "in.\n\n\"I was just beginning to think,\" said Bear, sniffing slightly, \"that\nRabbit might never be able to use his front door again. And I should\n_hate_ that,\" he said.\n\n\"So should I,\" said Rabbit.\n\n\"Use", " his front door again?\" said Christopher Robin. \"Of course he'll use\nhis front door again.\"\n\n\"Good,\" said Rabbit.\n\n\"If we can't pull you out, Pooh, we might push you back.\"\n\nRabbit scratched his whisk", "ers thoughtfully, and pointed out that, when\nonce Pooh was pushed back, he was back, and of course nobody was more\nglad to see Pooh than _he_ was, still there it was, some lived in trees\nand some live", "d underground, and----\n\n\"You mean I'd _never_ get out?\" said Pooh.\n\n\"I mean,\" said Rabbit, \"that having got _so_ far, it seems a pity to\nwaste it.\"\n\nChristopher Robin nodded.\n\n\"Then there's only one t", "hing to be done,\" he said. \"We shall have to\nwait for you to get thin again.\"\n\n\"How long does getting thin take?\" asked Pooh anxiously.\n\n\"About a week, I should think.\"\n\n\"But I can't stay here for a _", "week_!\"\n\n\"You can _stay_ here all right, silly old Bear. It's getting you out\nwhich is so difficult.\"\n\n\"We'll read to you,\" said Rabbit cheerfully. \"And I hope it won't snow,\"\nhe added. \"And I say, ol", "d fellow, you're taking up a good deal of room\nin my house--_do_ you mind if I use your back legs as a towel-horse?\nBecause, I mean, there they are--doing nothing--and it would be very\nconvenient just", " to hang the towels on them.\"\n\n\"A week!\" said Pooh gloomily. \"_What about meals?_\"\n\n\"I'm afraid no meals,\" said Christopher Robin, \"because of getting thin\nquicker. But we _will_ read to you.\"\n\nBear b", "egan to sigh, and then found he couldn't because he was so tightly\nstuck; and a tear rolled down his eye, as he said:\n\n\"Then would you read a Sustaining Book, such as would help and comfort a\nWedged B", "ear in Great Tightness?\"\n\nSo for a week Christopher Robin read that sort of book at the North end\nof Pooh, and Rabbit hung his washing on the South end ... and in\nbetween Bear felt himself getting sle", "nderer and slenderer. And at the\nend of the week Christopher Robin said, \"_Now!_\"\n\nSo he took hold of Pooh's front paws and Rabbit took hold of Christopher\nRobin, and all Rabbit's friends and relation", "s took hold of Rabbit, and\nthey all pulled together....\n\nAnd for a long time Pooh only said \"_Ow!_\" ...\n\nAnd \"_Oh!_\" ...\n\nAnd then, all of a sudden, he said \"_Pop!_\" just as if a cork were\ncoming out ", "of a bottle.\n\nAnd Christopher Robin and Rabbit and all Rabbit's friends and relations\nwent head-over-heels backwards ... and on the top of them came\nWinnie-the-Pooh--free!\n\nSo, with a nod of thanks to", " his friends, he went on with his walk\nthrough the forest, humming proudly to himself. But, Christopher Robin\nlooked after him lovingly, and said to himself, \"Silly old Bear!\"\n\n\n\n\n                    ", "          CHAPTER III\n\n                   IN WHICH POOH AND PIGLET GO HUNTING\n                        AND NEARLY CATCH A WOOZLE\n\n\nThe Piglet lived in a very grand house in the middle of a beech-tree,\n", "and the beech-tree was in the middle of the forest, and the Piglet lived\nin the middle of the house. Next to his house was a piece of broken\nboard which had: \"TRESPASSERS W\" on it. When Christopher Ro", "bin asked the\nPiglet what it meant, he said it was his grandfather's name, and had\nbeen in the family for a long time, Christopher Robin said you\n_couldn't_ be called Trespassers W, and Piglet said ye", "s, you could,\nbecause his grandfather was, and it was short for Trespassers Will,\nwhich was short for Trespassers William. And his grandfather had had two\nnames in case he lost one--Trespassers after ", "an uncle, and William after\nTrespassers.\n\n\"I've got two names,\" said Christopher Robin carelessly.\n\n\"Well, there you are, that proves it,\" said Piglet.\n\nOne fine winter's day when Piglet was brushing ", "away the snow in front of\nhis house, he happened to look up, and there was Winnie-the-Pooh. Pooh\nwas walking round and round in a circle, thinking of something else, and\nwhen Piglet called to him, he ", "just went on walking.\n\n\"Hallo!\" said Piglet, \"what are _you_ doing?\"\n\n\"Hunting,\" said Pooh.\n\n\"Hunting what?\"\n\n\"Tracking something,\" said Winnie-the-Pooh very mysteriously.\n\n\"Tracking what?\" said Pigle", "t, coming closer.\n\n\"That's just what I ask myself. I ask myself, What?\"\n\n\"What do you think you'll answer?\"\n\n\"I shall have to wait until I catch up with it,\" said Winnie-the-Pooh.\n\"Now, look there.\" H", "e pointed to the ground in front of him. \"What do\nyou see there?\"\n\n\"Tracks,\" said Piglet. \"Paw-marks.\" He gave a little squeak of\nexcitement. \"Oh, Pooh! Do you think it's a--a--a Woozle?\"\n\n\"It may be,", "\" said Pooh. \"Sometimes it is, and sometimes it isn't. You\nnever can tell with paw-marks.\"\n\nWith these few words he went on tracking, and Piglet, after watching him\nfor a minute or two, ran after him.", " Winnie-the-Pooh had come to a sudden\nstop, and was bending over the tracks in a puzzled sort of way.\n\n\"What's the matter?\" asked Piglet.\n\n\"It's a very funny thing,\" said Bear, \"but there seem to be\n_", "two_ animals now. This--whatever-it-was--has been joined by\nanother--whatever-it-is--and the two of them are now proceeding\nin company. Would you mind coming with me, Piglet, in case they\nturn out to ", "be Hostile Animals?\"\n\nPiglet scratched his ear in a nice sort of way, and said that he had\nnothing to do until Friday, and would be delighted to come, in case it\nreally _was_ a Woozle.\n\n\"You mean, in ", "case it really is two Woozles,\" said Winnie-the-Pooh, and\nPiglet said that anyhow he had nothing to do until Friday. So off they\nwent together.\n\nThere was a small spinney of larch trees just here, and", " it seemed as if\nthe two Woozles, if that is what they were, had been going round this\nspinney; so round this spinney went Pooh and Piglet after them; Piglet\npassing the time by telling Pooh what his ", "Grandfather Trespassers W had\ndone to Remove Stiffness after Tracking, and how his Grandfather\nTrespassers W had suffered in his later years from Shortness of Breath,\nand other matters of interest, an", "d Pooh wondering what a Grandfather was\nlike, and if perhaps this was Two Grandfathers they were after now, and,\nif so, whether he would be allowed to take one home and keep it, and\nwhat Christopher R", "obin would say. And still the tracks went on in front\nof them....\n\nSuddenly Winnie-the-Pooh stopped, and pointed excitedly in front of him.\n\"_Look!_\"\n\n\"_What?_\" said Piglet, with a jump. And then, to ", "show that he hadn't\nbeen frightened, he jumped up and down once or twice more in an\nexercising sort of way.\n\n\"The tracks!\" said Pooh. \"_A third animal has joined the other two!_\"\n\n\"Pooh!\" cried Piglet", ". \"Do you think it is another Woozle?\"\n\n\"No,\" said Pooh, \"because it makes different marks. It is either Two\nWoozles and one, as it might be, Wizzle, or Two, as it might be, Wizzles\nand one, if so it ", "is, Woozle. Let us continue to follow them.\"\n\nSo they went on, feeling just a little anxious now, in case the three\nanimals in front of them were of Hostile Intent. And Piglet wished very\nmuch that hi", "s Grandfather T. W. were there, instead of elsewhere, and\nPooh thought how nice it would be if they met Christopher Robin suddenly\nbut quite accidentally, and only because he liked Christopher Robin s", "o\nmuch. And then, all of a sudden, Winnie-the-Pooh stopped again, and\nlicked the tip of his nose in a cooling manner, for he was feeling more\nhot and anxious than ever in his life before. _There were ", "four animals\nin front of them!_\n\n\"Do you see, Piglet? Look at their tracks! Three, as it were, Woozles,\nand one, as it was, Wizzle. _Another Woozle has joined them!_\"\n\nAnd so it seemed to be. There we", "re the tracks; crossing over each other\nhere, getting muddled up with each other there; but, quite plainly every\nnow and then, the tracks of four sets of paws.\n\n\"I _think_,\" said Piglet, when he had l", "icked the tip of his nose too,\nand found that it brought very little comfort, \"I _think_ that I have\njust remembered something. I have just remembered something that I\nforgot to do yesterday and shan'", "t be able to do to-morrow. So I suppose\nI really ought to go back and do it now.\"\n\n\"We'll do it this afternoon, and I'll come with you,\" said Pooh.\n\n\"It isn't the sort of thing you can do in the after", "noon,\" said Piglet\nquickly. \"It's a very particular morning thing, that has to be done in\nthe morning, and, if possible, between the hours of----What would you\nsay the time was?\"\n\n\"About twelve,\" said", " Winnie-the-Pooh, looking at the sun.\n\n\"Between, as I was saying, the hours of twelve and twelve five. So,\nreally, dear old Pooh, if you'll excuse me----_What's that?_\"\n\nPooh looked up at the sky, and", " then, as he heard the whistle again, he\nlooked up into the branches of a big oak-tree, and then he saw a friend\nof his.\n\n\"It's Christopher Robin,\" he said.\n\n\"Ah, then you'll be all right,\" said Pigle", "t. \"You'll be quite safe with\n_him_. Good-bye,\" and he trotted off home as quickly as he could, very\nglad to be Out of All Danger again.\n\nChristopher Robin came slowly down his tree.\n\n\"Silly old Bear,", "\" he said, \"what _were_ you doing? First you went round\nthe spinney twice by yourself, and then Piglet ran after you and you\nwent round again together, and then you were just going round a fourth\ntime", "----\"\n\n\"Wait a moment,\" said Winnie-the-Pooh, holding up his paw.\n\nHe sat down and thought, in the most thoughtful way he could think. Then\nhe fitted his paw into one of the Tracks ... and then he scr", "atched his\nnose twice, and stood up.\n\n\"Yes,\" said Winnie-the-Pooh.\n\n\"I see now,\" said Winnie-the-Pooh.\n\n\"I have been Foolish and Deluded,\" said he, \"and I am a Bear of No Brain\nat All.\"\n\n\"You're the B", "est Bear in All the World,\" said Christopher Robin\nsoothingly.\n\n\"Am I?\" said Pooh hopefully. And then he brightened up suddenly.\n\n\"Anyhow,\" he said, \"it is nearly Luncheon Time.\"\n\nSo he went home for ", "it.\n\n\n\n\n                               CHAPTER IV\n\n                      IN WHICH EEYORE LOSES A TAIL\n                           AND POOH FINDS ONE\n\n\nThe Old Grey Donkey, Eeyore, stood by himself in a", " thistly corner of\nthe forest, his front feet well apart, his head on one side, and thought\nabout things. Sometimes he thought sadly to himself, \"Why?\" and\nsometimes he thought, \"Wherefore?\" and somet", "imes he thought, \"Inasmuch\nas which?\"--and sometimes he didn't quite know what he _was_ thinking\nabout. So when Winnie-the-Pooh came stumping along, Eeyore was very glad\nto be able to stop thinking fo", "r a little, in order to say \"How do you\ndo?\" in a gloomy manner to him.\n\n\"And how are you?\" said Winnie-the-Pooh.\n\nEeyore shook his head from side to side.\n\n\"Not very how,\" he said. \"I don't seem to h", "ave felt at all how for a\nlong time.\"\n\n\"Dear, dear,\" said Pooh, \"I'm sorry about that. Let's have a look at\nyou.\"\n\nSo Eeyore stood there, gazing sadly at the ground, and Winnie-the-Pooh\nwalked all rou", "nd him once.\n\n\"Why, what's happened to your tail?\" he said in surprise.\n\n\"What _has_ happened to it?\" said Eeyore.\n\n\"It isn't there!\"\n\n\"Are you sure?\"\n\n\"Well, either a tail _is_ there or it isn't ther", "e. You can't make a\nmistake about it. And yours _isn't_ there!\"\n\n\"Then what is?\"\n\n\"Nothing.\"\n\n\"Let's have a look,\" said Eeyore, and he turned slowly round to the\nplace where his tail had been a little", " while ago, and then, finding that\nhe couldn't catch it up, he turned round the other way, until he came\nback to where he was at first, and then he put his head down and looked\nbetween his front legs,", " and at last he said, with a long, sad sigh, \"I\nbelieve you're right.\"\n\n\"Of course I'm right,\" said Pooh.\n\n\"That Accounts for a Good Deal,\" said Eeyore gloomily. \"It Explains\nEverything. No Wonder.\"\n\n", "\"You must have left it somewhere,\" said Winnie-the-Pooh.\n\n\"Somebody must have taken it,\" said Eeyore. \"How Like Them,\" he added,\nafter a long silence.\n\nPooh felt that he ought to say something helpful", " about it, but didn't\nquite know what. So he decided to do something helpful instead.\n\n\"Eeyore,\" he said solemnly, \"I, Winnie-the-Pooh, will find your tail for\nyou.\"\n\n\"Thank you, Pooh,\" answered Eeyor", "e. \"You're a real friend,\" said he.\n\"Not like Some,\" he said.\n\nSo Winnie-the-Pooh went off to find Eeyore's tail.\n\nIt was a fine spring morning in the forest as he started out. Little\nsoft clouds play", "ed happily in a blue sky, skipping from time to time in\nfront of the sun as if they had come to put it out, and then sliding\naway suddenly so that the next might have his turn. Through them and\nbetwee", "n them the sun shone bravely; and a copse which had worn its firs\nall the year round seemed old and dowdy now beside the new green lace\nwhich the beeches had put on so prettily. Through copse and spin", "ney\nmarched Bear; down open slopes of gorse and heather, over rocky beds of\nstreams, up steep banks of sandstone into the heather again; and so at\nlast, tired and hungry, to the Hundred Acre Wood. For", " it was in the\nHundred Acre Wood that Owl lived.\n\n\"And if anyone knows anything about anything,\" said Bear to himself,\n\"it's Owl who knows something about something,\" he said, \"or my name's\nnot Winnie", "-the-Pooh,\" he said. \"Which it is,\" he added. \"So there you\nare.\"\n\nOwl lived at The Chestnuts, an old-world residence of great charm, which\nwas grander than anybody else's, or seemed so to Bear, becau", "se it had\nboth a knocker _and_ a bell-pull. Underneath the knocker there was a\nnotice which said:\n\n                   PLES RING IF AN RNSER IS REQIRD.\n\nUnderneath the bell-pull there was a notice whic", "h said:\n\n                  PLEZ CNOKE IF AN RNSR IS NOT REQID.\n\nThese notices had been written by Christopher Robin, who was the only\none in the forest who could spell; for Owl, wise though he was in ", "many\nways, able to read and write and spell his own name WOL, yet somehow\nwent all to pieces over delicate words like MEASLES and BUTTEREDTOAST.\n\nWinnie-the-Pooh read the two notices very carefully, f", "irst from left to\nright, and afterwards, in case he had missed some of it, from right to\nleft. Then, to make quite sure, he knocked and pulled the knocker, and\nhe pulled and knocked the bell-rope, and", " he called out in a very loud\nvoice, \"Owl! I require an answer! It's Bear speaking.\" And the door\nopened, and Owl looked out.\n\n\"Hallo, Pooh,\" he said. \"How's things?\"\n\n\"Terrible and Sad,\" said Pooh, \"", "because Eeyore, who is a friend of mine,\nhas lost his tail. And he's Moping about it. So could you very kindly\ntell me how to find it for him?\"\n\n\"Well,\" said Owl, \"the customary procedure in such case", "s is as follows.\"\n\n\"What does Crustimoney Proseedcake mean?\" said Pooh. \"For I am a Bear of\nVery Little Brain, and long words Bother me.\"\n\n\"It means the Thing to Do.\"\n\n\"As long as it means that, I don", "'t mind,\" said Pooh humbly.\n\n\"The thing to do is as follows. First, Issue a Reward. Then----\"\n\n\"Just a moment,\" said Pooh, holding up his paw. \"_What_ do we do to\nthis--what you were saying? You sneez", "ed just as you were going to tell\nme.\"\n\n\"I _didn't_ sneeze.\"\n\n\"Yes, you did, Owl.\"\n\n\"Excuse me, Pooh, I didn't. You can't sneeze without knowing it.\"\n\n\"Well, you can't know it without something having", " been sneezed.\"\n\n\"What I _said_ was, 'First _Issue_ a Reward'.\"\n\n\"You're doing it again,\" said Pooh sadly.\n\n\"A Reward!\" said Owl very loudly. \"We write a notice to say that we will\ngive a large someth", "ing to anybody who finds Eeyore's tail.\"\n\n\"I see, I see,\" said Pooh, nodding his head. \"Talking about large\nsomethings,\" he went on dreamily, \"I generally have a small something\nabout now--about this ", "time in the morning,\" and he looked wistfully at\nthe cupboard in the corner of Owl's parlour; \"just a mouthful of\ncondensed milk or whatnot, with perhaps a lick of honey----\"\n\n\"Well, then,\" said Owl, ", "\"we write out this notice, and we put it up all\nover the forest.\"\n\n\"A lick of honey,\" murmured Bear to himself, \"or--or not, as the case\nmay be.\" And he gave a deep sigh, and tried very hard to listen", " to what\nOwl was saying.\n\nBut Owl went on and on, using longer and longer words, until at last he\ncame back to where he started, and he explained that the person to write\nout this notice was Christoph", "er Robin.\n\n\"It was he who wrote the ones on my front door for me. Did you see them,\nPooh?\"\n\nFor some time now Pooh had been saying \"Yes\" and \"No\" in turn, with his\neyes shut, to all that Owl was sayin", "g, and having said, \"Yes, yes,\" last\ntime, he said \"No, not at all,\" now, without really knowing what Owl was\ntalking about.\n\n\"Didn't you see them?\" said Owl, a little surprised. \"Come and look at\nthe", "m now.\"\n\nSo they went outside. And Pooh looked at the knocker and the notice\nbelow it, and he looked at the bell-rope and the notice below it, and\nthe more he looked at the bell-rope, the more he felt", " that he had seen\nsomething like it, somewhere else, sometime before.\n\n\"Handsome bell-rope, isn't it?\" said Owl.\n\nPooh nodded.\n\n\"It reminds me of something,\" he said, \"but I can't think what. Where\ndi", "d you get it?\"\n\n\"I just came across it in the Forest. It was hanging over a bush, and I\nthought at first somebody lived there, so I rang it, and nothing\nhappened, and then I rang it again very loudly,", " and it came off in my\nhand, and as nobody seemed to want it, I took it home, and----\"\n\n\"Owl,\" said Pooh solemnly, \"you made a mistake. Somebody did want it.\"\n\n\"Who?\"\n\n\"Eeyore. My dear friend Eeyore. ", "He was--he was fond of it.\"\n\n\"Fond of it?\"\n\n\"Attached to it,\" said Winnie-the-Pooh sadly.\n\n                 *        *        *        *        *\n\nSo with these words he unhooked it, and carried it ba", "ck to Eeyore; and\nwhen Christopher Robin had nailed it on in its right place again, Eeyore\nfrisked about the forest, waving his tail so happily that\nWinnie-the-Pooh came over all funny, and had to hur", "ry home for a little\nsnack of something to sustain him. And, wiping his mouth half an hour\nafterwards, he sang to himself proudly:\n\n    _Who found the Tail?_\n      \"I,\" said Pooh,\n    \"At a quarter to", " two\n      (Only it was quarter to eleven really),\n    _I_ found the Tail!\"\n\n\n\n\n                               CHAPTER V\n\n                    IN WHICH PIGLET MEETS A HEFFALUMP\n\n\nOne day, when Christop", "her Robin and Winnie-the-Pooh and Piglet were\nall talking together, Christopher Robin finished the mouthful he was\neating and said carelessly: \"I saw a Heffalump to-day, Piglet.\"\n\n\"What was it doing?\"", " asked Piglet.\n\n\"Just lumping along,\" said Christopher Robin. \"I don't think it saw\n_me_.\"\n\n\"I saw one once,\" said Piglet. \"At least, I think I did,\" he said. \"Only\nperhaps it wasn't.\"\n\n\"So did I,\" sa", "id Pooh, wondering what a Heffalump was like.\n\n\"You don't often see them,\" said Christopher Robin carelessly.\n\n\"Not now,\" said Piglet.\n\n\"Not at this time of year,\" said Pooh.\n\nThen they all talked abo", "ut something else, until it was time for Pooh\nand Piglet to go home together. At first as they stumped along the path\nwhich edged the Hundred Acre Wood, they didn't say much to each other;\nbut when th", "ey came to the stream and had helped each other across the\nstepping stones, and were able to walk side by side again over the\nheather, they began to talk in a friendly way about this and that, and\nPig", "let said, \"If you see what I mean, Pooh,\" and Pooh said, \"It's just\nwhat I think myself, Piglet,\" and Piglet said, \"But, on the other hand,\nPooh, we must remember,\" and Pooh said, \"Quite true, Piglet,", " although I\nhad forgotten it for the moment.\" And then, just as they came to the Six\nPine Trees, Pooh looked round to see that nobody else was listening, and\nsaid in a very solemn voice:\n\n\"Piglet, I h", "ave decided something.\"\n\n\"What have you decided, Pooh?\"\n\n\"I have decided to catch a Heffalump.\"\n\nPooh nodded his head several times as he said this, and waited for\nPiglet to say \"How?\" or \"Pooh, you c", "ouldn't!\" or something helpful of\nthat sort, but Piglet said nothing. The fact was Piglet was wishing that\n_he_ had thought about it first.\n\n\"I shall do it,\" said Pooh, after waiting a little longer, ", "\"by means of\na trap. And it must be a Cunning Trap, so you will have to help me,\nPiglet.\"\n\n\"Pooh,\" said Piglet, feeling quite happy again now, \"I will.\" And then\nhe said, \"How shall we do it?\" and Poo", "h said, \"That's just it. How?\" And\nthen they sat down together to think it out.\n\nPooh's first idea was that they should dig a Very Deep Pit, and then the\nHeffalump would come along and fall into the P", "it, and----\n\n\"Why?\" said Piglet.\n\n\"Why what?\" said Pooh.\n\n\"Why would he fall in?\"\n\nPooh rubbed his nose with his paw, and said that the Heffalump might be\nwalking along, humming a little song, and loo", "king up at the sky,\nwondering if it would rain, and so he wouldn't see the Very Deep Pit\nuntil he was half-way down, when it would be too late.\n\nPiglet said that this was a very good Trap, but supposi", "ng it were\nraining already?\n\nPooh rubbed his nose again, and said that he hadn't thought of that. And\nthen he brightened up, and said that, if it were raining already, the\nHeffalump would be looking a", "t the sky wondering if it would _clear up_,\nand so he wouldn't see the Very Deep Pit until he was half-way\ndown.... When it would be too late.\n\nPiglet said that, now that this point had been explained", ", he thought it\nwas a Cunning Trap.\n\nPooh was very proud when he heard this, and he felt that the Heffalump\nwas as good as caught already, but there was just one other thing which\nhad to be thought ab", "out, and it was this. _Where should they dig the\nVery Deep Pit?_\n\nPiglet said that the best place would be somewhere where a Heffalump\nwas, just before he fell into it, only about a foot farther on.\n\n", "\"But then he would see us digging it,\" said Pooh.\n\n\"Not if he was looking at the sky.\"\n\n\"He would Suspect,\" said Pooh, \"if he happened to look down.\" He thought\nfor a long time and then added sadly, \"", "It isn't as easy as I thought. I\nsuppose that's why Heffalumps hardly _ever_ get caught.\"\n\n\"That must be it,\" said Piglet.\n\nThey sighed and got up; and when they had taken a few gorse prickles out\nof ", "themselves they sat down again; and all the time Pooh was saying to\nhimself, \"If only I could _think_ of something!\" For he felt sure that a\nVery Clever Brain could catch a Heffalump if only he knew t", "he right way\nto go about it.\n\n\"Suppose,\" he said to Piglet, \"_you_ wanted to catch _me_, how would you\ndo it?\"\n\n\"Well,\" said Piglet, \"I should do it like this. I should make a Trap,\nand I should put a", " Jar of Honey in the Trap, and you would smell it, and\nyou would go in after it, and----\"\n\n\"And I would go in after it,\" said Pooh excitedly, \"only very carefully\nso as not to hurt myself, and I would", " get to the Jar of Honey, and I\nshould lick round the edges first of all, pretending that there wasn't\nany more, you know, and then I should walk away and think about it a\nlittle, and then I should co", "me back and start licking in the middle of\nthe jar, and then----\"\n\n\"Yes, well never mind about that. There you would be, and there I should\ncatch you. Now the first thing to think of is, What do Heffa", "lumps like?\nI should think acorns, shouldn't you? We'll get a lot of----I say, wake\nup, Pooh!\"\n\nPooh, who had gone into a happy dream, woke up with a start, and said\nthat Honey was a much more trappy ", "thing than Haycorns. Piglet didn't\nthink so; and they were just going to argue about it, when Piglet\nremembered that, if they put acorns in the Trap, _he_ would have to find\nthe acorns, but if they pu", "t honey, then Pooh would have to give up some\nof his own honey, so he said, \"All right, honey then,\" just as Pooh\nremembered it too, and was going to say, \"All right, haycorns.\"\n\n\"Honey,\" said Piglet ", "to himself in a thoughtful way, as if it were now\nsettled. \"_I'll_ dig the pit, while _you_ go and get the honey.\"\n\n\"Very well,\" said Pooh, and he stumped off.\n\nAs soon as he got home, he went to the ", "larder; and he stood on a chair,\nand took down a very large jar of honey from the top shelf. It had HUNNY\nwritten on it, but, just to make sure, he took off the paper cover and\nlooked at it, and it _l", "ooked_ just like honey. \"But you never can tell,\"\nsaid Pooh. \"I remember my uncle saying once that he had seen cheese just\nthis colour.\" So he put his tongue in, and took a large lick. \"Yes,\" he\nsaid,", " \"it is. No doubt about that. And honey, I should say, right down\nto the bottom of the jar. Unless, of course,\" he said, \"somebody put\ncheese in at the bottom just for a joke. Perhaps I had better go ", "a\n_little_ further ... just in case ... in case Heffalumps _don't_\nlike cheese ... same as me.... Ah!\" And he gave a deep sigh. \"I\n_was_ right. It _is_ honey, right the way down.\"\n\nHaving made certain", " of this, he took the jar back to Piglet, and Piglet\nlooked up from the bottom of his Very Deep Pit, and said, \"Got it?\" and\nPooh said, \"Yes, but it isn't quite a full jar,\" and he threw it down to\nPi", "glet, and Piglet said, \"No, it isn't! Is that all you've got left?\"\nand Pooh said \"Yes.\" Because it was. So Piglet put the jar at the bottom\nof the Pit, and climbed out, and they went off home togethe", "r.\n\n\"Well, good night, Pooh,\" said Piglet, when they had got to Pooh's\nhouse. \"And we meet at six o'clock to-morrow morning by the Pine Trees,\nand see how many Heffalumps we've got in our Trap.\"\n\n\"Six", " o'clock, Piglet. And have you got any string?\"\n\n\"No. Why do you want string?\"\n\n\"To lead them home with.\"\n\n\"Oh! ... I _think_ Heffalumps come if you whistle.\"\n\n\"Some do and some don't. You never can t", "ell with Heffalumps. Well, good\nnight!\"\n\n\"Good night!\"\n\nAnd off Piglet trotted to his house TRESPASSERS W, while Pooh made his\npreparations for bed.\n\nSome hours later, just as the night was beginning ", "to steal away, Pooh\nwoke up suddenly with a sinking feeling. He had had that sinking feeling\nbefore, and he knew what it meant. _He was hungry._ So he went to the\nlarder, and he stood on a chair and r", "eached up to the top shelf, and\nfound--nothing.\n\n\"That's funny,\" he thought. \"I know I had a jar of honey there. A full\njar, full of honey right up to the top, and it had HUNNY written on it,\nso that ", "I should know it was honey. That's very funny.\" And then he\nbegan to wander up and down, wondering where it was and murmuring a\nmurmur to himself. Like this:\n\n    It's very, very funny,\n    'Cos I _kn", "ow_ I had some honey;\n    'Cos it had a label on,\n            Saying HUNNY.\n    A goloptious full-up pot too,\n    And I don't know where it's got to,\n    No, I don't know where it's gone--\n           ", " Well, it's funny.\n\nHe had murmured this to himself three times in a singing sort of way,\nwhen suddenly he remembered. He had put it into the Cunning Trap to\ncatch the Heffalump.\n\n\"Bother!\" said Pooh.", " \"It all comes of trying to be kind to Heffalumps.\"\nAnd he got back into bed.\n\nBut he couldn't sleep. The more he tried to sleep, the more he couldn't.\nHe tried Counting Sheep, which is sometimes a go", "od way of getting to\nsleep, and, as that was no good, he tried counting Heffalumps. And that\nwas worse. Because every Heffalump that he counted was making straight\nfor a pot of Pooh's honey, _and eati", "ng it all_. For some minutes he lay\nthere miserably, but when the five hundred and eighty-seventh Heffalump\nwas licking its jaws, and saying to itself, \"Very good honey this, I\ndon't know when I've ta", "sted better,\" Pooh could bear it no longer. He\njumped out of bed, he ran out of the house, and he ran straight to the\nSix Pine Trees.\n\nThe Sun was still in bed, but there was a lightness in the sky ov", "er the\nHundred Acre Wood which seemed to show that it was waking up and would\nsoon be kicking off the clothes. In the half-light the Pine Trees looked\ncold and lonely, and the Very Deep Pit seemed dee", "per than it was, and\nPooh's jar of honey at the bottom was something mysterious, a shape and\nno more. But as he got nearer to it his nose told him that it was indeed\nhoney, and his tongue came out and", " began to polish up his mouth, ready\nfor it.\n\n\"Bother!\" said Pooh, as he got his nose inside the jar. \"A Heffalump has\nbeen eating it!\" And then he thought a little and said, \"Oh, no, _I_\ndid. I forgo", "t.\"\n\nIndeed, he had eaten most of it. But there was a little left at the very\nbottom of the jar, and he pushed his head right in, and began to\nlick....\n\nBy and by Piglet woke up. As soon as he woke he", " said to himself, \"Oh!\"\nThen he said bravely, \"Yes,\" and then, still more bravely, \"Quite so.\"\nBut he didn't feel very brave, for the word which was really jiggeting\nabout in his brain was \"Heffalumps", ".\"\n\nWhat was a Heffalump like?\n\nWas it Fierce?\n\n_Did_ it come when you whistled? And _how_ did it come?\n\nWas it Fond of Pigs at all?\n\nIf it was Fond of Pigs, did it make any difference _what sort of P", "ig_?\n\nSupposing it was Fierce with Pigs, would it make any difference _if the\nPig had a grandfather called TRESPASSERS WILLIAM_?\n\nHe didn't know the answer to any of these questions ... and he was\ngoi", "ng to see his first Heffalump in about an hour from now!\n\nOf course Pooh would be with him, and it was much more Friendly with\ntwo. But suppose Heffalumps were Very Fierce with Pigs _and_ Bears?\nWould", "n't it be better to pretend that he had a headache, and couldn't go\nup to the Six Pine Trees this morning? But then suppose that it was a\nvery fine day, and there was no Heffalump in the trap, here he", " would be,\nin bed all the morning, simply wasting his time for nothing. What should\nhe do?\n\nAnd then he had a Clever Idea. He would go up very quietly to the Six\nPine Trees now, peep very cautiously i", "nto the Trap, and see if there\n_was_ a Heffalump there. And if there was, he would go back to bed, and\nif there wasn't, he wouldn't.\n\nSo off he went. At first he thought that there wouldn't be a Heffa", "lump\nin the Trap, and then he thought that there would, and as he got nearer\nhe was _sure_ that there would, because he could hear it heffalumping\nabout it like anything.\n\n\"Oh, dear, oh, dear, oh, dea", "r!\" said Piglet to himself. And he wanted to\nrun away. But somehow, having got so near, he felt that he must just see\nwhat a Heffalump was like. So he crept to the side of the Trap and\nlooked in....\n\n", "And all the time Winnie-the-Pooh had been trying to get the honey-jar\noff his head. The more he shook it, the more tightly it stuck.\n\n\"_Bother!_\" he said, inside the jar, and \"_Oh, help!_\" and, mostly", ",\n\"_Ow!_\" And he tried bumping it against things, but as he couldn't see\nwhat he was bumping it against, it didn't help him; and he tried to\nclimb out of the Trap, but as he could see nothing but jar,", " and not much\nof that, he couldn't find his way. So at last he lifted up his head, jar\nand all, and made a loud, roaring noise of Sadness and Despair ... and\nit was at that moment that Piglet looked d", "own.\n\n\"Help, help!\" cried Piglet, \"a Heffalump, a Horrible Heffalump!\" and he\nscampered off as hard as he could, still crying out, \"Help, help, a\nHerrible Hoffalump! Hoff, Hoff, a Hellible Horralump! ", "Holl, Holl, a\nHoffable Hellerump!\" And he didn't stop crying and scampering until he\ngot to Christopher Robin's house.\n\n\"Whatever's the matter, Piglet?\" said Christopher Robin, who was just\ngetting up", ".\n\n\"Heff,\" said Piglet, breathing so hard that he could hardly speak, \"a\nHeff--a Heff--a Heffalump.\"\n\n\"Where?\"\n\n\"Up there,\" said Piglet, waving his paw.\n\n\"What did it look like?\"\n\n\"Like--like----It ha", "d the biggest head you ever saw, Christopher Robin.\nA great enormous thing, like--like nothing. A huge big--well, like a--I\ndon't know--like an enormous big nothing. Like a jar.\"\n\n\"Well,\" said Christo", "pher Robin, putting on his shoes, \"I shall go and\nlook at it. Come on.\"\n\nPiglet wasn't afraid if he had Christopher Robin with him, so off they\nwent....\n\n\"I can hear it, can't you?\" said Piglet anxiou", "sly, as they got near.\n\n\"I can hear _something_,\" said Christopher Robin.\n\nIt was Pooh bumping his head against a tree-root he had found.\n\n\"There!\" said Piglet. \"Isn't it _awful_?\" And he held on tigh", "t to\nChristopher Robin's hand.\n\nSuddenly Christopher Robin began to laugh ... and he laughed ... and he\nlaughed ... and he laughed. And while he was still laughing--_Crash_\nwent the Heffalump's head a", "gainst the tree-root, Smash went the jar,\nand out came Pooh's head again....\n\nThen Piglet saw what a Foolish Piglet he had been, and he was so ashamed\nof himself that he ran straight off home and went", " to bed with a\nheadache. But Christopher Robin and Pooh went home to breakfast\ntogether.\n\n\"Oh, Bear!\" said Christopher Robin. \"How I do love you!\"\n\n\"So do I,\" said Pooh.\n\n\n\n\n                          ", "     CHAPTER VI\n\n                     IN WHICH EEYORE HAS A BIRTHDAY\n                          AND GETS TWO PRESENTS\n\n\nEeyore, the old grey Donkey, stood by the side of the stream, and\nlooked at himse", "lf in the water.\n\n\"Pathetic,\" he said. \"That's what it is. Pathetic.\"\n\nHe turned and walked slowly down the stream for twenty yards, splashed\nacross it, and walked slowly back on the other side. Then ", "he looked at\nhimself in the water again.\n\n\"As I thought,\" he said. \"No better from _this_ side. But nobody minds.\nNobody cares. Pathetic, that's what it is.\"\n\nThere was a crackling noise in the bracke", "n behind him, and out came\nPooh.\n\n\"Good morning, Eeyore,\" said Pooh.\n\n\"Good morning, Pooh Bear,\" said Eeyore gloomily. \"If it _is_ a good\nmorning,\" he said. \"Which I doubt,\" said he.\n\n\"Why, what's the", " matter?\"\n\n\"Nothing, Pooh Bear, nothing. We can't all, and some of us don't. That's\nall there is to it.\"\n\n\"Can't all _what_?\" said Pooh, rubbing his nose.\n\n\"Gaiety. Song-and-dance. Here we go round th", "e mulberry bush.\"\n\n\"Oh!\" said Pooh. He thought for a long time, and then asked, \"What\nmulberry bush is that?\"\n\n\"Bon-hommy,\" went on Eeyore gloomily. \"French word meaning bonhommy,\" he\nexplained. \"I'm ", "not complaining, but There It Is.\"\n\nPooh sat down on a large stone, and tried to think this out. It sounded\nto him like a riddle, and he was never much good at riddles, being a\nBear of Very Little Bra", "in. So he sang _Cottleston Pie_ instead:\n\n    Cottleston, Cottleston, Cottleston Pie,\n    A fly can't bird, but a bird can fly.\n    Ask me a riddle and I reply:\n    \"_Cottleston, Cottleston, Cottlesto", "n Pie._\"\n\nThat was the first verse. When he had finished it, Eeyore didn't\nactually say that he didn't like it, so Pooh very kindly sang the second\nverse to him:\n\n    Cottleston, Cottleston, Cottlesto", "n Pie,\n    A fish can't whistle and neither can I.\n    Ask me a riddle and I reply:\n    \"_Cottleston, Cottleston, Cottleston Pie_.\"\n\nEeyore still said nothing at all, so Pooh hummed the third verse qu", "ietly\nto himself:\n\n    Cottleston, Cottleston, Cottleston Pie,\n    Why does a chicken, I don't know why.\n    Ask me a riddle and I reply:\n    \"_Cottleston, Cottleston, Cottleston Pie_.\"\n\n\"That's right", ",\" said Eeyore. \"Sing. Umty-tiddly, umty-too. Here we go\ngathering Nuts and May. Enjoy yourself.\"\n\n\"I am,\" said Pooh.\n\n\"Some can,\" said Eeyore.\n\n\"Why, what's the matter?\"\n\n\"_Is_ anything the matter?\"\n", "\n\"You seem so sad, Eeyore.\"\n\n\"Sad? Why should I be sad? It's my birthday. The happiest day of the\nyear.\"\n\n\"Your birthday?\" said Pooh in great surprise.\n\n\"Of course it is. Can't you see? Look at all th", "e presents I have had.\"\nHe waved a foot from side to side. \"Look at the birthday cake. Candles\nand pink sugar.\"\n\nPooh looked--first to the right and then to the left.\n\n\"Presents?\" said Pooh. \"Birthday", " cake?\" said Pooh. \"_Where?_\"\n\n\"Can't you see them?\"\n\n\"No,\" said Pooh.\n\n\"Neither can I,\" said Eeyore. \"Joke,\" he explained. \"Ha ha!\"\n\nPooh scratched his head, being a little puzzled by all this.\n\n\"But", " is it really your birthday?\" he asked.\n\n\"It is.\"\n\n\"Oh! Well, Many happy returns of the day, Eeyore.\"\n\n\"And many happy returns to you, Pooh Bear.\"\n\n\"But it isn't _my_ birthday.\"\n\n\"No, it's mine.\"\n\n\"Bu", "t you said 'Many happy returns'----\"\n\n\"Well, why not? You don't always want to be miserable on my birthday, do\nyou?\"\n\n\"Oh, I see,\" said Pooh.\n\n\"It's bad enough,\" said Eeyore, almost breaking down, \"be", "ing miserable\nmyself, what with no presents and no cake and no candles, and no proper\nnotice taken of me at all, but if everybody else is going to be\nmiserable too----\"\n\nThis was too much for Pooh. \"S", "tay there!\" he called to Eeyore, as he\nturned and hurried back home as quick as he could; for he felt that he\nmust get poor Eeyore a present of _some_ sort at once, and he could\nalways think of a prop", "er one afterwards.\n\nOutside his house he found Piglet, jumping up and down trying to reach\nthe knocker.\n\n\"Hallo, Piglet,\" he said.\n\n\"Hallo, Pooh,\" said Piglet.\n\n\"What are _you_ trying to do?\"\n\n\"I was ", "trying to reach the knocker,\" said Piglet. \"I just came\nround----\"\n\n\"Let me do it for you,\" said Pooh kindly. So he reached up and knocked\nat the door. \"I have just seen Eeyore,\" he began, \"and poor E", "eyore is in\na Very Sad Condition, because it's his birthday, and nobody has taken\nany notice of it, and he's very Gloomy--you know what Eeyore is--and\nthere he was, and----What a long time whoever liv", "es here is answering\nthis door.\" And he knocked again.\n\n\"But Pooh,\" said Piglet, \"it's your own house!\"\n\n\"Oh!\" said Pooh. \"So it is,\" he said. \"Well, let's go in.\"\n\nSo in they went. The first thing Po", "oh did was to go to the cupboard to\nsee if he had quite a small jar of honey left; and he had, so he took it\ndown.\n\n\"I'm giving this to Eeyore,\" he explained, \"as a present. What are _you_\ngoing to gi", "ve?\"\n\n\"Couldn't I give it too?\" said Piglet. \"From both of us?\"\n\n\"No,\" said Pooh. \"That would _not_ be a good plan.\"\n\n\"All right, then, I'll give him a balloon. I've got one left from my\nparty. I'll g", "o and get it now, shall I?\"\n\n\"That, Piglet, is a _very_ good idea. It is just what Eeyore wants to\ncheer him up. Nobody can be uncheered with a balloon.\"\n\nSo off Piglet trotted; and in the other direc", "tion went Pooh, with his\njar of honey.\n\nIt was a warm day, and he had a long way to go. He hadn't gone more than\nhalf-way when a sort of funny feeling began to creep all over him. It\nbegan at the tip ", "of his nose and trickled all through him and out at the\nsoles of his feet. It was just as if somebody inside him were saying,\n\"Now then, Pooh, time for a little something.\"\n\n\"Dear, dear,\" said Pooh, \"", "I didn't know it was as late as that.\" So he\nsat down and took the top off his jar of honey. \"Lucky I brought this\nwith me,\" he thought. \"Many a bear going out on a warm day like this\nwould never have", " thought of bringing a little something with him.\" And\nhe began to eat.\n\n\"Now let me see,\" he thought, as he took his last lick of the inside of\nthe jar, \"where was I going? Ah, yes, Eeyore.\" He got u", "p slowly.\n\nAnd then, suddenly, he remembered. He had eaten Eeyore's birthday\npresent!\n\n\"_Bother!_\" said Pooh. \"What _shall_ I do? I _must_ give him\n_something_.\"\n\nFor a little while he couldn't think ", "of anything. Then he thought:\n\"Well, it's a very nice pot, even if there's no honey in it, and if I\nwashed it clean, and got somebody to write '_A Happy Birthday_' on it,\nEeyore could keep things in i", "t, which might be Useful.\" So, as he was\njust passing the Hundred Acre Wood, he went inside to call on Owl, who\nlived there.\n\n\"Good morning, Owl,\" he said.\n\n\"Good morning, Pooh,\" said Owl.\n\n\"Many happ", "y returns of Eeyore's birthday,\" said Pooh.\n\n\"Oh, is that what it is?\"\n\n\"What are you giving him, Owl?\"\n\n\"What are _you_ giving him, Pooh?\"\n\n\"I'm giving him a Useful Pot to Keep Things In, and I wante", "d to ask\nyou----\"\n\n\"Is this it?\" said Owl, taking it out of Pooh's paw.\n\n\"Yes, and I wanted to ask you----\"\n\n\"Somebody has been keeping honey in it,\" said Owl.\n\n\"You can keep _anything_ in it,\" said P", "ooh earnestly. \"It's Very Useful\nlike that. And I wanted to ask you----\"\n\n\"You ought to write '_A Happy Birthday_' on it.\"\n\n\"_That_ was what I wanted to ask you,\" said Pooh. \"Because my spelling\nis Wo", "bbly. It's good spelling but it Wobbles, and the letters get in the\nwrong places. Would _you_ write 'A Happy Birthday' on it for me?\"\n\n\"It's a nice pot,\" said Owl, looking at it all round. \"Couldn't I", " give\nit too? From both of us?\"\n\n\"No,\" said Pooh. \"That would _not_ be a good plan. Now I'll just wash it\nfirst, and then you can write on it.\"\n\nWell, he washed the pot out, and dried it, while Owl li", "cked the end of\nhis pencil, and wondered how to spell \"birthday.\"\n\n\"Can you read, Pooh?\" he asked a little anxiously. \"There's a notice\nabout knocking and ringing outside my door, which Christopher Ro", "bin\nwrote. Could you read it?\"\n\n\"Christopher Robin told me what it said, and _then_ I could.\"\n\n\"Well, I'll tell you what _this_ says, and then you'll be able to.\"\n\nSo Owl wrote ... and this is what he", " wrote:\n\n                 HIPY PAPY BTHUTHDTH THUTHDA BTHUTHDY.\n\nPooh looked on admiringly.\n\n\"I'm just saying 'A Happy Birthday',\" said Owl carelessly.\n\n\"It's a nice long one,\" said Pooh, very much im", "pressed by it.\n\n\"Well, _actually_, of course, I'm saying 'A Very Happy Birthday with\nlove from Pooh.' Naturally it takes a good deal of pencil to say a long\nthing like that.\"\n\n\"Oh, I see,\" said Pooh.\n", "\nWhile all this was happening, Piglet had gone back to his own house to\nget Eeyore's balloon. He held it very tightly against himself, so that\nit shouldn't blow away, and he ran as fast as he could so", " as to get to\nEeyore before Pooh did; for he thought that he would like to be the\nfirst one to give a present, just as if he had thought of it without\nbeing told by anybody. And running along, and thi", "nking how pleased\nEeyore would be, he didn't look where he was going ... and suddenly he\nput his foot in a rabbit hole, and fell down flat on his face.\n\nBANG!!!???***!!!\n\nPiglet lay there, wondering w", "hat had happened. At first he thought that\nthe whole world had blown up; and then he thought that perhaps only the\nForest part of it had; and then he thought that perhaps only _he_ had,\nand he was now", " alone in the moon or somewhere, and would never see\nChristopher Robin or Pooh or Eeyore again. And then he thought, \"Well,\neven if I'm in the moon, I needn't be face downwards all the time,\" so\nhe go", "t cautiously up and looked about him.\n\nHe was still in the Forest!\n\n\"Well, that's funny,\" he thought. \"I wonder what that bang was. I\ncouldn't have made such a noise just falling down. And where's my\n", "balloon? And what's that small piece of damp rag doing?\"\n\nIt was the balloon!\n\n\"Oh, dear!\" said Piglet \"Oh, dear, oh, dearie, dearie, dear! Well, it's\ntoo late now. I can't go back, and I haven't anot", "her balloon, and\nperhaps Eeyore doesn't _like_ balloons so _very_ much.\"\n\nSo he trotted on, rather sadly now, and down he came to the side of the\nstream where Eeyore was, and called out to him.\n\n\"Good", " morning, Eeyore,\" shouted Piglet.\n\n\"Good morning, Little Piglet,\" said Eeyore. \"If it _is_ a good morning,\"\nhe said. \"Which I doubt,\" said he. \"Not that it matters,\" he said.\n\n\"Many happy returns of ", "the day,\" said Piglet, having now got closer.\n\nEeyore stopped looking at himself in the stream, and turned to stare at\nPiglet.\n\n\"Just say that again,\" he said.\n\n\"Many hap----\"\n\n\"Wait a moment.\"\n\nBalan", "cing on three legs, he began to bring his fourth leg very\ncautiously up to his ear. \"I did this yesterday,\" he explained, as he\nfell down for the third time. \"It's quite easy. It's so as I can hear\nbe", "tter.... There, that's done it! Now then, what were you saying?\" He\npushed his ear forward with his hoof.\n\n\"Many happy returns of the day,\" said Piglet again.\n\n\"Meaning me?\"\n\n\"Of course, Eeyore.\"\n\n\"My", " birthday?\"\n\n\"Yes.\"\n\n\"Me having a real birthday?\"\n\n\"Yes, Eeyore, and I've brought you a present.\"\n\nEeyore took down his right hoof from his right ear, turned round, and\nwith great difficulty put up hi", "s left hoof.\n\n\"I must have that in the other ear,\" he said. \"Now then.\"\n\n\"A present,\" said Piglet very loudly.\n\n\"Meaning me again?\"\n\n\"Yes.\"\n\n\"My birthday still?\"\n\n\"Of course, Eeyore.\"\n\n\"Me going on ha", "ving a real birthday?\"\n\n\"Yes, Eeyore, and I brought you a balloon.\"\n\n\"_Balloon?_\" said Eeyore. \"You did say balloon? One of those big\ncoloured things you blow up? Gaiety, song-and-dance, here we are a", "nd\nthere we are?\"\n\n\"Yes, but I'm afraid--I'm very sorry, Eeyore--but when I was running\nalong to bring it you, I fell down.\"\n\n\"Dear, dear, how unlucky! You ran too fast, I expect. You didn't hurt\nyour", "self, Little Piglet?\"\n\n\"No, but I--I--oh, Eeyore, I burst the balloon!\"\n\nThere was a very long silence.\n\n\"My balloon?\" said Eeyore at last.\n\nPiglet nodded.\n\n\"My birthday balloon?\"\n\n\"Yes, Eeyore,\" said", " Piglet sniffing a little. \"Here it is. With--with\nmany happy returns of the day.\" And he gave Eeyore the small piece of\ndamp rag.\n\n\"Is this it?\" said Eeyore, a little surprised.\n\nPiglet nodded.\n\n\"My ", "present?\"\n\nPiglet nodded again.\n\n\"The balloon?\"\n\n\"Yes.\"\n\n\"Thank you, Piglet,\" said Eeyore. \"You don't mind my asking,\" he went\non, \"but what colour was this balloon when it--when it _was_ a balloon?\"\n", "\n\"Red.\"\n\n\"I just wondered.... Red,\" he murmured to himself. \"My favourite\ncolour.... How big was it?\"\n\n\"About as big as me.\"\n\n\"I just wondered.... About as big as Piglet,\" he said to himself\nsadly. \"M", "y favourite size. Well, well.\"\n\nPiglet felt very miserable, and didn't know what to say. He was still\nopening his mouth to begin something, and then deciding that it wasn't\nany good saying _that_, whe", "n he heard a shout from the other side of the\nriver, and there was Pooh.\n\n\"Many happy returns of the day,\" called out Pooh, forgetting that he had\nsaid it already.\n\n\"Thank you, Pooh, I'm having them,\"", " said Eeyore gloomily.\n\n\"I've brought you a little present,\" said Pooh excitedly.\n\n\"I've had it,\" said Eeyore.\n\nPooh had now splashed across the stream to Eeyore, and Piglet was\nsitting a little way o", "ff, his head in his paws, snuffling to himself.\n\n\"It's a Useful Pot,\" said Pooh. \"Here it is. And it's got 'A Very Happy\nBirthday with love from Pooh' written on it. That's what all that\nwriting is. A", "nd it's for putting things in. There!\"\n\nWhen Eeyore saw the pot, he became quite excited.\n\n\"Why!\" he said. \"I believe my Balloon will just go into that Pot!\"\n\n\"Oh, no, Eeyore,\" said Pooh. \"Balloons ar", "e much too big to go into Pots.\nWhat you do with a balloon is, you hold the ballon----\"\n\n\"Not mine,\" said Eeyore proudly. \"Look, Piglet!\" And as Piglet looked\nsorrowfully round, Eeyore picked the ball", "oon up with his teeth, and\nplaced it carefully in the pot; picked it out and put it on the ground;\nand then picked it up again and put it carefully back.\n\n\"So it does!\" said Pooh. \"It goes in!\"\n\n\"So i", "t does!\" said Piglet. \"And it comes out!\"\n\n\"Doesn't it?\" said Eeyore. \"It goes in and out like anything.\"\n\n\"I'm very glad,\" said Pooh happily, \"that I thought of giving you a\nUseful Pot to put things ", "in.\"\n\n\"I'm very glad,\" said Piglet happily, \"that I thought of giving you\nSomething to put in a Useful Pot.\"\n\nBut Eeyore wasn't listening. He was taking the balloon out, and putting\nit back again, as ", "happy as could be....\n\n                 *        *        *        *        *\n\n\"And didn't _I_ give him anything?\" asked Christopher Robin sadly.\n\n\"Of course you did,\" I said. \"You gave him--don't you", " remember--a\nlittle--a little----\"\n\n\"I gave him a box of paints to paint things with.\"\n\n\"That was it.\"\n\n\"Why didn't I give it to him in the morning?\"\n\n\"You were so busy getting his party ready for him", ". He had a cake with\nicing on the top, and three candles, and his name in pink sugar,\nand----\"\n\n\"Yes, _I_ remember,\" said Christopher Robin.\n\n\n\n\n                              CHAPTER VII\n\n            ", "        IN WHICH KANGA AND BABY ROO COME\n                  TO THE FOREST, AND PIGLET HAS A BATH\n\n\nNobody seemed to know where they came from, but there they were in the\nForest: Kanga and Baby Roo. Whe", "n Pooh asked Christopher Robin, \"How did\nthey come here?\" Christopher Robin said, \"In the Usual Way, if you know\nwhat I mean, Pooh,\" and Pooh, who didn't, said \"Oh!\" Then he nodded his\nhead twice and ", "said, \"In the Usual Way. Ah!\" Then he went to call upon\nhis friend Piglet to see what _he_ thought about it. And at Piglet's\nhouse he found Rabbit. So they all talked about it together.\n\n\"What I don't", " like about it is this,\" said Rabbit. \"Here are we--you,\nPooh, and you, Piglet, and Me--and suddenly----\"\n\n\"And Eeyore,\" said Pooh.\n\n\"And Eeyore--and then suddenly----\"\n\n\"And Owl,\" said Pooh.\n\n\"And Ow", "l--and then all of a sudden----\"\n\n\"Oh, and Eeyore,\" said Pooh. \"I was forgetting _him_.\"\n\n\"Here--we--are,\" said Rabbit very slowly and carefully, \"all--of--us,\nand then, suddenly, we wake up one morni", "ng and, what do we find? We find\na Strange Animal among us. An animal of whom we have never even heard\nbefore! An animal who carries her family about with her in her pocket!\nSuppose _I_ carried _my_ f", "amily about with me in _my_ pocket, how many\npockets should I want?\"\n\n\"Sixteen,\" said Piglet.\n\n\"Seventeen, isn't it?\" said Rabbit. \"And one more for a\nhandkerchief--that's eighteen. Eighteen pockets i", "n one suit! I haven't\ntime.\"\n\nThere was a long and thoughtful silence ... and then Pooh, who had\nbeen frowning very hard for some minutes, said: \"_I_ make it fifteen.\"\n\n\"What?\" said Rabbit.\n\n\"Fifteen.", "\"\n\n\"Fifteen what?\"\n\n\"Your family.\"\n\n\"What about them?\"\n\nPooh rubbed his nose and said that he thought Rabbit had been talking\nabout his family.\n\n\"Did I?\" said Rabbit carelessly.\n\n\"Yes, you said----\"\n\n", "\"Never mind, Pooh,\" said Piglet impatiently.\n\n\"The question is, What are we to do about Kanga?\"\n\n\"Oh, I see,\" said Pooh.\n\n\"The best way,\" said Rabbit, \"would be this. The best way would be to\nsteal Ba", "by Roo and hide him, and then when Kanga says, 'Where's Baby\nRoo?' we say, '_Aha!_'\"\n\n\"_Aha!_\" said Pooh, practising. \"_Aha! Aha!_ ... Of course,\" he went\non, \"we could say 'Aha!' even if we hadn't st", "olen Baby Roo.\"\n\n\"Pooh,\" said Rabbit kindly, \"you haven't any brain.\"\n\n\"I know,\" said Pooh humbly.\n\n\"We say '_Aha!_' so that Kanga knows that _we_ know where Baby Roo is.\n'_Aha!_' means 'We'll tell yo", "u where Baby Roo is, if you promise to go\naway from the Forest and never come back.' Now don't talk while I\nthink.\"\n\nPooh went into a corner and tried saying 'Aha!' in that sort of voice.\nSometimes it", " seemed to him that it did mean what Rabbit said, and\nsometimes it seemed to him that it didn't. \"I suppose it's just\npractice,\" he thought. \"I wonder if Kanga will have to practise too so\nas to under", "stand it.\"\n\n\"There's just one thing,\" said Piglet, fidgeting a bit. \"I was talking\nto Christopher Robin, and he said that a Kanga was Generally Regarded as\nOne of the Fiercer Animals. I am not frighte", "ned of Fierce Animals in the\nordinary way, but it is well known that, if One of the Fiercer Animals\nis Deprived of Its Young, it becomes as fierce as Two of the Fiercer\nAnimals. In which case '_Aha!_'", " is perhaps a _foolish_ thing to say.\"\n\n\"Piglet,\" said Rabbit, taking out a pencil, and licking the end of it,\n\"you haven't any pluck.\"\n\n\"It is hard to be brave,\" said Piglet, sniffing slightly, \"when", " you're\nonly a Very Small Animal.\"\n\nRabbit, who had begun to write very busily, looked up and said:\n\n\"It is because you are a very small animal that you will be Useful in\nthe adventure before us.\"\n\nPi", "glet was so excited at the idea of being Useful, that he forgot to be\nfrightened any more, and when Rabbit went on to say that Kangas were\nonly Fierce during the winter months, being at other times of", " an\nAffectionate Disposition, he could hardly sit still, he was so eager to\nbegin being useful at once.\n\n\"What about me?\" said Pooh sadly. \"I suppose _I_ shan't be useful?\"\n\n\"Never mind, Pooh,\" said P", "iglet comfortingly. \"Another time perhaps.\"\n\n\"Without Pooh,\" said Rabbit solemnly as he sharpened his pencil, \"the\nadventure would be impossible.\"\n\n\"Oh!\" said Piglet, and tried not to look disappointe", "d. But Pooh went\ninto a corner of the room and said proudly to himself, \"Impossible\nwithout Me! _That_ sort of Bear.\"\n\n\"Now listen all of you,\" said Rabbit when he had finished writing, and\nPooh and P", "iglet sat listening very eagerly with their mouths open. This\nwas what Rabbit read out:\n\n                        PLAN TO CAPTURE BABY ROO\n\n   1. _General Remarks._ Kanga runs faster than any of Us, ev", "en Me.\n\n   2. _More General Remarks._ Kanga never takes her eye off Baby Roo,\n      except when he's safely buttoned up in her pocket.\n\n   3. _Therefore._ If we are to capture Baby Roo, we must get a ", "Long\n      Start, because Kanga runs faster than any of Us, even Me.\n     (_See_ 1.)\n\n   4. _A Thought._ If Roo had jumped out of Kanga's pocket and Piglet\n      had jumped in, Kanga wouldn't know the", " difference, because Piglet\n      is a Very Small Animal.\n\n   5. Like Roo.\n\n   6. But Kanga would have to be looking the other way first, so as not\n      to see Piglet jumping in.\n\n   7. See 2.\n\n   8.", " _Another Thought._ But if Pooh was talking to her very excitedly,\n      she _might_ look the other way for a moment.\n\n   9. And then I could run away with Roo.\n\n   10. Quickly.\n\n   11. _And Kanga wou", "ldn't discover the difference until Afterwards._\n\nWell, Rabbit read this out proudly, and for a little while after he had\nread it nobody said anything. And then Piglet, who had been opening and\nshutti", "ng his mouth without making any noise, managed to say very\nhuskily:\n\n\"And--Afterwards?\"\n\n\"How do you mean?\"\n\n\"When Kanga _does_ Discover the Difference?\"\n\n\"Then we all say '_Aha!_'\"\n\n\"All three of us?", "\"\n\n\"Yes.\"\n\n\"Oh!\"\n\n\"Why, what's the trouble, Piglet?\"\n\n\"Nothing,\" said Piglet, \"as long as _we all three_ say it. As long as we\nall three say it,\" said Piglet, \"I don't mind,\" he said, \"but I\nshouldn't", " care to say '_Aha!_' by myself. It wouldn't sound _nearly_ so\nwell. By the way,\" he said, \"you _are_ quite sure about what you said\nabout the winter months?\"\n\n\"The winter months?\"\n\n\"Yes, only being F", "ierce in the Winter Months.\"\n\n\"Oh, yes, yes, that's all right. Well, Pooh? You see what you have to\ndo?\"\n\n\"No,\" said Pooh Bear. \"Not yet,\" he said. \"What _do_ I do?\"\n\n\"Well, you just have to talk very", " hard to Kanga so as she doesn't notice\nanything.\"\n\n\"Oh! What about?\"\n\n\"Anything you like.\"\n\n\"You mean like telling her a little bit of poetry or something?\"\n\n\"That's it,\" said Rabbit. \"Splendid. Now ", "come along.\"\n\nSo they all went out to look for Kanga.\n\nKanga and Roo were spending a quiet afternoon in a sandy part of the\nForest. Baby Roo was practising very small jumps in the sand, and\nfalling do", "wn mouse-holes and climbing out of them, and Kanga was\nfidgeting about and saying \"Just one more jump, dear, and then we must\ngo home.\" And at that moment who should come stumping up the hill but\nPooh", ".\n\n\"Good afternoon, Kanga.\"\n\n\"Good afternoon, Pooh.\"\n\n\"Look at me jumping,\" squeaked Roo, and fell into another mouse-hole.\n\n\"Hallo, Roo, my little fellow!\"\n\n\"We were just going home,\" said Kanga. \"Go", "od afternoon, Rabbit. Good\nafternoon, Piglet.\"\n\nRabbit and Piglet, who had now come up from the other side of the hill,\nsaid \"Good afternoon,\" and \"Hallo, Roo,\" and Roo asked them to look at\nhim jumpi", "ng, so they stayed and looked.\n\nAnd Kanga looked too....\n\n\"Oh, Kanga,\" said Pooh, after Rabbit had winked at him twice, \"I don't\nknow if you are interested in Poetry at all?\"\n\n\"Hardly at all,\" said Ka", "nga.\n\n\"Oh!\" said Pooh.\n\n\"Roo, dear, just one more jump and then we must go home.\"\n\nThere was a short silence while Roo fell down another mouse-hole.\n\n\"Go on,\" said Rabbit in a loud whisper behind his ", "paw.\n\n\"Talking of Poetry,\" said Pooh, \"I made up a little piece as I was\ncoming along. It went like this. Er--now let me see----\"\n\n\"Fancy!\" said Kanga. \"Now Roo, dear----\"\n\n\"You'll like this piece of ", "poetry,\" said Rabbit.\n\n\"You'll love it,\" said Piglet.\n\n\"You must listen very carefully,\" said Rabbit.\n\n\"So as not to miss any of it,\" said Piglet.\n\n\"Oh, yes,\" said Kanga, but she still looked at Baby ", "Roo.\n\n\"_How_ did it go, Pooh?\" said Rabbit.\n\nPooh gave a little cough and began.\n\n              LINES WRITTEN BY A BEAR OF VERY LITTLE BRAIN\n\n    On Monday, when the sun is hot\n    I wonder to myself ", "a lot:\n    \"Now is it true, or is it not,\n    \"That what is which and which is what?\"\n\n    On Tuesday, when it hails and snows,\n    The feeling on me grows and grows\n    That hardly anybody knows\n    ", "If those are these or these are those.\n\n    On Wednesday, when the sky is blue,\n    And I have nothing else to do,\n    I sometimes wonder if it's true\n    That who is what and what is who.\n\n    On Thu", "rsday, when it starts to freeze\n    And hoar-frost twinkles on the trees,\n    How very readily one sees\n    That these are whose--but whose are these?\n\n    On Friday----\n\n\"Yes, it is, isn't it?\" said ", "Kanga, not waiting to hear what happened on\nFriday. \"Just one more jump, Roo, dear, and then we really _must_ be\ngoing.\"\n\nRabbit gave Pooh a hurrying-up sort of nudge.\n\n\"Talking of Poetry,\" said Pooh ", "quickly, \"have you ever noticed that tree\nright over there?\"\n\n\"Where?\" said Kanga. \"Now, Roo----\"\n\n\"Right over there,\" said Pooh, pointing behind Kanga's back.\n\n\"No,\" said Kanga. \"Now jump in, Roo, de", "ar, and we'll go home.\"\n\n\"You ought to look at that tree right over there,\" said Rabbit. \"Shall I\nlift you in, Roo?\" And he picked up Roo in his paws.\n\n\"I can see a bird in it from here,\" said Pooh. \"", "Or is it a fish?\"\n\n\"You ought to see that bird from here,\" said Rabbit. \"Unless it's a\nfish.\"\n\n\"It isn't a fish, it's a bird,\" said Piglet.\n\n\"So it is,\" said Rabbit.\n\n\"Is it a starling or a blackbird?", "\" said Pooh.\n\n\"That's the whole question,\" said Rabbit. \"Is it a blackbird or a\nstarling?\"\n\nAnd then at last Kanga did turn her head to look. And the moment that\nher head was turned, Rabbit said in a ", "loud voice \"In you go, Roo!\" and\nin jumped Piglet into Kanga's pocket, and off scampered Rabbit, with Roo\nin his paws, as fast as he could.\n\n\"Why, where's Rabbit?\" said Kanga, turning round again. \"Ar", "e you all\nright, Roo, dear?\"\n\nPiglet made a squeaky Roo-noise from the bottom of Kanga's pocket.\n\n\"Rabbit had to go away,\" said Pooh. \"I think he thought of something he\nhad to go and see about sudden", "ly.\"\n\n\"And Piglet?\"\n\n\"I think Piglet thought of something at the same time. Suddenly.\"\n\n\"Well, we must be getting home,\" said Kanga. \"Good-bye, Pooh.\" And in\nthree large jumps she was gone.\n\nPooh look", "ed after her as she went.\n\n\"I wish I could jump like that,\" he thought. \"Some can and some can't.\nThat's how it is.\"\n\nBut there were moments when Piglet wished that Kanga couldn't. Often,\nwhen he had ", "had a long walk home through the Forest, he had wished that\nhe were a bird; but now he thought jerkily to himself at the bottom of\nKanga's pocket,\n\n        this                              take\n    \"", "If      is          shall      really    to\n                flying I      never              it.\"\n\nAnd as he went up in the air he said, \"_Ooooooo!_\" and as he came down\nhe said, \"_Ow!_\" And he was sa", "ying, \"_Ooooooo-ow, Ooooooo-ow,\nOoooooo-ow_\" all the way to Kanga's house.\n\nOf course as soon as Kanga unbuttoned her pocket, she saw what had\nhappened. Just for a moment, she thought she was frighten", "ed, and then\nshe knew she wasn't; for she felt quite sure that Christopher Robin\nwould never let any harm happen to Roo. So she said to herself, \"If they\nare having a joke with me, I will have a joke ", "with them.\"\n\n\"Now then, Roo, dear,\" she said, as she took Piglet out of her pocket.\n\"Bed-time.\"\n\n\"_Aha!_\" said Piglet, as well as he could after his Terrifying Journey.\nBut it wasn't a very good \"_Aha", "!_\" and Kanga didn't seem to understand\nwhat it meant.\n\n\"Bath first,\" said Kanga in a cheerful voice.\n\n\"_Aha!_\" said Piglet again, looking round anxiously for the others. But\nthe others weren't there.", " Rabbit was playing with Baby Roo in his own\nhouse, and feeling more fond of him every minute, and Pooh, who had\ndecided to be a Kanga, was still at the sandy place on the top of the\nForest, practisin", "g jumps.\n\n\"I am not at all sure,\" said Kanga in a thoughtful voice, \"that it\nwouldn't be a good idea to have a _cold_ bath this evening. Would you\nlike that, Roo, dear?\"\n\nPiglet, who had never been re", "ally fond of baths, shuddered a long\nindignant shudder, and said in as brave a voice as he could:\n\n\"Kanga, I see that the time has come to spleak painly.\"\n\n\"Funny little Roo,\" said Kanga, as she got t", "he bath-water ready.\n\n\"I am _not_ Roo,\" said Piglet loudly. \"I am Piglet!\"\n\n\"Yes, dear, yes,\" said Kanga soothingly. \"And imitating Piglet's voice\ntoo! So clever of him,\" she went on, as she took a la", "rge bar of yellow\nsoap out of the cupboard. \"What _will_ he be doing next?\"\n\n\"Can't you _see_?\" shouted Piglet. \"Haven't you got _eyes_? _Look_ at\nme!\"\n\n\"I _am_ looking, Roo, dear,\" said Kanga rather ", "severely. \"And you know\nwhat I told you yesterday about making faces. If you go on making faces\nlike Piglet's, you will grow up to _look_ like Piglet--and _then_ think\nhow sorry you will be. Now then,", " into the bath, and don't let me have to\nspeak to you about it again.\"\n\nBefore he knew where he was, Piglet was in the bath, and Kanga was\nscrubbing him firmly with a large lathery flannel.\n\n\"Ow!\" cri", "ed Piglet. \"Let me out! I'm Piglet!\"\n\n\"Don't open the mouth, dear, or the soap goes in,\" said Kanga. \"There!\nWhat did I tell you?\"\n\n\"You--you--you did it on purpose,\" spluttered Piglet, as soon as he\n", "could speak again ... and then accidentally had another mouthful of\nlathery flannel.\n\n\"That's right, dear, don't say anything,\" said Kanga, and in another\nminute Piglet was out of the bath, and being ", "rubbed dry with a towel.\n\n\"Now,\" said Kanga, \"there's your medicine, and then bed.\"\n\n\"W-w-what medicine?\" said Piglet.\n\n\"To make you grow big and strong, dear. You don't want to grow up small\nand weak", " like Piglet, do you? Well, then!\"\n\nAt that moment there was a knock at the door.\n\n\"Come in,\" said Kanga, and in came Christopher Robin.\n\n\"Christopher Robin, Christopher Robin!\" cried Piglet. \"Tell Ka", "nga who I\nam! She keeps saying I'm Roo. I'm _not_ Roo, am I?\"\n\nChristopher Robin looked at him very carefully, and shook his head.\n\n\"You can't be Roo,\" he said, \"because I've just seen Roo playing in\n", "Rabbit's house.\"\n\n\"Well!\" said Kanga. \"Fancy that! Fancy my making a mistake like that.\"\n\n\"There you are!\" said Piglet. \"I told you so. I'm Piglet.\"\n\nChristopher Robin shook his head again.\n\n\"Oh, you'", "re not Piglet,\" he said. \"I know Piglet well, and he's _quite_\na different colour.\"\n\nPiglet began to say that this was because he had just had a bath, and\nthen he thought that perhaps he wouldn't say ", "that, and as he opened his\nmouth to say something else, Kanga slipped the medicine spoon in, and\nthen patted him on the back and told him that it was really quite a nice\ntaste when you got used to it.", "\n\n\"I knew it wasn't Piglet,\" said Kanga. \"I wonder who it can be.\"\n\n\"Perhaps it's some relation of Pooh's,\" said Christopher Robin. \"What\nabout a nephew or an uncle or something?\"\n\nKanga agreed that t", "his was probably what it was, and said that they\nwould have to call it by some name.\n\n\"I shall call it Pootel,\" said Christopher Robin. \"Henry Pootel for\nshort.\"\n\nAnd just when it was decided, Henry P", "ootel wriggled out of Kanga's arms\nand jumped to the ground. To his great joy Christopher Robin had left\nthe door open. Never had Henry Pootel Piglet run so fast as he ran then,\nand he didn't stop run", "ning until he had got quite close to his house.\nBut when he was a hundred yards away he stopped running, and rolled the\nrest of the way home, so as to get his own nice comfortable colour\nagain....\n\nSo", " Kanga and Roo stayed in the Forest. And every Tuesday Roo spent the\nday with his great friend Rabbit, and every Tuesday Kanga spent the day\nwith her great friend Pooh, teaching him to jump, and every", " Tuesday\nPiglet spent the day with his great friend Christopher Robin. So they\nwere all happy again.\n\n\n\n\n                              CHAPTER VIII\n\n                    IN WHICH CHRISTOPHER ROBIN LEAD", "S\n                     AN EXPOTITION TO THE NORTH POLE\n\n\nOne fine day Pooh had stumped up to the top of the Forest to see if\nhis friend Christopher Robin was interested in Bears at all. At\nbreakfast t", "hat morning (a simple meal of marmalade spread lightly over a\nhoneycomb or two) he had suddenly thought of a new song. It began like\nthis:\n\n    \"_Sing Ho! for the life of a Bear._\"\n\nWhen he had got as", " far as this, he scratched his head, and thought to\nhimself \"That's a very good start for a song, but what about the second\nline?\" He tried singing \"Ho,\" two or three times, but it didn't seem to\nhelp", ". \"Perhaps it would be better,\" he thought, \"if I sang Hi for the\nlife of a Bear.\" So he sang it ... but it wasn't. \"Very well, then,\"\nhe said, \"I shall sing that first line twice, and perhaps if I si", "ng it\nvery quickly, I shall find myself singing the third and fourth lines\nbefore I have time to think of them, and that will be a Good Song. Now\nthen:\"\n\n          Sing Ho! for the life of a Bear!\n   ", "       Sing Ho! for the life of a Bear!\n    I don't much mind if it rains or snows,\n    'Cos I've got a lot of honey on my nice new nose,\n    I don't much care if it snows or thaws,\n    'Cos I've got ", "a lot of honey on my nice clean paws!\n          Sing Ho! for a Bear!\n          Sing Ho! for a Pooh!\n    And I'll have a little something in an hour or two!\n\nHe was so pleased with this song that he sa", "ng it all the way to the top\nof the Forest, \"and if I go on singing it much longer,\" he thought, \"it\nwill be time for the little something, and then the last line won't be\ntrue.\" So he turned it into ", "a hum instead.\n\nChristopher Robin was sitting outside his door, putting on his Big\nBoots. As soon as he saw the Big Boots, Pooh knew that an Adventure was\ngoing to happen, and he brushed the honey off", " his nose with the back of\nhis paw, and spruced himself up as well as he could, so as to look Ready\nfor Anything.\n\n\"Good-morning, Christopher Robin,\" he called out.\n\n\"Hallo, Pooh Bear. I can't get thi", "s boot on.\"\n\n\"That's bad,\" said Pooh.\n\n\"Do you think you could very kindly lean against me, 'cos I keep pulling\nso hard that I fall over backwards.\"\n\nPooh sat down, dug his feet into the ground, and p", "ushed hard against\nChristopher Robin's back, and Christopher Robin pushed hard against his,\nand pulled and pulled at his boot until he had got it on.\n\n\"And that's that,\" said Pooh. \"What do we do next", "?\"\n\n\"We are all going on an Expedition,\" said Christopher Robin, as he got\nup and brushed himself. \"Thank you, Pooh.\"\n\n\"Going on an Expotition?\" said Pooh eagerly. \"I don't think I've ever\nbeen on one", " of those. Where are we going to on this Expotition?\"\n\n\"Expedition, silly old Bear. It's got an 'x' in it.\"\n\n\"Oh!\" said Pooh. \"I know.\" But he didn't really.\n\n\"We're going to discover the North Pole.\"", "\n\n\"Oh!\" said Pooh again. \"What _is_ the North Pole?\" he asked.\n\n\"It's just a thing you discover,\" said Christopher Robin carelessly, not\nbeing quite sure himself.\n\n\"Oh! I see,\" said Pooh. \"Are bears a", "ny good at discovering it?\"\n\n\"Of course they are. And Rabbit and Kanga and all of you. It's an\nExpedition. That's what an Expedition means. A long line of everybody.\nYou'd better tell the others to ge", "t ready, while I see if my gun's all\nright. And we must all bring Provisions.\"\n\n\"Bring what?\"\n\n\"Things to eat.\"\n\n\"Oh!\" said Pooh happily. \"I thought you said Provisions. I'll go and\ntell them.\" And he", " stumped off.\n\nThe first person he met was Rabbit.\n\n\"Hallo, Rabbit,\" he said, \"is that you?\"\n\n\"Let's pretend it isn't,\" said Rabbit, \"and see what happens.\"\n\n\"I've got a message for you.\"\n\n\"I'll give ", "it to him.\"\n\n\"We're all going on an Expotition with Christopher Robin!\"\n\n\"What is it when we're on it?\"\n\n\"A sort of boat, I think,\" said Pooh.\n\n\"Oh! that sort.\"\n\n\"Yes. And we're going to discover a Po", "le or something. Or was it a Mole?\nAnyhow we're going to discover it.\"\n\n\"We are, are we?\" said Rabbit.\n\n\"Yes. And we've got to bring Pro--things to eat with us. In case we want\nto eat them. Now I'm go", "ing down to Piglet's. Tell Kanga, will you?\"\n\nHe left Rabbit and hurried down to Piglet's house. The Piglet was\nsitting on the ground at the door of his house blowing happily at a\ndandelion, and wonde", "ring whether it would be this year, next year,\nsometime or never. He had just discovered that it would be never, and\nwas trying to remember what \"_it_\" was, and hoping it wasn't anything\nnice, when Po", "oh came up.\n\n\"Oh! Piglet,\" said Pooh excitedly, \"we're going on an Expotition, all of\nus, with things to eat. To discover something.\"\n\n\"To discover what?\" said Piglet anxiously.\n\n\"Oh! just something.\"", "\n\n\"Nothing fierce?\"\n\n\"Christopher Robin didn't say anything about fierce. He just said it had\nan 'x'.\"\n\n\"It isn't their necks I mind,\" said Piglet earnestly. \"It's their teeth.\nBut if Christopher Robi", "n is coming I don't mind anything.\"\n\nIn a little while they were all ready at the top of the Forest, and the\nExpotition started. First came Christopher Robin and Rabbit, then Piglet\nand Pooh; then Kan", "ga, with Roo in her pocket, and Owl; then Eeyore; and,\nat the end, in a long line, all Rabbit's friends-and-relations.\n\n\"I didn't ask them,\" explained Rabbit carelessly. \"They just came. They\nalways d", "o. They can march at the end, after Eeyore.\"\n\n\"What I say,\" said Eeyore, \"is that it's unsettling. I didn't want to\ncome on this Expo--what Pooh said. I only came to oblige. But here I\nam; and if I am", " the end of the Expo--what we're talking about--then\nlet me _be_ the end. But if, every time I want to sit down for a\nlittle rest, I have to brush away half a dozen of Rabbit's smaller\nfriends-and-rel", "ations first, then this isn't an Expo--whatever it\nis--at all, it's simply a Confused Noise. That's what _I_ say.\"\n\n\"I see what Eeyore means,\" said Owl. \"If you ask me----\"\n\n\"I'm not asking anybody,\" ", "said Eeyore. \"I'm just telling everybody. We\ncan look for the North Pole, or we can play 'Here we go gathering Nuts\nand May' with the end part of an ant's nest. It's all the same to me.\"\n\nThere was a ", "shout from the top of the line.\n\n\"Come on!\" called Christopher Robin.\n\n\"Come on!\" called Pooh and Piglet.\n\n\"Come on!\" called Owl.\n\n\"We're starting,\" said Rabbit. \"I must go.\" And he hurried off to the", "\nfront of the Expotition with Christopher Robin.\n\n\"All right,\" said Eeyore. \"We're going. Only Don't Blame Me.\"\n\nSo off they all went to discover the Pole. And as they walked, they\nchattered to each o", "ther of this and that, all except Pooh, who was\nmaking up a song.\n\n\"This is the first verse,\" he said to Piglet, when he was ready with it.\n\n\"First verse of what?\"\n\n\"My song.\"\n\n\"What song?\"\n\n\"This one", ".\"\n\n\"Which one?\"\n\n\"Well, if you listen, Piglet, you'll hear it.\"\n\n\"How do you know I'm not listening?\"\n\nPooh couldn't answer that one, so he began to sing.\n\n    They all went off to discover the Pole,", "\n      Owl and Piglet and Rabbit and all;\n    It's a Thing you Discover, as I've been tole\n      By Owl and Piglet and Rabbit and all.\n    Eeyore, Christopher Robin and Pooh\n    And Rabbit's relations", " all went too--\n    And where the Pole was none of them knew....\n      Sing Hey! for Owl and Rabbit and all!\n\n\"Hush!\" said Christopher Robin turning round to Pooh, \"we're just coming\nto a Dangerous Pl", "ace.\"\n\n\"Hush!\" said Pooh turning round quickly to Piglet.\n\n\"Hush!\" said Piglet to Kanga.\n\n\"Hush!\" said Kanga to Owl, while Roo said \"Hush!\" several times to\nhimself very quietly.\n\n\"Hush!\" said Owl to ", "Eeyore.\n\n\"_Hush!_\" said Eeyore in a terrible voice to all Rabbit's\nfriends-and-relations, and \"Hush!\" they said hastily to each other all\ndown the line, until it got to the last one of all. And the la", "st and\nsmallest friend-and-relation was so upset to find that the whole\nExpotition was saying \"Hush!\" to _him_, that he buried himself head\ndownwards in a crack in the ground, and stayed there for two", " days until\nthe danger was over, and then went home in a great hurry, and lived\nquietly with his Aunt ever-afterwards. His name was Alexander Beetle.\n\nThey had come to a stream which twisted and tumbl", "ed between high rocky\nbanks, and Christopher Robin saw at once how dangerous it was.\n\n\"It's just the place,\" he explained, \"for an Ambush.\"\n\n\"What sort of bush?\" whispered Pooh to Piglet. \"A gorse-bus", "h?\"\n\n\"My dear Pooh,\" said Owl in his superior way, \"don't you know what an\nAmbush is?\"\n\n\"Owl,\" said Piglet, looking round at him severely, \"Pooh's whisper was a\nperfectly private whisper, and there wa", "s no need----\"\n\n\"An Ambush,\" said Owl, \"is a sort of Surprise.\"\n\n\"So is a gorse-bush sometimes,\" said Pooh.\n\n\"An Ambush, as I was about to explain to Pooh,\" said Piglet, \"is a sort\nof Surprise.\"\n\n\"If ", "people jump out at you suddenly, that's an Ambush,\" said Owl.\n\n\"It's an Ambush, Pooh, when people jump at you suddenly,\" explained\nPiglet.\n\nPooh, who now knew what an Ambush was, said that a gorse-bus", "h had sprung\nat him suddenly one day when he fell off a tree, and he had taken six\ndays to get all the prickles out of himself.\n\n\"We are not _talking_ about gorse-bushes,\" said Owl a little crossly.\n\n", "\"I am,\" said Pooh.\n\nThey were climbing very cautiously up the stream now, going from rock to\nrock, and after they had gone a little way they came to a place where\nthe banks widened out at each side, s", "o that on each side of the water\nthere was a level strip of grass on which they could sit down and rest.\nAs soon as he saw this, Christopher Robin called \"Halt!\" and they all\nsat down and rested.\n\n\"I ", "think,\" said Christopher Robin, \"that we ought to eat all our\nProvisions now, so that we shan't have so much to carry.\"\n\n\"Eat all our what?\" said Pooh.\n\n\"All that we've brought,\" said Piglet, getting ", "to work.\n\n\"That's a good idea,\" said Pooh, and he got to work too.\n\n\"Have you all got something?\" asked Christopher Robin with his mouth\nfull.\n\n\"All except me,\" said Eeyore. \"As Usual.\" He looked roun", "d at them in his\nmelancholy way. \"I suppose none of you are sitting on a thistle by any\nchance?\"\n\n\"I believe I am,\" said Pooh. \"Ow!\" He got up, and looked behind him.\n\"Yes, I was. I thought so.\"\n\n\"Tha", "nk you, Pooh. If you've quite finished with it.\" He moved across to\nPooh's place, and began to eat.\n\n\"It don't do them any Good, you know, sitting on them,\" he went on, as\nhe looked up munching. \"Take", "s all the Life out of them. Remember that\nanother time, all of you. A little Consideration, a little Thought for\nOthers, makes all the difference.\"\n\nAs soon as he had finished his lunch Christopher Ro", "bin whispered to\nRabbit, and Rabbit said \"Yes, yes, of course,\" and they walked a little\nway up the stream together.\n\n\"I didn't want the others to hear,\" said Christopher Robin.\n\n\"Quite so,\" said Rabb", "it, looking important.\n\n\"It's--I wondered--It's only--Rabbit, I suppose _you_ don't know, What\ndoes the North Pole _look_ like?\"\n\n\"Well,\" said Rabbit, stroking his whiskers. \"Now you're asking me.\"\n\n\"", "I did know once, only I've sort of forgotten,\" said Christopher Robin\ncarelessly.\n\n\"It's a funny thing,\" said Rabbit, \"but I've sort of forgotten too,\nalthough I did know _once_.\"\n\n\"I suppose it's jus", "t a pole stuck in the ground?\"\n\n\"Sure to be a pole,\" said Rabbit, \"because of calling it a pole, and if\nit's a pole, well, I should think it would be sticking in the ground,\nshouldn't you, because the", "re'd be nowhere else to stick it.\"\n\n\"Yes, that's what I thought.\"\n\n\"The only thing,\" said Rabbit, \"is, _where is it sticking_?\"\n\n\"That's what we're looking for,\" said Christopher Robin.\n\nThey went bac", "k to the others. Piglet was lying on his back, sleeping\npeacefully. Roo was washing his face and paws in the stream, while Kanga\nexplained to everybody proudly that this was the first time he had ever", "\nwashed his face himself, and Owl was telling Kanga an Interesting\nAnecdote full of long words like Encyclop√¶dia and Rhododendron to which\nKanga wasn't listening.\n\n\"I don't hold with all this washing", ",\" grumbled Eeyore. \"This modern\nBehind-the-ears nonsense. What do _you_ think, Pooh?\"\n\n\"Well,\" said Pooh, \"_I_ think----\"\n\nBut we shall never know what Pooh thought, for there came a sudden\nsqueak fr", "om Roo, a splash, and a loud cry of alarm from Kanga.\n\n\"So much for _washing_,\" said Eeyore.\n\n\"Roo's fallen in!\" cried Rabbit, and he and Christopher Robin came\nrushing down to the rescue.\n\n\"Look at m", "e swimming!\" squeaked Roo from the middle of his pool, and was\nhurried down a waterfall into the next pool.\n\n\"Are you all right, Roo dear?\" called Kanga anxiously.\n\n\"Yes!\" said Roo. \"Look at me sw----", "\" and down he went over the next\nwaterfall into another pool.\n\nEverybody was doing something to help. Piglet, wide awake suddenly, was\njumping up and down and making \"Oo, I say\" noises; Owl was explai", "ning\nthat in a case of Sudden and Temporary Immersion the Important Thing was\nto keep the Head Above Water; Kanga was jumping along the bank, saying\n\"Are you _sure_ you're all right, Roo dear?\" to whi", "ch Roo, from whatever\npool he was in at the moment, was answering \"Look at me swimming!\"\nEeyore had turned round and hung his tail over the first pool into which\nRoo fell, and with his back to the acc", "ident was grumbling quietly to\nhimself, and saying, \"All this washing; but catch on to my tail, little\nRoo, and you'll be all right\"; and, Christopher Robin and Rabbit came\nhurrying past Eeyore, and w", "ere calling out to the others in front of\nthem.\n\n\"All right, Roo, I'm coming,\" called Christopher Robin.\n\n\"Get something across the stream lower down, some of you fellows,\"\ncalled Rabbit.\n\nBut Pooh wa", "s getting something. Two pools below Roo he was standing with\na long pole in his paws, and Kanga came up and took one end of it, and\nbetween them they held it across the lower part of the pool; and Ro", "o,\nstill bubbling proudly, \"Look at me swimming,\" drifted up against it,\nand climbed out.\n\n\"Did you see me swimming?\" squeaked Roo excitedly, while Kanga scolded\nhim and rubbed him down. \"Pooh, did yo", "u see me swimming? That's called\nswimming, what I was doing. Rabbit, did you see what I was doing?\nSwimming. Hallo, Piglet! I say, Piglet! What do you think I was doing!\nSwimming! Christopher Robin, d", "id you see me----\"\n\nBut Christopher Robin wasn't listening. He was looking at Pooh.\n\n\"Pooh,\" he said, \"where did you find that pole?\"\n\nPooh looked at the pole in his hands.\n\n\"I just found it,\" he said", ". \"I thought it ought to be useful. I just\npicked it up.\"\n\n\"Pooh,\" said Christopher Robin solemnly, \"the Expedition is over. You\nhave found the North Pole!\"\n\n\"Oh!\" said Pooh.\n\nEeyore was sitting with ", "his tail in the water when they all got back to\nhim.\n\n\"Tell Roo to be quick, somebody,\" he said. \"My tail's getting cold. I\ndon't want to mention it, but I just mention it. I don't want to\ncomplain bu", "t there it is. My tail's cold.\"\n\n\"Here I am!\" squeaked Roo.\n\n\"Oh, there you are.\"\n\n\"Did you see me swimming?\"\n\nEeyore took his tail out of the water, and swished it from side to side.\n\n\"As I expected,", "\" he said. \"Lost all feeling. Numbed it. That's what it's\ndone. Numbed it. Well, as long as nobody minds, I suppose it's all\nright.\"\n\n\"Poor old Eeyore. I'll dry it for you,\" said Christopher Robin, an", "d he\ntook out his handkerchief and rubbed it up.\n\n\"Thank you, Christopher Robin. You're the only one who seems to\nunderstand about tails. They don't think--that's what the matter with\nsome of these ot", "hers. They've no imagination. A tail isn't a tail to\n_them_, it's just a Little Bit Extra at the back.\"\n\n\"Never mind, Eeyore,\" said Christopher Robin, rubbing his hardest. \"Is\n_that_ better?\"\n\n\"It's f", "eeling more like a tail perhaps. It Belongs again, if you know\nwhat I mean.\"\n\n\"Hullo, Eeyore,\" said Pooh, coming up to them with his pole.\n\n\"Hullo, Pooh. Thank you for asking, but I shall be able to u", "se it again\nin a day or two.\"\n\n\"Use what?\" said Pooh.\n\n\"What we are talking about.\"\n\n\"I wasn't talking about anything,\" said Pooh, looking puzzled.\n\n\"My mistake again. I thought you were saying how so", "rry you were about my\ntail, being all numb, and could you do anything to help?\"\n\n\"No,\" said Pooh. \"That wasn't me,\" he said. He thought for a little and\nthen suggested helpfully, \"Perhaps it was someb", "ody else.\"\n\n\"Well, thank him for me when you see him.\"\n\nPooh looked anxiously at Christopher Robin.\n\n\"Pooh's found the North Pole,\" said Christopher Robin. \"Isn't that\nlovely?\"\n\nPooh looked modestly d", "own.\n\n\"Is that it?\" said Eeyore.\n\n\"Yes,\" said Christopher Robin.\n\n\"Is that what we were looking for?\"\n\n\"Yes,\" said Pooh.\n\n\"Oh!\" said Eeyore. \"Well, anyhow--it didn't rain,\" he said.\n\nThey stuck the po", "le in the ground, and Christopher Robin tied a message\non to it.\n\n                               NORTH POLE\n\n                           DISCOVERED BY POOH\n\n                             POOH FOUND IT.\n", "\nThen they all went home again. And I think, but I am not quite sure,\nthat Roo had a hot bath and went straight to bed. But Pooh went back to\nhis own house, and feeling very proud of what he had done,", " had a little\nsomething to revive himself.\n\n\n\n\n                               CHAPTER IX\n\n                       IN WHICH PIGLET IS ENTIRELY\n                           SURROUNDED BY WATER\n\n\nIt rained ", "and it rained and it rained. Piglet told himself that never\nin all his life, and _he_ was goodness knows _how_ old--three, was it,\nor four?--never had he seen so much rain. Days and days and days.\n\n\"I", "f only,\" he thought, as he looked out of the window, \"I had been in\nPooh's house, or Christopher Robin's house, or Rabbit's house when it\nbegan to rain, then I should have had Company all this time, i", "nstead of\nbeing here all alone, with nothing to do except wonder when it will\nstop.\" And he imagined himself with Pooh, saying, \"Did you ever see such\nrain, Pooh?\" and Pooh saying, \"Isn't it _awful_, ", "Piglet?\" and Piglet\nsaying, \"I wonder how it is over Christopher Robin's way\" and Pooh\nsaying, \"I should think poor old Rabbit is about flooded out by this\ntime.\" It would have been jolly to talk like", " this, and really, it wasn't\nmuch good having anything exciting like floods, if you couldn't share\nthem with somebody.\n\nFor it was rather exciting. The little dry ditches in which Piglet had\nnosed abo", "ut so often had become streams, the little streams across which\nhe had splashed were rivers, and the river, between whose steep banks\nthey had played so happily, had sprawled out of its own bed and wa", "s\ntaking up so much room everywhere, that Piglet was beginning to wonder\nwhether it would be coming into _his_ bed soon.\n\n\"It's a little Anxious,\" he said to himself, \"to be a Very Small Animal\nEntire", "ly Surrounded by Water. Christopher Robin and Pooh could escape by\nClimbing Trees, and Kanga could escape by Jumping, and Rabbit could\nescape by Burrowing, and Owl could escape by Flying, and Eeyore c", "ould\nescape by--by Making a Loud Noise Until Rescued, and here am I,\nsurrounded by water and I can't do _anything_.\"\n\nIt went on raining, and every day the water got a little higher, until\nnow it was ", "nearly up to Piglet's window ... and still he hadn't done\nanything.\n\n\"There's Pooh,\" he thought to himself. \"Pooh hasn't much Brain, but he\nnever comes to any harm. He does silly things and they turn ", "out right.\nThere's Owl. Owl hasn't exactly got Brain, but he Knows Things. He would\nknow the Right Thing to Do when Surrounded by Water. There's Rabbit. He\nhasn't Learnt in Books, but he can always Th", "ink of a Clever Plan.\nThere's Kanga. She isn't Clever, Kanga isn't, but she would be so\nanxious about Roo that she would do a Good Thing to Do without thinking\nabout It. And then there's Eeyore. And E", "eyore is so miserable anyhow\nthat he wouldn't mind about this. But I wonder what Christopher Robin\nwould do?\"\n\nThen suddenly he remembered a story which Christopher Robin had told him\nabout a man on a", " desert island who had written something in a bottle and\nthrown it in the sea; and Piglet thought that if he wrote something in a\nbottle and threw it in the water, perhaps somebody would come and resc", "ue\n_him_!\n\nHe left the window and began to search his house, all of it that wasn't\nunder water, and at last he found a pencil and a small piece of dry\npaper, and a bottle with a cork to it. And he wro", "te on one side of the\npaper:\n\n                                 HELP!\n                              PIGLET (ME)\n\nand on the other side:\n\n                       IT'S ME PIGLET, HELP HELP.\n\nThen he put t", "he paper in the bottle, and he corked the bottle up as\ntightly as he could, and he leant out of his window as far as he could\nlean without falling in, and he threw the bottle as far as he could\nthrow-", "-_splash!_--and in a little while it bobbed up again on the water;\nand he watched it floating slowly away in the distance, until his eyes\nached with looking, and sometimes he thought it was the bottle", ", and\nsometimes he thought it was just a ripple on the water which he was\nfollowing, and then suddenly he knew that he would never see it again\nand that he had done all that he could do to save himsel", "f.\n\n\"So now,\" he thought, \"somebody else will have to do something, and I\nhope they will do it soon, because if they don't I shall have to swim,\nwhich I can't, so I hope they do it soon.\" And then he ", "gave a very long\nsigh and said, \"I wish Pooh were here. It's so much more friendly with\ntwo.\"\n\n                 *        *        *        *        *\n\nWhen the rain began Pooh was asleep. It rained, a", "nd it rained, and it\nrained, and he slept and he slept and he slept. He had had a tiring day.\nYou remember how he discovered the North Pole; well, he was so proud of\nthis that he asked Christopher Rob", "in if there were any other Poles such\nas a Bear of Little Brain might discover.\n\n\"There's a South Pole,\" said Christopher Robin, \"and I expect there's an\nEast Pole and a West Pole, though people don't", " like talking about them.\"\n\nPooh was very excited when he heard this, and suggested that they should\nhave an Expotition to discover the East Pole, but Christopher Robin had\nthought of something else t", "o do with Kanga; so Pooh went out to discover\nthe East Pole by himself. Whether he discovered it or not, I forget; but\nhe was so tired when he got home that, in the very middle of his supper,\nafter he", " had been eating for little more than half-an-hour, he fell fast\nasleep in his chair, and slept and slept and slept.\n\nThen suddenly he was dreaming. He was at the East Pole, and it was a\nvery cold pol", "e with the coldest sort of snow and ice all over it. He had\nfound a bee-hive to sleep in, but there wasn't room for his legs, so he\nhad left them outside. And Wild Woozles, such as inhabit the East Po", "le,\ncame and nibbled all the fur off his legs to make nests for their Young.\nAnd the more they nibbled, the colder his legs got, until suddenly he\nwoke up with an _Ow!_--and there he was, sitting in h", "is chair with his\nfeet in the water, and water all round him!\n\nHe splashed to his door and looked out....\n\n\"This is Serious,\" said Pooh. \"I must have an Escape.\"\n\nSo he took his largest pot of honey a", "nd escaped with it to a broad\nbranch of his tree, well above the water, and then he climbed down again\nand escaped with another pot ... and when the whole Escape was\nfinished, there was Pooh sitting o", "n his branch, dangling his legs, and\nthere, beside him, were ten pots of honey....\n\nTwo days later, there was Pooh, sitting on his branch, dangling his\nlegs, and there, beside him, were four pots of h", "oney....\n\nThree days later, there was Pooh, sitting on his branch, dangling his\nlegs, and there beside him, was one pot of honey.\n\nFour days later, there was Pooh ...\n\nAnd it was on the morning of the", " fourth day that Piglet's bottle came\nfloating past him, and with one loud cry of \"Honey!\" Pooh plunged into\nthe water, seized the bottle, and struggled back to his tree again.\n\n\"Bother!\" said Pooh, a", "s he opened it. \"All that wet for nothing. What's\nthat bit of paper doing?\"\n\nHe took it out and looked at it.\n\n\"It's a Missage,\" he said to himself, \"that's what it is. And that\nletter is a 'P,' and s", "o is that, and so is that, and 'P' means 'Pooh,'\nso it's a very important Missage to me, and I can't read it. I must find\nChristopher Robin or Owl or Piglet, one of those Clever Readers who can\nread t", "hings, and they will tell me what this missage means. Only I can't\nswim. Bother!\"\n\nThen he had an idea, and I think that for a Bear of Very Little Brain,\nit was a good idea. He said to himself:\n\n\"If a", " bottle can float, then a jar can float, and if a jar floats, I can\nsit on the top of it, if it's a very big jar.\"\n\nSo he took his biggest jar, and corked it up. \"All boats have to have a\nname,\" he sa", "id, \"so I shall call mine _The Floating Bear_.\" And with\nthese words he dropped his boat into the water and jumped in after it.\n\nFor a little while Pooh and _The Floating Bear_ were uncertain as to\nwh", "ich of them was meant to be on the top, but after trying one or two\ndifferent positions, they settled down with _The Floating Bear_\nunderneath and Pooh triumphantly astride it, paddling vigorously wit", "h\nhis feet.\n\n                 *        *        *        *        *\n\nChristopher Robin lived at the very top of the Forest. It rained, and it\nrained, and it rained, but the water couldn't come up to _", "his_ house. It\nwas rather jolly to look down into the valleys and see the water all\nround him, but it rained so hard that he stayed indoors most of the\ntime, and thought about things. Every morning he", " went out with his\numbrella and put a stick in the place where the water came up to, and\nevery next morning he went out and couldn't see his stick any more, so\nhe put another stick in the place where ", "the water came up to, and then\nhe walked home again, and each morning he had a shorter way to walk than\nhe had had the morning before. On the morning of the fifth day he saw\nthe water all round him, a", "nd knew that for the first time in his life he\nwas on a real island. Which was very exciting.\n\nIt was on this morning that Owl came flying over the water to say \"How\ndo you do,\" to his friend Christop", "her Robin.\n\n\"I say, Owl,\" said Christopher Robin, \"isn't this fun? I'm on an\nisland!\"\n\n\"The atmospheric conditions have been very unfavourable lately,\" said\nOwl.\n\n\"The what?\"\n\n\"It has been raining,\" e", "xplained Owl.\n\n\"Yes,\" said Christopher Robin. \"It has.\"\n\n\"The flood-level has reached an unprecedented height.\"\n\n\"The who?\"\n\n\"There's a lot of water about,\" explained Owl.\n\n\"Yes,\" said Christopher Rob", "in, \"there is.\"\n\n\"However, the prospects are rapidly becoming more favourable. At any\nmoment----\"\n\n\"Have you seen Pooh?\"\n\n\"No. At any moment----\"\n\n\"I hope he's all right,\" said Christopher Robin. \"I'v", "e been wondering\nabout him. I expect Piglet's with him. Do you think they're all right,\nOwl?\"\n\n\"I expect so. You see, at any moment----\"\n\n\"Do go and see, Owl. Because Pooh hasn't got very much brain, ", "and he\nmight do something silly, and I do love him so, Owl. Do you see, Owl?\"\n\n\"That's all right,\" said Owl. \"I'll go. Back directly.\" And he flew off.\n\nIn a little while he was back again.\n\n\"Pooh isn", "'t there,\" he said.\n\n\"Not there?\"\n\n\"Has _been_ there. He's been sitting on a branch of his tree outside his\nhouse with nine pots of honey. But he isn't there now.\"\n\n\"Oh, Pooh!\" cried Christopher Robin", ". \"Where _are_ you?\"\n\n\"Here I am,\" said a growly voice behind him.\n\n\"Pooh!\"\n\nThey rushed into each other's arms.\n\n\"How did you get here, Pooh?\" asked Christopher Robin, when he was ready\nto talk again", ".\n\n\"On my boat,\" said Pooh proudly. \"I had a Very Important Missage sent me\nin a bottle, and owing to having got some water in my eyes, I couldn't\nread it, so I brought it to you. On my boat.\"\n\nWith t", "hese proud words he gave Christopher Robin the missage.\n\n\"But it's from Piglet!\" cried Christopher Robin when he had read it.\n\n\"Isn't there anything about Pooh in it?\" asked Bear, looking over his\nsho", "ulder.\n\nChristopher Robin read the message aloud.\n\n\"Oh, are those 'P's' piglets? I thought they were poohs.\"\n\n\"We must rescue him at once! I thought he was with _you_, Pooh. Owl,\ncould you rescue him ", "on your back?\"\n\n\"I don't think so,\" said Owl, after grave thought. \"It is doubtful if\nthe necessary dorsal muscles----\"\n\n\"Then would you fly to him at _once_ and say that Rescue is Coming? And\nPooh an", "d I will think of a Rescue and come as quick as ever we can. Oh,\ndon't _talk_, Owl, go on quick!\" And, still thinking of something to\nsay, Owl flew off.\n\n\"Now then, Pooh,\" said Christopher Robin, \"whe", "re's your boat?\"\n\n\"I ought to say,\" explained Pooh as they walked down to the shore of the\nisland, \"that it isn't just an ordinary sort of boat. Sometimes it's a\nBoat, and sometimes it's more of an Ac", "cident. It all depends.\"\n\n\"Depends on what?\"\n\n\"On whether I'm on the top of it or underneath it.\"\n\n\"Oh! Well, where is it?\"\n\n\"There!\" said Pooh, pointing proudly to _The Floating Bear_.\n\nIt wasn't wha", "t Christopher Robin expected, and the more he looked at it,\nthe more he thought what a Brave and Clever Bear Pooh was, and the more\nChristopher Robin thought this, the more Pooh looked modestly down h", "is\nnose and tried to pretend he wasn't.\n\n\"But it's too small for two of us,\" said Christopher Robin sadly.\n\n\"Three of us with Piglet.\"\n\n\"That makes it smaller still. Oh, Pooh Bear, what shall we do?\"\n", "\nAnd then this Bear, Pooh Bear, Winnie-the-Pooh, F.O.P. (Friend of\nPiglet's), R.C. (Rabbit's Companion), P.D. (Pole Discoverer), E.C. and\nT.F. (Eeyore's Comforter and Tail-finder)--in fact, Pooh himse", "lf--said\nsomething so clever that Christopher Robin could only look at him with\nmouth open and eyes staring, wondering if this was really the Bear of\nVery Little Brain whom he had known and loved so l", "ong.\n\n\"We might go in your umbrella,\" said Pooh.\n\n\"?\"\n\n\"We might go in your umbrella,\" said Pooh.\n\n\"? ?\"\n\n\"We might go in your umbrella,\" said Pooh.\n\n\"!!!!!!\"\n\nFor suddenly Christopher Robin saw that ", "they might. He opened his\numbrella and put it point downwards in the water. It floated but\nwobbled. Pooh got in. He was just beginning to say that it was all right\nnow, when he found that it wasn't, s", "o after a short drink which he\ndidn't really want he waded back to Christopher Robin. Then they both\ngot in together, and it wobbled no longer.\n\n\"I shall call this boat _The Brain of Pooh_,\" said Chri", "stopher Robin,\nand _The Brain of Pooh_ set sail forthwith in a south-westerly\ndirection, revolving gracefully.\n\nYou can imagine Piglet's joy when at last the ship came in sight of him.\nIn after-years ", "he liked to think that he had been in Very Great Danger\nduring the Terrible Flood, but the only danger he had really been in was\nin the last half-hour of his imprisonment, when Owl, who had just flown", "\nup, sat on a branch of his tree to comfort him, and told him a very long\nstory about an aunt who had once laid a seagull's egg by mistake, and\nthe story went on and on, rather like this sentence, unt", "il Piglet who\nwas listening out of his window without much hope, went to sleep quietly\nand naturally, slipping slowly out of the window towards the water until\nhe was only hanging on by his toes, at w", "hich moment luckily, a sudden\nloud squawk from Owl, which was really part of the story, being what his\naunt said, woke the Piglet up and just gave him time to jerk himself\nback into safety and say, \"H", "ow interesting, and did she?\" when--well,\nyou can imagine his joy when at last he saw the good ship, _Brain of\nPooh_ (_Captain_, C. Robin; _1st Mate_, P. Bear) coming over the sea to\nrescue him. Chris", "topher Robin and Pooh again....\n\nAnd that is really the end of the story, and I am very tired after that\nlast sentence, I think I shall stop there.\n\n\n\n\n                               CHAPTER X\n\n      ", "              IN WHICH CHRISTOPHER ROBIN GIVES\n                    POOH A PARTY, AND WE SAY GOOD-BYE\n\n\nOne day when the sun had come back over the Forest, bringing with it\nthe scent of may, and all th", "e streams of the Forest were tinkling\nhappily to find themselves their own pretty shape again, and the little\npools lay dreaming of the life they had seen and the big things they had\ndone, and in the ", "warmth and quiet of the Forest the cuckoo was trying\nover his voice carefully and listening to see if he liked it, and\nwood-pigeons were complaining gently to themselves in their lazy\ncomfortable way ", "that it was the other fellow's fault, but it didn't\nmatter very much; on such a day as this Christopher Robin whistled in a\nspecial way he had, and Owl came flying out of the Hundred Acre Wood to\nsee ", "what was wanted.\n\n\"Owl,\" said Christopher Robin, \"I am going to give a party.\"\n\n\"You are, are you?\" said Owl.\n\n\"And it's to be a special sort of party, because it's because of what\nPooh did when he di", "d what he did to save Piglet from the flood.\"\n\n\"Oh, that's what it's for, is it?\" said Owl.\n\n\"Yes, so will you tell Pooh as quickly as you can, and all the others,\nbecause it will be to-morrow.\"\n\n\"Oh,", " it will, will it?\" said Owl, still being as helpful as possible.\n\n\"So will you go and tell them, Owl?\"\n\nOwl tried to think of something very wise to say, but couldn't, so he\nflew off to tell the othe", "rs. And the first person he told was Pooh.\n\n\"Pooh,\" he said, \"Christopher Robin is giving a party.\"\n\n\"Oh!\" said Pooh. And then seeing that Owl expected him to say something\nelse, he said \"Will there b", "e those little cake things with pink sugar\nicing?\"\n\nOwl felt that it was rather beneath him to talk about little cake things\nwith pink sugar icing, so he told Pooh exactly what Christopher Robin\nhad s", "aid, and flew off to Eeyore.\n\n\"A party for Me?\" thought Pooh to himself. \"How grand!\" And he began to\nwonder if all the other animals would know that it was a special Pooh\nParty, and if Christopher Ro", "bin had told them about _The Floating Bear_\nand the _Brain of Pooh_ and all the wonderful ships he had invented and\nsailed on, and he began to think how awful it would be if everybody had\nforgotten ab", "out it, and nobody quite knew what the party was for; and\nthe more he thought like this, the more the party got muddled in his\nmind, like a dream when nothing goes right. And the dream began to sing\ni", "tself over in his head until it became a sort of song. It was an\n\n                           ANXIOUS POOH SONG.\n\n    3 Cheers for Pooh!\n    (_For Who?_)\n    For Pooh--\n    (_Why what did he do?_)\n    ", "I thought you knew;\n    He saved his friend from a wetting!\n    3 Cheers for Bear!\n    (_For where?_)\n    For Bear--\n    He couldn't swim,\n    But he rescued him!\n    (_He rescued who?_)\n    Oh, liste", "n, do!\n    I am talking of Pooh--\n    (_Of who?_)\n    Of Pooh!\n    (_I'm sorry I keep forgetting_).\n    Well, Pooh was a Bear of Enormous Brain\n    (_Just say it again!_)\n    Of enormous brain--\n    (", "_Of enormous what?_)\n    Well, he ate a lot,\n    And I don't know if he could swim or not,\n    But he managed to float\n    On a sort of boat\n    (_On a sort of what?_)\n    Well, a sort of pot--\n    So", " now let's give him three hearty cheers\n    (_So now let's give him three hearty whiches?_)\n    And hope he'll be with us for years and years,\n    And grow in health and wisdom and riches!\n    3 Cheer", "s for Pooh!\n    (_For who?_)\n    For Pooh--\n    3 Cheers for Bear!\n    (_For where?_)\n    For Bear--\n    3 Cheers for the wonderful Winnie-the-Pooh!\n    (_Just tell me, somebody_--WHAT DID HE DO?)\n\nWh", "ile this was going on inside him, Owl was talking to Eeyore.\n\n\"Eeyore,\" said Owl, \"Christopher Robin is giving a party.\"\n\n\"Very interesting,\" said Eeyore. \"I suppose they will be sending me down\nthe o", "dd bits which got trodden on. Kind and Thoughtful. Not at all,\ndon't mention it.\"\n\n\"There is an Invitation for you.\"\n\n\"What's that like?\"\n\n\"An Invitation!\"\n\n\"Yes, I heard you. Who dropped it?\"\n\n\"This ", "isn't anything to eat, it's asking you to the party. To-morrow.\"\n\nEeyore shook his head slowly.\n\n\"You mean Piglet. The little fellow with the excited ears. That's\nPiglet. I'll tell him.\"\n\n\"No, no!\" sa", "id Owl, getting quite fussy. \"It's you!\"\n\n\"Are you sure?\"\n\n\"Of course I'm sure. Christopher Robin said 'All of them! Tell all of\nthem.'\"\n\n\"All of them, except Eeyore?\"\n\n\"All of them,\" said Owl sulkily", ".\n\n\"Ah!\" said Eeyore. \"A mistake, no doubt, but still, I shall come. Only\ndon't blame _me_ if it rains.\"\n\nBut it didn't rain. Christopher Robin had made a long table out of some\nlong pieces of wood, a", "nd they all sat round it. Christopher Robin sat at\none end, and Pooh sat at the other, and between them on one side were\nOwl and Eeyore and Piglet, and between them on the other side were\nRabbit, and ", "Roo and Kanga. And all Rabbit's friends and relations spread\nthemselves about on the grass, and waited hopefully in case anybody\nspoke to them, or dropped anything, or asked them the time.\n\nIt was the", " first party to which Roo had ever been, and he was very\nexcited. As soon as ever they had sat down he began to talk.\n\n\"Hallo, Pooh!\" he squeaked.\n\n\"Hallo, Roo!\" said Pooh.\n\nRoo jumped up and down in ", "his seat for a little while and then began\nagain.\n\n\"Hallo, Piglet!\" he squeaked.\n\nPiglet waved a paw at him, being too busy to say anything.\n\n\"Hallo, Eeyore!\" said Roo.\n\nEeyore nodded gloomily at him.", " \"It will rain soon, you see if it\ndoesn't,\" he said.\n\nRoo looked to see if it didn't, and it didn't, so he said \"Hallo,\nOwl!\"--and Owl said \"Hallo, my little fellow,\" in a kindly way, and went\non tel", "ling Christopher Robin about an accident which had nearly happened\nto a friend of his whom Christopher Robin didn't know, and Kanga said to\nRoo, \"Drink up your milk first, dear, and talk afterwards.\" ", "So Roo, who\nwas drinking his milk, tried to say that he could do both at once ...\nand had to be patted on the back and dried for quite a long time\nafterwards.\n\nWhen they had all nearly eaten enough, C", "hristopher Robin banged on the\ntable with his spoon, and everybody stopped talking and was very silent,\nexcept Roo who was just finishing a loud attack of hiccups and trying to\nlook as if it was one o", "f Rabbit's relations.\n\n\"This party,\" said Christopher Robin, \"is a party because of what\nsomeone did, and we all know who it was, and it's his party, because of\nwhat he did, and I've got a present for", " him and here it is.\" Then he\nfelt about a little and whispered, \"Where is it?\"\n\nWhile he was looking, Eeyore coughed in an impressive way and began to\nspeak.\n\n\"Friends,\" he said, \"including oddments,", " it is a great pleasure, or\nperhaps I had better say it has been a pleasure so far, to see you at my\nparty. What I did was nothing. Any of you--except Rabbit and Owl and\nKanga--would have done the sam", "e. Oh, and Pooh. My remarks do not, of\ncourse, apply to Piglet and Roo, because they are too small. Any of you\nwould have done the same. But it just happened to be Me. It was not, I\nneed hardly say, w", "ith an idea of getting what Christopher Robin is\nlooking for now\"--and he put his front leg to his mouth and said in a\nloud whisper, \"Try under the table\"--\"that I did what I did--but because\nI feel t", "hat we should all do what we can to help. I feel that we should\nall----\"\n\n\"H--hup!\" said Roo accidentally.\n\n\"Roo, dear!\" said Kanga reproachfully.\n\n\"Was it me?\" asked Roo, a little surprised.\n\n\"What's", " Eeyore talking about?\" Piglet whispered to Pooh.\n\n\"I don't know,\" said Pooh rather dolefully.\n\n\"I thought this was _your_ party.\"\n\n\"I thought it was _once_. But I suppose it isn't.\"\n\n\"I'd sooner it w", "as yours than Eeyore's,\" said Piglet.\n\n\"So would I,\" said Pooh.\n\n\"H--hup!\" said Roo again.\n\n\"AS--I--WAS--SAYING,\" said Eeyore loudly and sternly, \"as I was saying\nwhen I was interrupted by various Lou", "d Sounds, I feel that----\"\n\n\"Here it is!\" cried Christopher Robin excitedly. \"Pass it down to silly\nold Pooh. It's for Pooh.\"\n\n\"For Pooh?\" said Eeyore.\n\n\"Of course it is. The best bear in all the worl", "d.\"\n\n\"I might have known,\" said Eeyore. \"After all, one can't complain. I\nhave my friends. Somebody spoke to me only yesterday. And was it last\nweek or the week before that Rabbit bumped into me and s", "aid 'Bother!'\nThe Social Round. Always something going on.\"\n\nNobody was listening, for they were all saying \"Open it, Pooh,\" \"What is\nit, Pooh?\" \"I know what it is,\" \"No, you don't\" and other helpful\n", "remarks of this sort. And of course Pooh was opening it as quickly as\never he could, but without cutting the string, because you never know\nwhen a bit of string might be Useful. At last it was undone.", "\n\nWhen Pooh saw what it was, he nearly fell down, he was so pleased. It\nwas a Special Pencil Case. There were pencils in it marked \"B\" for Bear,\nand pencils marked \"HB\" for Helping Bear, and pencils m", "arked \"BB\" for\nBrave Bear. There was a knife for sharpening the pencils, and\nindia-rubber for rubbing out anything which you had spelt wrong, and a\nruler for ruling lines for the words to walk on, and", " inches marked on\nthe ruler in case you wanted to know how many inches anything was, and\nBlue Pencils and Red Pencils and Green Pencils for saying special things\nin blue and red and green. And all the", "se lovely things were in little\npockets of their own in a Special Case which shut with a click when you\nclicked it. And they were all for Pooh.\n\n\"Oh!\" said Pooh.\n\n\"Oh, Pooh!\" said everybody else excep", "t Eeyore.\n\n\"Thank-you,\" growled Pooh.\n\nBut Eeyore was saying to himself, \"This writing business. Pencils and\nwhat-not. Over-rated, if you ask me. Silly stuff. Nothing in it.\"\n\nLater on, when they had ", "all said \"Good-bye\" and \"Thank-you\" to\nChristopher Robin, Pooh and Piglet walked home thoughtfully together in\nthe golden evening, and for a long time they were silent.\n\n\"When you wake up in the morni", "ng, Pooh,\" said Piglet at last, \"what's\nthe first thing you say to yourself?\"\n\n\"What's for breakfast?\" said Pooh. \"What do _you_ say, Piglet?\"\n\n\"I say, I wonder what's going to happen exciting _to-day", "_?\" said Piglet.\n\nPooh nodded thoughtfully.\n\n\"It's the same thing,\" he said.\n\n                 *        *        *        *        *\n\n\"And what did happen?\" asked Christopher Robin.\n\n\"When?\"\n\n\"Next mo", "rning.\"\n\n\"I don't know.\"\n\n\"Could you think and tell me and Pooh some time?\"\n\n\"If you wanted it very much.\"\n\n\"Pooh does,\" said Christopher Robin.\n\nHe gave a deep sigh, picked his bear up by the leg and", " walked off to the\ndoor, trailing Winnie-the-Pooh behind him. At the door he turned and\nsaid \"Coming to see me have my bath?\"\n\n\"I might,\" I said.\n\n\"Was Pooh's pencil case any better than mine?\"\n\n\"It w", "as just the same,\" I said.\n\nHe nodded and went out ... and in a moment I heard\nWinnie-the-Pooh--_bump, bump, bump_--going up the stairs behind him.\n\n\n\n\n                           Printed in Canada\n   ", "                by Warwick Bros. & Rutter, Limited\n                        Printers and Bookbinders\n                                Toronto\n\n\n\n\n[Transcriber's Note: Near the end of Chapter VI, the ref", "erence to\nKanga was modified to read \"...and every Tuesday Kanga spent the day\nwith her great friend Pooh ...\"]\n\n\n\n\n\n*** END OF THE PROJECT GUTENBERG EBOOK WINNIE-THE-POOH ***\n\n\n    \n\nUpdated editions", " will replace the previous one—the old editions will\nbe renamed.\n\nCreating the works from print editions not protected by U.S. copyright\nlaw means that no one owns a United States copyright in these w", "orks,\nso the Foundation (and you!) can copy and distribute it in the United\nStates without permission and without paying copyright\nroyalties. Special rules, set forth in the General Terms of Use part\n", "of this license, apply to copying and distributing Project\nGutenberg™ electronic works to protect the PROJECT GUTENBERG™\nconcept and trademark. Project Gutenberg is a registered trademark,\nand may not", " be used if you charge for an eBook, except by following\nthe terms of the trademark license, including paying royalties for use\nof the Project Gutenberg trademark. If you do not charge anything for\nco", "pies of this eBook, complying with the trademark license is very\neasy. You may use this eBook for nearly any purpose such as creation\nof derivative works, reports, performances and research. Project\nG", "utenberg eBooks may be modified and printed and given away—you may\ndo practically ANYTHING in the United States with eBooks not protected\nby U.S. copyright law. Redistribution is subject to the tradem", "ark\nlicense, especially commercial redistribution.\n\n\nSTART: FULL LICENSE\n\nTHE FULL PROJECT GUTENBERG LICENSE\n\nPLEASE READ THIS BEFORE YOU DISTRIBUTE OR USE THIS WORK\n\nTo protect the Project Gutenberg™", " mission of promoting the free\ndistribution of electronic works, by using or distributing this work\n(or any other work associated in any way with the phrase “Project\nGutenberg”), you agree to comply w", "ith all the terms of the Full\nProject Gutenberg™ License available with this file or online at\nwww.gutenberg.org/license.\n\nSection 1. General Terms of Use and Redistributing Project Gutenberg™\nelectro", "nic works\n\n1.A. By reading or using any part of this Project Gutenberg™\nelectronic work, you indicate that you have read, understand, agree to\nand accept all the terms of this license and intellectual", " property\n(trademark/copyright) agreement. If you do not agree to abide by all\nthe terms of this agreement, you must cease using and return or\ndestroy all copies of Project Gutenberg™ electronic works", " in your\npossession. If you paid a fee for obtaining a copy of or access to a\nProject Gutenberg™ electronic work and you do not agree to be bound\nby the terms of this agreement, you may obtain a refun", "d from the person\nor entity to whom you paid the fee as set forth in paragraph 1.E.8.\n\n1.B. “Project Gutenberg” is a registered trademark. It may only be\nused on or associated in any way with an elect", "ronic work by people who\nagree to be bound by the terms of this agreement. There are a few\nthings that you can do with most Project Gutenberg™ electronic works\neven without complying with the full ter", "ms of this agreement. See\nparagraph 1.C below. There are a lot of things you can do with Project\nGutenberg™ electronic works if you follow the terms of this\nagreement and help preserve free future acc", "ess to Project Gutenberg™\nelectronic works. See paragraph 1.E below.\n\n1.C. The Project Gutenberg Literary Archive Foundation (“the\nFoundation” or PGLAF), owns a compilation copyright in the collection", "\nof Project Gutenberg™ electronic works. Nearly all the individual\nworks in the collection are in the public domain in the United\nStates. If an individual work is unprotected by copyright law in the\nU", "nited States and you are located in the United States, we do not\nclaim a right to prevent you from copying, distributing, performing,\ndisplaying or creating derivative works based on the work as long ", "as\nall references to Project Gutenberg are removed. Of course, we hope\nthat you will support the Project Gutenberg™ mission of promoting\nfree access to electronic works by freely sharing Project Guten", "berg™\nworks in compliance with the terms of this agreement for keeping the\nProject Gutenberg™ name associated with the work. You can easily\ncomply with the terms of this agreement by keeping this work", " in the\nsame format with its attached full Project Gutenberg™ License when\nyou share it without charge with others.\n\n1.D. The copyright laws of the place where you are located also govern\nwhat you can", " do with this work. Copyright laws in most countries are\nin a constant state of change. If you are outside the United States,\ncheck the laws of your country in addition to the terms of this\nagreement ", "before downloading, copying, displaying, performing,\ndistributing or creating derivative works based on this work or any\nother Project Gutenberg™ work. The Foundation makes no\nrepresentations concerni", "ng the copyright status of any work in any\ncountry other than the United States.\n\n1.E. Unless you have removed all references to Project Gutenberg:\n\n1.E.1. The following sentence, with active links to", ", or other\nimmediate access to, the full Project Gutenberg™ License must appear\nprominently whenever any copy of a Project Gutenberg™ work (any work\non which the phrase “Project Gutenberg” appears, or", " with which the\nphrase “Project Gutenberg” is associated) is accessed, displayed,\nperformed, viewed, copied or distributed:\n\n    This eBook is for the use of anyone anywhere in the United States and m", "ost\n    other parts of the world at no cost and with almost no restrictions\n    whatsoever. You may copy it, give it away or re-use it under the terms\n    of the Project Gutenberg License included wit", "h this eBook or online\n    at www.gutenberg.org. If you\n    are not located in the United States, you will have to check the laws\n    of the country where you are located before using this eBook.\n  \n1", ".E.2. If an individual Project Gutenberg™ electronic work is\nderived from texts not protected by U.S. copyright law (does not\ncontain a notice indicating that it is posted with permission of the\ncopyr", "ight holder), the work can be copied and distributed to anyone in\nthe United States without paying any fees or charges. If you are\nredistributing or providing access to a work with the phrase “Project", "\nGutenberg” associated with or appearing on the work, you must comply\neither with the requirements of paragraphs 1.E.1 through 1.E.7 or\nobtain permission for the use of the work and the Project Gutenb", "erg™\ntrademark as set forth in paragraphs 1.E.8 or 1.E.9.\n\n1.E.3. If an individual Project Gutenberg™ electronic work is posted\nwith the permission of the copyright holder, your use and distribution\nm", "ust comply with both paragraphs 1.E.1 through 1.E.7 and any\nadditional terms imposed by the copyright holder. Additional terms\nwill be linked to the Project Gutenberg™ License for all works\nposted wit", "h the permission of the copyright holder found at the\nbeginning of this work.\n\n1.E.4. Do not unlink or detach or remove the full Project Gutenberg™\nLicense terms from this work, or any files containin", "g a part of this\nwork or any other work associated with Project Gutenberg™.\n\n1.E.5. Do not copy, display, perform, distribute or redistribute this\nelectronic work, or any part of this electronic work,", " without\nprominently displaying the sentence set forth in paragraph 1.E.1 with\nactive links or immediate access to the full terms of the Project\nGutenberg™ License.\n\n1.E.6. You may convert to and dist", "ribute this work in any binary,\ncompressed, marked up, nonproprietary or proprietary form, including\nany word processing or hypertext form. However, if you provide access\nto or distribute copies of a ", "Project Gutenberg™ work in a format\nother than “Plain Vanilla ASCII” or other format used in the official\nversion posted on the official Project Gutenberg™ website\n(www.gutenberg.org), you must, at no", " additional cost, fee or expense\nto the user, provide a copy, a means of exporting a copy, or a means\nof obtaining a copy upon request, of the work in its original “Plain\nVanilla ASCII” or other form.", " Any alternate format must include the\nfull Project Gutenberg™ License as specified in paragraph 1.E.1.\n\n1.E.7. Do not charge a fee for access to, viewing, displaying,\nperforming, copying or distribut", "ing any Project Gutenberg™ works\nunless you comply with paragraph 1.E.8 or 1.E.9.\n\n1.E.8. You may charge a reasonable fee for copies of or providing\naccess to or distributing Project Gutenberg™ electr", "onic works\nprovided that:\n\n    • You pay a royalty fee of 20% of the gross profits you derive from\n        the use of Project Gutenberg™ works calculated using the method\n        you already use to ca", "lculate your applicable taxes. The fee is owed\n        to the owner of the Project Gutenberg™ trademark, but he has\n        agreed to donate royalties under this paragraph to the Project\n        Guten", "berg Literary Archive Foundation. Royalty payments must be paid\n        within 60 days following each date on which you prepare (or are\n        legally required to prepare) your periodic tax returns. ", "Royalty\n        payments should be clearly marked as such and sent to the Project\n        Gutenberg Literary Archive Foundation at the address specified in\n        Section 4, “Information about donati", "ons to the Project Gutenberg\n        Literary Archive Foundation.”\n    \n    • You provide a full refund of any money paid by a user who notifies\n        you in writing (or by e-mail) within 30 days of", " receipt that s/he\n        does not agree to the terms of the full Project Gutenberg™\n        License. You must require such a user to return or destroy all\n        copies of the works possessed in a ", "physical medium and discontinue\n        all use of and all access to other copies of Project Gutenberg™\n        works.\n    \n    • You provide, in accordance with paragraph 1.F.3, a full refund of\n    ", "    any money paid for a work or a replacement copy, if a defect in the\n        electronic work is discovered and reported to you within 90 days of\n        receipt of the work.\n    \n    • You comply w", "ith all other terms of this agreement for free\n        distribution of Project Gutenberg™ works.\n    \n\n1.E.9. If you wish to charge a fee or distribute a Project\nGutenberg™ electronic work or group of", " works on different terms than\nare set forth in this agreement, you must obtain permission in writing\nfrom the Project Gutenberg Literary Archive Foundation, the manager of\nthe Project Gutenberg™ trad", "emark. Contact the Foundation as set\nforth in Section 3 below.\n\n1.F.\n\n1.F.1. Project Gutenberg volunteers and employees expend considerable\neffort to identify, do copyright research on, transcribe and", " proofread\nworks not protected by U.S. copyright law in creating the Project\nGutenberg™ collection. Despite these efforts, Project Gutenberg™\nelectronic works, and the medium on which they may be stor", "ed, may\ncontain “Defects,” such as, but not limited to, incomplete, inaccurate\nor corrupt data, transcription errors, a copyright or other\nintellectual property infringement, a defective or damaged di", "sk or\nother medium, a computer virus, or computer codes that damage or\ncannot be read by your equipment.\n\n1.F.2. LIMITED WARRANTY, DISCLAIMER OF DAMAGES - Except for the “Right\nof Replacement or Refun", "d” described in paragraph 1.F.3, the Project\nGutenberg Literary Archive Foundation, the owner of the Project\nGutenberg™ trademark, and any other party distributing a Project\nGutenberg™ electronic work", " under this agreement, disclaim all\nliability to you for damages, costs and expenses, including legal\nfees. YOU AGREE THAT YOU HAVE NO REMEDIES FOR NEGLIGENCE, STRICT\nLIABILITY, BREACH OF WARRANTY OR ", "BREACH OF CONTRACT EXCEPT THOSE\nPROVIDED IN PARAGRAPH 1.F.3. YOU AGREE THAT THE FOUNDATION, THE\nTRADEMARK OWNER, AND ANY DISTRIBUTOR UNDER THIS AGREEMENT WILL NOT BE\nLIABLE TO YOU FOR ACTUAL, DIRECT, ", "INDIRECT, CONSEQUENTIAL, PUNITIVE OR\nINCIDENTAL DAMAGES EVEN IF YOU GIVE NOTICE OF THE POSSIBILITY OF SUCH\nDAMAGE.\n\n1.F.3. LIMITED RIGHT OF REPLACEMENT OR REFUND - If you discover a\ndefect in this ele", "ctronic work within 90 days of receiving it, you can\nreceive a refund of the money (if any) you paid for it by sending a\nwritten explanation to the person you received the work from. If you\nreceived t", "he work on a physical medium, you must return the medium\nwith your written explanation. The person or entity that provided you\nwith the defective work may elect to provide a replacement copy in\nlieu o", "f a refund. If you received the work electronically, the person\nor entity providing it to you may choose to give you a second\nopportunity to receive the work electronically in lieu of a refund. If\nthe", " second copy is also defective, you may demand a refund in writing\nwithout further opportunities to fix the problem.\n\n1.F.4. Except for the limited right of replacement or refund set forth\nin paragrap", "h 1.F.3, this work is provided to you ‘AS-IS’, WITH NO\nOTHER WARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT\nLIMITED TO WARRANTIES OF MERCHANTABILITY OR FITNESS FOR ANY PURPOSE.\n\n1.F.5. ", "Some states do not allow disclaimers of certain implied\nwarranties or the exclusion or limitation of certain types of\ndamages. If any disclaimer or limitation set forth in this agreement\nviolates the ", "law of the state applicable to this agreement, the\nagreement shall be interpreted to make the maximum disclaimer or\nlimitation permitted by the applicable state law. The invalidity or\nunenforceability", " of any provision of this agreement shall not void the\nremaining provisions.\n\n1.F.6. INDEMNITY - You agree to indemnify and hold the Foundation, the\ntrademark owner, any agent or employee of the Found", "ation, anyone\nproviding copies of Project Gutenberg™ electronic works in\naccordance with this agreement, and any volunteers associated with the\nproduction, promotion and distribution of Project Gutenb", "erg™\nelectronic works, harmless from all liability, costs and expenses,\nincluding legal fees, that arise directly or indirectly from any of\nthe following which you do or cause to occur: (a) distributi", "on of this\nor any Project Gutenberg™ work, (b) alteration, modification, or\nadditions or deletions to any Project Gutenberg™ work, and (c) any\nDefect you cause.\n\nSection 2. Information about the Missi", "on of Project Gutenberg™\n\nProject Gutenberg™ is synonymous with the free distribution of\nelectronic works in formats readable by the widest variety of\ncomputers including obsolete, old, middle-aged an", "d new computers. It\nexists because of the efforts of hundreds of volunteers and donations\nfrom people in all walks of life.\n\nVolunteers and financial support to provide volunteers with the\nassistance ", "they need are critical to reaching Project Gutenberg™’s\ngoals and ensuring that the Project Gutenberg™ collection will\nremain freely available for generations to come. In 2001, the Project\nGutenberg L", "iterary Archive Foundation was created to provide a secure\nand permanent future for Project Gutenberg™ and future\ngenerations. To learn more about the Project Gutenberg Literary\nArchive Foundation and", " how your efforts and donations can help, see\nSections 3 and 4 and the Foundation information page at www.gutenberg.org.\n\nSection 3. Information about the Project Gutenberg Literary Archive Foundation", "\n\nThe Project Gutenberg Literary Archive Foundation is a non-profit\n501(c)(3) educational corporation organized under the laws of the\nstate of Mississippi and granted tax exempt status by the Internal", "\nRevenue Service. The Foundation’s EIN or federal tax identification\nnumber is 64-6221541. Contributions to the Project Gutenberg Literary\nArchive Foundation are tax deductible to the full extent perm", "itted by\nU.S. federal laws and your state’s laws.\n\nThe Foundation’s business office is located at 809 North 1500 West,\nSalt Lake City, UT 84116, (801) 596-1887. Email contact links and up\nto date cont", "act information can be found at the Foundation’s website\nand official page at www.gutenberg.org/contact\n\nSection 4. Information about Donations to the Project Gutenberg\nLiterary Archive Foundation\n\nPr", "oject Gutenberg™ depends upon and cannot survive without widespread\npublic support and donations to carry out its mission of\nincreasing the number of public domain and licensed works that can be\nfreel", "y distributed in machine-readable form accessible by the widest\narray of equipment including outdated equipment. Many small donations\n($1 to $5,000) are particularly important to maintaining tax exemp", "t\nstatus with the IRS.\n\nThe Foundation is committed to complying with the laws regulating\ncharities and charitable donations in all 50 states of the United\nStates. Compliance requirements are not unif", "orm and it takes a\nconsiderable effort, much paperwork and many fees to meet and keep up\nwith these requirements. We do not solicit donations in locations\nwhere we have not received written confirmati", "on of compliance. To SEND\nDONATIONS or determine the status of compliance for any particular state\nvisit www.gutenberg.org/donate.\n\nWhile we cannot and do not solicit contributions from states where w", "e\nhave not met the solicitation requirements, we know of no prohibition\nagainst accepting unsolicited donations from donors in such states who\napproach us with offers to donate.\n\nInternational donatio", "ns are gratefully accepted, but we cannot make\nany statements concerning tax treatment of donations received from\noutside the United States. U.S. laws alone swamp our small staff.\n\nPlease check the Pr", "oject Gutenberg web pages for current donation\nmethods and addresses. Donations are accepted in a number of other\nways including checks, online payments and credit card donations. To\ndonate, please vi", "sit: www.gutenberg.org/donate.\n\nSection 5. General Information About Project Gutenberg™ electronic works\n\nProfessor Michael S. Hart was the originator of the Project\nGutenberg™ concept of a library of", " electronic works that could be\nfreely shared with anyone. For forty years, he produced and\ndistributed Project Gutenberg™ eBooks with only a loose network of\nvolunteer support.\n\nProject Gutenberg™ eB", "ooks are often created from several printed\neditions, all of which are confirmed as not protected by copyright in\nthe U.S. unless a copyright notice is included. Thus, we do not\nnecessarily keep eBook", "s in compliance with any particular paper\nedition.\n\nMost people start at our website which has the main PG search\nfacility: www.gutenberg.org.\n\nThis website includes information about Project Gutenber", "g™,\nincluding how to make donations to the Project Gutenberg Literary\nArchive Foundation, how to help produce our new eBooks, and how to\nsubscribe to our email newsletter to hear about new eBooks.\n\n\n"]