[
  {
    "text": "But in reality, its a cheap looking smooth and slippery plastic back body.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Disappointed  with Battery  performance  my brother  realme 2 giving easily 2days battery  backup with 4250mah, but this phone is horrible in battery  backup  only  24 hours  with 7000.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "I am not happy overall performance of this phone at this price band... Then help me for return...I am not happy with overall performance of the phone...",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "Battery is good, but mobile is very heavy.. not handy for one hand operation.. if you use it continuously then you feel pain in your  hand, designed is out dated, poor quality material.. camera is just okay.. Lookwise not goodDisplay qaulity is just good not bestSound quality is goodCamera not much good that I am expecting.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "I tried playing 7-8 apps at the same time and it never hanged or lagged despite 50% memory up.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Have all latest features like slow mo, 10x zoom, focus lens, panorma view and other added features.3.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Fingerprint on side is much faster than I expected. Even FaceUnlock is faster.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "I am a retail user and after 6 year of redmi and realme user now buy the Samsung just because of Samsung+Snapdragon and very much dispointed. While watching movie video in this phone or playing video in youtube brightness fluctuate fast too much automatically i.e Adaptive Brightness issue. There are so many phone below 25k with best facilities as compare to this Samsung m51.Conclusion : Phone is overpriced and performance is average",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "performance"
  },
  {
    "text": "If you need better SAR value,7. If your first preference is battery, and decent level of camera quality,8.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Finally I can delete SMS from notification now!!- Display is excellent with Blue light filter.- Performance is good. No heating or lagging. 512 GB card supported with dedicated external card slot.- Both dedicated sim slots support LTE- Fast charging and 15W charger top with phone. Charged fast.- Mobile speakers sound is good, but I prefer external speakers for better bass in music.- Camera is really good. Macro performance is very good - look at skin in tatoo photo and dust perticles in deskphone photo!!",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Performance: Streaming videos and playing heavy games was smooth for the first 4 days but then again Samsung is known for fast deterioration of performance, so I will keep my eyes and ears open.3.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "Not a Samsung performance. But got shocked to see the poor performance n battery life.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "3",
    "aspect": "performance"
  },
  {
    "text": "So I turned off fast charging option.. You can do that.. many features available such as slow and super slow videos available.. 5. OS&UI:- 5/5Android 10 with One UI6.Finger print reader and face lock 3/5 Face lock and finger print reader are not so fast7.Processor and performance 3.5/5Exynos 9611 is not meant for PUBG gamers  .. No lag ang hang till now..  but processor is outdated..8. No fast charging..",
    "brand": "Samsung",
    "model": "Samsung Galaxy M21 (Iceberg Blue, 4GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "As a title it is obviously a monsterAnd very very good performance",
    "brand": "Samsung",
    "model": "Samsung Galaxy M21 (Iceberg Blue, 4GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Very poor performance.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M21 (Iceberg Blue, 4GB RAM, 64GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "So can't say about the gaming performance.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M21 (Iceberg Blue, 4GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "camera is below average* Average display quality* No earphones in the box* No fingerprint scanner* Takes very long time to charge battery.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "fast and responsive for normal tasks5.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "As a title it is obviously a monsterAnd very very good performance",
    "brand": "Samsung",
    "model": "Samsung Galaxy M21 (Midnight Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Superior, as it matches any S series flagship premium in classy look, strong built for this budget amount. PROCESSOR.After using for more than half month I must say, Exynos 9611 works wonderful liquid speed when it is combined with LPDDR4X RAM technology. I have not faced any lag in PUBG or ASPHALT-9 hight end games, in medium setting which is good for battery saving.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "However it has some good outputs6000mah battery with 25W fast charging is awesome.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Processor: Not the fastest out there  but does the job.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Processor  - Could have been better3",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Canera - Excellent camera - Good low light photography. 64 Megapixel does uts wor. Inteli Cam is just awesome.2. Display is just Superfine even in direct sunlight it works Excellent. Touch is just Excellent.3. Phone looks really cool in hands.4. Smart pop up feature is also good to have.5. UI is good.6. Speaker sound is good.7. No issues in calls - No call drips using Airtel sim. Overall its very nice experience using this phone. Battery doesn't look like 6000 MAH it typically gives 1.5 days backup with single charge which other phone alao gives with relatively less Mah Battery.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Has Slowmo, Super slowmo, Hyperlapse, Panaroma.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 (Space Black, 6GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Apps run smoothly.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Smooth touch sensitivity3.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "My friend also faced the phone off issue but it was resolved automatically after 2 days when he connected a fast carger to the phone.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "Processor Media tek Quad core Is best because quad core take less power from battry than the octa core processor. and i purchased this phone for my mom so quad core porcessor is sufficient to my mom.2:- Battry life is good because of Quad Core Processor.3:- Ram is 2Gb that is also sufficient4:- Display as always awesome as samsung provide.5:- every new phone have done this one time because of system works smoothly.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "(Very very fast)Cons:1)",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Clean and bloatfree OxygenOS, which runs as smooth as they come.2) AMOLED screen and 90Hz refresh rate really go along to make the display above average.3) The design actually fits the hand well as it is shorter than usual on breadth, and a bit more on length, all the more better viewing experience.6) Gaming performance is average. (Similar phones in this range have better gaming performances)7) Face Unlock is as fast as other OnePlus phones. 4K video recording @ 60fps is absent but 1080@60fps performance is quite good. Recommendation: If you're looking for a phone which delivers high performance and smooth interface for your daily use, go for it. Also, if you're expecting flagship camera performance, you might want to consider other phones.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Battery usage update: Drains faster than other one plus models...so for the ones travelling frequently, this might not be an ideal phone...fast charging is a relief for ones who have access to charging point....",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Got it delivered yesterday , used for about 5-6 hours , to tell you this is my first mid ranger previously I was using s9 plus , before that s7 edge and iphones in stone age .My first one plus , a mid ranger , I assure you it's no less a flagship experience , forget bout negative reviews, no device is perfect .This one has looks , power and performance , don't know how useful is 5G modem but who cares that's the baggage we consider it as of nowCamera unit is also awesome perfoms well and remember it's a bloat free and advt free experience of OXYGEN OS .Cons , I am yet to discoverENJOY the NORD",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "The touch is not as smooth as the other one plus phones.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Fast as hell.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Got it delivered yesterday , used for about 5-6 hours , to tell you this is my first mid ranger previously I was using s9 plus , before that s7 edge and iphones in stone age .My first one plus , a mid ranger , I assure you it's no less a flagship experience , forget bout negative reviews, no device is perfect .This one has looks , power and performance , don't know how useful is 5G modem but who cares that's the baggage we consider it as of nowCamera unit is also awesome perfoms well and remember it's a bloat free and advt free experience of OXYGEN OS .Cons , I am yet to discoverENJOY the NORD",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Ash, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Now they are trying to bring flagship product with flagship price like oneplus 7/8 . It is half hearted attempt by one plus to make Nord as flagship killer. But it has failed since one plus are making their own oneplus7/8 series flagship phones which they do not want to kill.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "2",
    "aspect": "performance"
  },
  {
    "text": "I was using One Plus 5T ,5T is giving similar performance. Irony is by the time 5G comes , this phone will be become slower and battery issue will be more prominent . You can save money by buying phone less than 20K which will give similar performance.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "2",
    "aspect": "performance"
  },
  {
    "text": "Performance: 90 Hz ref rate makes app opening, scrolling super smooth. No lag faced during gaming, scrolling through social media. A bit slow fingerprint scanner.2) Slight heating during charging and extended gaming periods.3) Didn't find appropriate customisation options for font.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Front 4/5Back 4.5/5Best NightmodeUse with Gcam💥Processor.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "charging is awesome i.e. really fast.",
    "brand": "OnePlus",
    "model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "more smoother 90 HZ).4th OnePlus 8 6gb - 2 parallel lines were again there",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)",
    "stars": "3",
    "aspect": "performance"
  },
  {
    "text": "Great phone!Gaming performance is so great, device don't get heat up at all even at high settings!I played PUBG Mobile and details it provides were so exciting and make it feel real. Camera is good, can't say it is awesome!Battery life is great too, charge too fast!UI is as expected stock android, some pre-installed third party apps were also installed, you can uninstall all of them except Netflix.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "On the first glance you will feel the premium quality of the Oneplus 8.I have mentioned few good and bad points for quick understanding for every buyer -Good -Very good build qualityVivid displayExcellent performance and softwareSolid battery lifeDecent camera performanceChic designConsistent performanceOxygen OS is blissClass-leading displayBad-No IP rating or wireless chargingLow-light video could be betterBasic cameras setup",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Obviously, you might have done extensive research, watched many review videos before coming here to make your purchase decision. There is only one way you will be happy with this purchase and that is, if you are looking for a slim, elegant, powerful, light weight device offering a premium in-hand feel. Camera is going to serve you well on many occasions (when the lighting is good). People might have told you that the camera system is mediocre. There have been few software updates and I can confidently say that yes, the camera is neither great nor is it bad. It delivers decent pictures (when the lighting is good) and if you are not a absolute camera geek, then this will meet and succeed all of your expectations. Incase you are a camera geek, then get the 8Pro and dont think about saving money. Conclusion: Feels expensive and has a nice balance in the hand (Its very light and is a joy to use). The glacial green in matte finish is makes the front of the device look expensive (with the dark edge-to-edge AMOLED panel).",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "After reading a lot of geeky reviews on YouTube and portals, I bought Oneplus7t. Pls, note I have been using OnePlus from last many years now so my expectations were clear. My experience with the device says that most of the reviews or unboxing things are influenced. Pls, note I have bought it with my own money unlike leading reviewers or unboxing video geeks who get it for free. Go for users reviews who bought them with their own money. So I am writing my 5 days experience with the phone. A regular user who wants to do all the office work on the phone, social media, blogging and vlogging, etc. The last OnePlus phone I was using was Oneplus 5 and was quite happy with it until it screen got broken and replacement cost was higher than the selling price of the device itself. I have clicked a magazine cover picture with my Oneplus 5 which had only 16 MP camera but pic quality was natural and good. Battery:  Battery is avg. All those time I teased my iPhone or Samsung Series colleagues and friends for their battery life. This offers an avg battery life. I never carried a charger with me in previous models if I Start with 90% even after two years. I m wondering what would be this phone battery life in a year or more.4. 90 Hz refresh rate is a gimmick to sell this device. It will give you fluid experience but the soon it consumes battery you will always prefer to keep it to 60hz which is an option given in the display settings. If you always stick to a desk or have a power source around you can keep it to 90hz. Not for people who are on the move most of the time. Sound: Phone calls are not crisp and clear. At times the caller's voice gets hazy and husky. Voice is even audible to person the person sitting next to me. Speakers volume is loud but the sound quality is not good.6. With multiple variants, it has joined the league of Samsung, Mi, Oppo, Vivo. Now they are launching 7t pro on Oct 10 again it is a disappointment for those who bought 7t on day 1. Maybe their R&D or trials have some problem here that in every two months they are launching a new device with an update to the previous faults. Like OnePlus 7 has voice receiver on one side which is right. So if you take calls or hear the phone from left you won't get a clear voice or volume. So they added receivers on both the side in this device. No camera quality, no battery life, no sound quality on calls, getting wounds on holding it for long. I have always recommended OnePlus devices to everyone around and had high hopes and trust on the brand that I bought it on the day of the launch but with this experience, I won't recommend OnePlus 7t to my colleagues and friends who are planning to upgrade their devices.",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "3",
    "aspect": "performance"
  },
  {
    "text": "And it took me 40 min to charge from 2% to 100%.PROS:CAMERA - 4.8/5BATTERY- 5/5Display - 4.7/5Performance - 4.8/5Speed - 5/5Gaming experience- 4.8/5CONSNO",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "THIS IS ONE OF THE WORST PHONE I HAVE EVER PURCHASED. PLEASE DONT BUY THIS PHONE AND PUT YOUR HARD EARNED MONEY ON STAKE. THERE ARE SO MANY CONS IN THIS PHONE. EARLIER I HAVE USED ONE PLUS 5T PHONE SO I KNEW WHAT TO EXPECT FROM THIS PHONE DESIGN OF THE PHONE IS MESS. PHONE IS VERY FAT AND HAEVY. ALSO THERE IS NO PREMIUM FEELING AFTER HOLDING THIS PHONE AS WAS WITH THE ONE PLUS 5T.3. 3.5MM JACK IS BIG OMMISSION SINCE ONE PLUS 6 PHONE. THERE IS NO BIGGER BATTERY. 3 CAMERAS ARE ONLY FOR NAME SAKE.I WAS VERY HAPPY ONE PLUS CUSTOMER, BUT NOW I WON'T RECOMMEND THIS PHONE TO ANYONE. PLEASE DONT WASTE YOUR MONEY.",
    "brand": "OnePlus",
    "model": "OnePlus 7T (Glacier Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 3800mAH Battery)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "i am using this phone just a day..but there are  two main problem i notice so far...one is in video black depth is more and the second one is adapive light censor is worst part.in low light it's horrible.it can't match half of the samsung note,or s mobile.battery back is good far better than samsung and processor is absolutely powerful.playing pubg isn't that great experience it's lag many time.pls oneplus fixed lowlight display problem..",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)",
    "stars": "3",
    "aspect": "performance"
  },
  {
    "text": "It was amazing at first,blazing fast speed,120hz refresh rate and the display was gorgeous to look at,but after around 9th day,my display was having issues and after 11 days,half the screen would show a weird purple tint while watching youtube in dark mode and using chrome and apps with similar black color.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "I've played PUBG quite a lot on this device and have not noticed any major frame drops at HDR graphics and Extreme frame rates, let alone Smooth graphics. It runs PUBG really smoothly. Buttery smooth at all times.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)",
    "stars": "3",
    "aspect": "performance"
  },
  {
    "text": "My oneplus 8 pro has this screen uniformity issues in low brightness. During charging its heat a lot .Front camera of this phone is Just pathetic. In whatsapp video call is worse. Even with default camera app,the front camera is bad. Back camera is decent. First time i am disappointed with OnePlus.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "====+ Faster Processor. Snapdragon 855 Plus.+ Adreno 640. Better Gaming Performance.+ Better Haptic Motor. Same as the 7T.+ Fast Charging. You would never want to get back to 60Hz once you're used to this.==== Performance ====Snapdragon 855 Plus is one of the best CPUs out there (at the time of writing this review) and with Adrena 640, it takes gaming and multi-tasking to another league. Stock Android was butter smooth while I missed out on a lot of simple gestures like Longer Screenshots, Silence Button, Customized Navigational elements & much more which lacked on the Stock OS from Google. I would say Oxygen OS should be set as a benchmark for Google to include these incremental features on their upcoming flagships. Oxygen OS has presently the best OS Experience for Android.==== Battery ====Warp T30 is super fast. Although not the fastest charger in the industry, it still gets through a day on heavy usage.==== What could've been improved ====- Minor improvements on Camera.- If you still wish to own this but cannot afford the extra rupee on incremental updates (Fast Charging, 855 Plus) , my suggestion would be is to go for the OnePlus 7 Pro.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "COD & PUB-G juices out at their best with 60FPS & is indeed smooth than imagined.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Performance: Blazing and Lightning fast.5.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Its fastest phone that I have ever experienced. Overall smooth experience between switching apps and regular functions. The phone is so fast it takes some getting used to.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Amazing phone with an unbelievably smooth and vivid display. Highlights:1)Buttery smooth, fast and bright display -The edge display is just wowwww. It is Soo smooth and quick that you never will notice it is a hardware controlled camera. It is clearly faster and better than the usual 60Hz displays.5)Build and design - Just perfect... The charging is blazing fast and the battery very easily lasts a whole day,even with 90Hz refresh rate.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "ButAfter 2 days of normal usage and random navigation on the device. The device started rebooting itself, I was shocked but thought maybe just after reboot it will ok. But it rebooted for 3 hours continuously without any stop, till the whole battery got drained. I was not able to perform any action, it made me handicapped for 3 hours, where I cannot do anything... Check the videoFinally, I am returning it after long conversation with Amazon support and the OnePlus team.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "2",
    "aspect": "performance"
  },
  {
    "text": "Although fast, not really seeing the so called magic of 90Hz display.",
    "brand": "OnePlus",
    "model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "EXCELLENT PRODUCT WITH SUPER FAST SPEED!!Review :Camera - 4/5Battery - 4/5Display - 5/5Processor - 5/5Software- 5/5Overall 4.5/5Go for it!",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "After 3 days of use..Battery - 5/5Camera- 4/5RAM performance- 5/5Superb phone- a real flagship killer.. Must buy",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "The build quality is good however the performance is not good.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "The phone lags and has several bugs. The ringer, Bluetooth and wifi has performance issues and turns on off or disconnects automatically.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "Slow-Mo working fine. 30 W Warp charger  chage the device very fast. Fingerprint sensor is superfast. Face unlock also superfast. Qualcomm announced that its 865 Snapdragon processor support NavIC system.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "The Ultramarine Blue is fantastic 😍.Finally, if the price is not a deal breaker, then I *Highly Recommend* this \"Flagship\" phone from OnePlus.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "I am a long time customer of oneplus phones and since last 3 years I have been using oneplus 5 and that phone is as good as new. Here are some of the issues I am facing with the new onplus 8 pro.- Battery - The phone doesn't last one day with full charge. I dont play any games, my phone usage is mainly social media, instagram,facebook,reddit, twitter and bunch of other photo edit tools like lightroom and snapseed. If I charge full and start my day, then by evening 8pm  my phone is battery saver mode. Which is not the case on my oneplus 5 even after 3 years. And its more concerning because I don't use any of the power hungry games or apps. Btw I have removed 120hz refresh rate on the first week itself and all this battery issue is even when I am using it at 60hz refresh rate with default app/battery settings. I bought the oneplus 8 pro selling my DSLR camera so that I can record all my videos on phone itself plus its waterproof. Recently I shot a video at 4k 60fps and I guess within few minutes the phone got so heated that it disabled the camera from video shooting until the phone cooled down!! Now whats the use if I cant record a video even for few minutes straight on 4K?Camera - To be honest, stabilization is really great while recording video however photos are almost as good as oneplus 5 if not slightly better. But nothing that worth paying double the price you pay over oneplus 5. Video clarity is really great, far better than the oneplus 5. Wide angle is the only thing I felt is worth compared to oneplus 5.Apart from the above rest of the things are good I feel. Fingerprint lockscreen works mostly 70% of the time. Overall I regret buying the phone. Even if they had fixed the battery issues, this phone would have been a great choice.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "Yes war charging is faster, but the charge which doesn't last one full day is conerning for me.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "As a title it is obviously a monsterAnd very very good performance",
    "brand": "Samsung",
    "model": "Samsung Galaxy M21 (Blue, 4GB RAM, 64GB Storage))",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "If someone is looking for great flagship. But it don't deserve to be a flagship phone.",
    "brand": "OnePlus",
    "model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "Pros: fast phone, 24 hours + battery backup, wonderful screen, no hanging, no lagging, optimzed oxygen OS.Cons:",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "The touch is super smooth, face unlock is fast as a blink of an eye, I constantly use google assistant which response pretty well, I am blown away with the camera quality and audio quality that is powered by Dolby Atmos. The phone connects pretty fast to wifi and Bluetooth devices.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Awesome experience with ONEPLUS.Buttery smooth 90 hz display 😍Color accuracy and brightness of displayYou will be just in love with display of device.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "You'll understand why I rated this phone 2 out of 5 🌟. Battery backup is not like Op6 (OP6 had better).My OP6 had some issues like disappearance of networks and rebooting again and again. Now after 3 days of use same issue happened in OP8 too, like disappearance of networks n power button wasn't working I had to use power button+ volume up+ volume down altogether to reboot it again which was highly disappointing and annoying too. Not only this when I play game at bottom of the screen I can see some disturbance too which u can c in screenshots and videos I uploaded with the review. There is no 3.5 mm jack if u don't want to switch to wireless headphones as I dn like to use wireless ones. Yesterday I set it to full brightness to worship outside in sunlight and I received a prompt in phone about my phone's temperature Go through the images n video n ull get to understand that y u shud wait for another version or look for another options.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "2",
    "aspect": "performance"
  },
  {
    "text": "Highly disappointed with its performance.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "2",
    "aspect": "performance"
  },
  {
    "text": "Also smoothness of phone.",
    "brand": "OnePlus",
    "model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "I will not speak about the specs as most reviews highlight it in detailwhat I liked!Blazing fast  while opening closing apps etcCamera is quite good!",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Quick processor2. Ultra fast storage4.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "OOS 4.5.x looks and feels better than the version in 3/3T. I am sure the little issues will be taken care of, soon.7. AptX support for better wireless audio.8. Camera is better than 3/3T. Videos look great after update. Decent front camera. Amazing battery life. Speaker is louder than 3/3T for sure but sounds cheap.2. Sound via headphone jack is also better than 3/3T, but lacks the power to drive high quality headphones.3. Inbuilt equalizer is the worst there is. An update can easily fix that.4. Dual camera setup. OP should have opted for a wide angle combi instead of zoom. Pictures in low light are still noisy. The screen isnt as bright as 3/3t. Legibility under sunlight can be an issue for some. Also, same old 1080p can be a bummer. I personally dont mind the trade off for battery life.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Processor:",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "The OnePlus5 is the first phone in India to have the advanced Octacore 10-nanometer design Qualcomm Snapdragon 835 chipset. In the fast paced world, the faster the phone charges, the better it is. The Dash charge is incredibly fast as ever and will prove to be a big convenience.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Dash charge is very fast, within 30 min it will be enough charged, but the software upgrade is little buggy, some apps gets crashed and a popup comes in saying \"___ app has stopped, open again\",camera in day is excellent, but night needs improvement.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Look is of flagship grade... little bit slippery,so u need to buy back cover to protect it..rating:8/10Display: Display is much better than any LCD but not as great as samsung super AMOLEDs. Rating: 8/10Performance: For this only one word.. awesome!!! Great performance...no heating at all.. blazing fast processor.. Daylight photo quite good(samples attached).Night photo though manageable but not as great as samsung flagships..",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Faster application speed than all the other phones, found better speed than my iPhone 6.3.",
    "brand": "OnePlus",
    "model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Phone is simply superb in all aspects...low light performance of the camera is outstanding...you simply cannot go wrong with this phone",
    "brand": "OnePlus",
    "model": "OnePlus 6T McLaren Limited Edition (Speed Orange, 10GB RAM,256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Flagship Specs, Classy look, Premium Packaging and the Speed you Need!Appearance -",
    "brand": "OnePlus",
    "model": "OnePlus 6T McLaren Limited Edition (Speed Orange, 10GB RAM,256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "You could open up 5 high specs games and it still wouldn't lag.",
    "brand": "OnePlus",
    "model": "OnePlus 6T McLaren Limited Edition (Speed Orange, 10GB RAM,256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Prime very fast delivery.",
    "brand": "OPPO",
    "model": "Oppo A52 (Twilight Black, 6GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Snapdragon older.",
    "brand": "OPPO",
    "model": "Oppo A52 (Twilight Black, 6GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Main thing which phone is required processors...",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "performance"
  },
  {
    "text": "So far so good, 1st day of usage-If we say that One Plus and Iphones are 9/10s or 10/10s then Oppo F17 Pro is-Battery Charging Capacity- 8/10Battery Lasting Capacity- 8/10Rear Camera- 8/10Front Camera- 8/10Screen- 9/10Sound- 9/10Comes with a cover, ear phones and a charger which is indeed amazing. The phone is surprisingly good. It has a good camera which has multiple modes to click photos. It's front camera is top notch. I think if you get this phone for less than 20k by exchanging your old phone, it is totally worth it. It is a very light phone btw. This is a day 1 review, first impression and a few hours of usage after full battery. It charges real quick btw. Buy it without any regrets if you can exchange an old phone and get this within 20,000.Go for it.",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Having 8gb of RAM is the best thing, the phone is fast, responsive.",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Good deviceBattery backup is goodFast ChargingLight WeightHas 3.5 MM headphone jack",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "VOOC charge which charges phone in less than an hour3) Display4) Battery Backup ( not a gamer )5) Rear Quad Camera has separate separate lens cover for each lens which makes easy for replacing lens cover later. I think Camera is not up to the mark2) Finger print sensor response is lowConclusion :I love this phone coz and I am not a gamer and I am not a heavy camera user. So For camera lovers and Gamers this I don't recommend this phone. But others who just love slim phone, just buy this phone. It's really awesome however camera is good but not the best.",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Battery parfromens not good but battery is very fast charging",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Excellent working ,good camera features ,ear phones were awsome with real sound tracking technology ,value for money 10/10 ,charging is too good and fast charging.",
    "brand": "OPPO",
    "model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "No lagging till now. Going smooth.5. No lagging here too .Rest",
    "brand": "OPPO",
    "model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Processor is fast for general purpose and played COD and some other games at medium graphics didn't observe any lag.10.",
    "brand": "OPPO",
    "model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Software is fast and no clutter apps or extra apps.",
    "brand": "OPPO",
    "model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "It's not worth for this amount after Unboxing and using it for a moment I feels like that, because I am using oppo mobiles more than 3 yearsBut this product is okay by weightless,fast charging  but not okay with with cameras,finger print accessibility, battery performances,And processor is snap dragon 662 nothing more specific things .So oppo have to launch little bit better quality product for this amountDynamic orange 🍊,first you realise the colour of orange and this phones colourDon't try to give fake colour or spread fake informationsSo I don't suggest to buy this product to anyone",
    "brand": "OPPO",
    "model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "performance"
  },
  {
    "text": "As a title it is obviously a monsterAnd very very good performance",
    "brand": "Samsung",
    "model": "Samsung Galaxy M21 (Blue, 4GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Fast charging3.",
    "brand": "OPPO",
    "model": "OPPO A5S (Black, 3GB RAM, 32GB Storage)",
    "stars": "2",
    "aspect": "performance"
  },
  {
    "text": "Very gud phone fast phone and gud colour price gud Amazon",
    "brand": "OPPO",
    "model": "OPPO A5S (Black, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "This phone makes sense only for a very specific set of people. Bought this after a lot of deliberation on whether to go the one plus way or the oppo find x.  I am a person who uses an S9, and super heavy user. Atleast 2 full charges a day. emails, conf calls and video. In 30 min you get near full charge. This phone is worth for that one reason. Screen, a 120hz screen does make a huge difference compared to S9 that I own. Speaker - One of the best speakers. Plus 5k discount and a one-time screen replacement warranty. I don't worry about IP68 and Camera. In the last 15 years, I have dropped the phone only once in the pool, but at least 5 of them have got a broken screen. I don't use the camera on the phone much. I just looked at how I have used the other phones for the last 10 years and counting what made sense for my usage leaving all other things out.",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "It is minimalist, material design, and fast.",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "I Can't even think at any point of time that it's been that easy for me to Back to Android after using Iphone 11.But after using Oppo Find X2 my thoughts were totally blown away by the performance I got. I highly Recommend to go with this one 😊Oppo Find X2 is real Flagship of 2020",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Let me Tell u About Some Pros first-1.Display Is the Bestest In any Smartphone Ever2.Flawless performance from the best Chipset Inside3.World's Fastest Charging Phone4.Superfast Read n Write Speed through UFS 3.1 storage5. Good Camera not the best needs some Software Upgrades6.Better Haptic Motor as Compared to other flagships7.Best Sound In this Price Range or In Android MarketNow",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "True flagship .",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "If you are a person who would want a premium feel smartphone with excellent display, video streming experience , good design, good camera setup and fast charging : Go for this one .",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "I has best qualcomm 865 processor, just don’t think about slow speed. Its history now.5G enabled: Cherry on the cake, what better can expect from any flagship phone. Wifi 6: Never thought wifi version make such a difference in network speed, lag free, never found any delay in opening any page.",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Phone build quality is superb nd sturdy right there with OnePlus nd samsung flagships8.ColourOS7.1 evolved comparable to oneUI from samsung9.",
    "brand": "OPPO",
    "model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Display: Its awesome 3D edge smooth & bright display looks more premium (5/5)3. Battery: Its cool, not draining too fast.",
    "brand": "OPPO",
    "model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Issues pertaining to lag while using Google Chrome, Generic apps andswitching between multiple tabs, I was completely unhappy with the productand I could clearly see the lack in  performance. When I flagged the issueon the 12th evening to Amazon services, an online tech diagnostic processwas initiated and later I was informed about a technician visiting mylocation/ residence on the 14th afternoon. As per the technician who did visit, agreed that there is lag in theusage but that's OPPO for you and signs off saying he'll have to resolvethe ticket, booking this under working fine. Absolutely Unhappy, first with Amazon having to reachout to express andexplain about my current status and give a download of a series of eventsthat's happened every time over a call again and again, Secondly usingOPPO, with its performance, Pathetic.",
    "brand": "OPPO",
    "model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "Better to value for money , quality is as per shown ..And fast delivered by amazon.",
    "brand": "OPPO",
    "model": "OPPO A31 (Mystery Black, 4GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "The fingerprint reader is very fast but be careful to use a certified and original screen guards or protectors as the fingerprint does struggle in screen guards. Included accessories are a pretty decent specially the included fast charger with the Type-C cable pretty sturdy. PROS:--Supports fast charge and has pretty decent charge rates-Has NFC which enables in wireless payments and support for Android Beam (unless Android 10 comes)-Has a good 4000mAh battery, pretty decent for bit of heavy users-Has on-screen fingerprint which is good-Camera setup is goodCONS:--Camera struggles to shoot better pictures at night-The included night mode requires a little bit software upgrade-OneUI which is extremely good, but the icons are kind of kiddish-And mostly- Also, the fingerprint get's slow as you use it.",
    "brand": "OPPO",
    "model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "It feels very slow.",
    "brand": "OPPO",
    "model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Love the samsungProud to be a Samsung user love the design love the display yeah fingerprint sensor is little slow hope this will be improved by the upcoming updates",
    "brand": "OPPO",
    "model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "It's not worth for this amount after Unboxing and using it for a moment I feels like that, because I am using oppo mobiles more than 3 yearsBut this product is okay by weightless,fast charging  but not okay with with cameras,finger print accessibility, battery performances,And processor is snap dragon 662 nothing more specific things .So oppo have to launch little bit better quality product for this amountDynamic orange 🍊,first you realise the colour of orange and this phones colourDon't try to give fake colour or spread fake informationsSo I don't suggest to buy this product to anyone",
    "brand": "OPPO",
    "model": "Oppo F17 (Classic Silver, 6GB RAM, 128GB Storage)",
    "stars": "2",
    "aspect": "performance"
  },
  {
    "text": "Charging - A+.Some says it doesn't support fast charging but it is neither a normal or slow charging. It's not a super fast charging but a good fast charging.",
    "brand": "OPPO",
    "model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 (Ocean Blue, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Front camera is up to the mark of oppo reno2z4. Battery is ok6.",
    "brand": "OPPO",
    "model": "OPPO Reno 2Z (Luminous Black, 8GB RAM, 256GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Good build qualitySharp displayPowerful processorSolid battery lifeDecent daylight camera performanceFast ⚡ chargingNo heating issue",
    "brand": "MI",
    "model": "MI Poco M2 Pro (Green and Greener, 6GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Nice camera with with very good quality low light or night photography which still many flagship phones lack.5. Super steady video from rear camera because of presence of both EIS & OIS.9.Bigger battery 4780 mAH as compared to other flagship phones.10. 3. Trust me this MIUI has a lot of bugs and thus results in issues like while using finger print scanner, the device heats up at times even during normal usage, but the overall performance is acceptable. (The 20 MP front camera and that too without EIS, 2 MP macro camera, 2 MP depth camera and 13 MP ultrawide camera seems like a joke for a 2020 flagship phone with the price of 50k.)5. However in reality still the phone is definitely a strong competitor in the flagship mobile segment.",
    "brand": "MI",
    "model": "Mi 10 (Twilight Grey, 8GB RAM, 256GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Excellent performance.3.",
    "brand": "MI",
    "model": "Mi 10 (Twilight Grey, 8GB RAM, 256GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "OverHeats and battery drains quickly... performance not what you expect from a 50k phone.",
    "brand": "MI",
    "model": "Mi 10 (Twilight Grey, 8GB RAM, 256GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "A cute mobile...super performance and good camera",
    "brand": "MI",
    "model": "Mi 10 (Twilight Grey, 8GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "OverHeats and battery drains quickly... performance not what you expect from a 50k phone.",
    "brand": "MI",
    "model": "Mi 10 (Coral Green, 8GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "A cute mobile...super performance and good camera",
    "brand": "MI",
    "model": "Mi 10 (Coral Green, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "OverHeats and battery drains quickly... performance not what you expect from a 50k phone.",
    "brand": "MI",
    "model": "Mi 10 (Twilight Grey, 8GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "A cute mobile...super performance and good camera",
    "brand": "MI",
    "model": "Mi 10 (Twilight Grey, 8GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "OverHeats and battery drains quickly... performance not what you expect from a 50k phone.",
    "brand": "MI",
    "model": "Mi 10 (Coral Green, 8GB RAM, 256GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "A cute mobile...super performance and good camera",
    "brand": "MI",
    "model": "Mi 10 (Coral Green, 8GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Awesome performance beautiful design fall in love excellent Mobile battery back up 2 Days overall my rating out of 5star budget phone keep All buy this product",
    "brand": "MI",
    "model": "Mi Redmi 8 Phone (Sapphire Blue, 4GB RAM, 64GB Storage))",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "till now mobile is working as expected like fast operating anything and mobile charging coming more than 24 hours once fully charged, the Picture quality is very nice, I will give review again after 6months, Thank you MI and Amazon.",
    "brand": "MI",
    "model": "Mi Redmi 8 Phone (Sapphire Blue, 4GB RAM, 64GB Storage))",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Awesome performance beautiful design fall in love excellent Mobile battery back up 2 Days overall my rating out of 5star budget phone keep All buy this product",
    "brand": "MI",
    "model": "Mi Phone Redmi 8 (Emerald Green, 4GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "till now mobile is working as expected like fast operating anything and mobile charging coming more than 24 hours once fully charged, the Picture quality is very nice, I will give review again after 6months, Thank you MI and Amazon.",
    "brand": "MI",
    "model": "Mi Phone Redmi 8 (Emerald Green, 4GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Awesome performance beautiful design fall in love excellent Mobile battery back up 2 Days overall my rating out of 5star budget phone keep All buy this product",
    "brand": "MI",
    "model": "Mi Redmi 8 Ruby Red, 4GB RAM, 64GB Storage Smartphone",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "till now mobile is working as expected like fast operating anything and mobile charging coming more than 24 hours once fully charged, the Picture quality is very nice, I will give review again after 6months, Thank you MI and Amazon.",
    "brand": "MI",
    "model": "Mi Redmi 8 Ruby Red, 4GB RAM, 64GB Storage Smartphone",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Awesome performance beautiful design fall in love excellent Mobile battery back up 2 Days overall my rating out of 5star budget phone keep All buy this product",
    "brand": "MI",
    "model": "Mi Redmi 8 Smartphone (Onyx Black, 4GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "till now mobile is working as expected like fast operating anything and mobile charging coming more than 24 hours once fully charged, the Picture quality is very nice, I will give review again after 6months, Thank you MI and Amazon.",
    "brand": "MI",
    "model": "Mi Redmi 8 Smartphone (Onyx Black, 4GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Don't buy this MI 6 Pro ,Speaker volume is very bad & LowCamera pics are not good at all special back cam having dual cam stabilization problem front cam like VGA picsHeating issueBattrey drained very Fast",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "Slow charging3. Internet speed too slow5.",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "I was using Asus Zenphone2 of 2015 Model with same ram and Internal Memory,but this phone is really very slow in loading web pages an even your tube.2)",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "Touch smoothness is amazing.",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "So is the battery! Camera is good.",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "3",
    "aspect": "performance"
  },
  {
    "text": "About the phone:Android Version:*Android v8.1 (Oreo) based on MIUIPerformance*Snapdragon 625 battery efficient*Octa Core, 2 GHz processor*4GB RAM enough for daily useDisplay*5.84 inches (14.83 cm)*1080x2280 px, 432 PPI crisp display*IPS LCD beautiful colourCamera*12 MP + 5 MP Dual Primary Cameras*LED Flash*5 MP Front CameraBattery*4000 mAh 1 day+ battery life*Non-Removable*4G Supports Indian bands*VoLTE*64 GB + 256 GB Expandable*Dual SIM: Nano + Nano*Dedicated Micro SD Slot*Fingerprint sensor*USB OTG SupportReview: Camera performance is average. Overall performance is average, don't expect huge from this phone at this price segment.",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Processor SD 625 is aged not the latest (but still good).",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Screen is sluggish  to navigate, slow one.3.",
    "brand": "MI",
    "model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "Very poor Rear camera quality, photos app Suddenly Hanging full black screen shown, mobile back side heating by online video streaming, Internet connection poor, very slow downloading, etc...,",
    "brand": "MI",
    "model": "Mi Redmi Note 7S (Ruby Red, 32GB, 3GB RAM)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "This phone hangs within 2 days and if we call in this phone it does not show the call interface and the processing of this phone is very slow",
    "brand": "MI",
    "model": "Mi Redmi Note 7S Smartphone (Onyx Black, 32 GB, 3 GB RAM)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "nice product, camera, RAm performance was good so far, delivery also really excited me because delivered product on 4th day, much appreciated.",
    "brand": "MI",
    "model": "Mi Redmi -Note 7S (Onyx Black, 64GB, 4GB RAM)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Very slow..",
    "brand": "MI",
    "model": "Mi Redmi -Note 7S (Sapphire Blue, 64GB, 4GB RAM)",
    "stars": "2",
    "aspect": "performance"
  },
  {
    "text": "Good phone in this price better  performance redmi 6 double camera fingerprint  charger is so good battery backup is best",
    "brand": "MI",
    "model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "K) Lacks fast charging feature and hence take almost 2 hours to get fully charged.",
    "brand": "MI",
    "model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "The iPhone 8 if compared with its predecessors (iPhone 6 / 7) is truly a powerhouse when it comes to performance.",
    "brand": "Apple",
    "model": "Apple iPhone 8  - Gold",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Not a single da has I have got any software issues, lag issues, aware issues.. It has been a smooth experience so far and I am looking forward to use it for another 3 years more.",
    "brand": "Apple",
    "model": "Apple iPhone 8  - Gold",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "It is buttery smooth and nice and there was an update of ios13.1.2 available.",
    "brand": "Apple",
    "model": "Apple iPhone 11 Pro Max  - Space Grey",
    "stars": "3",
    "aspect": "performance"
  },
  {
    "text": "I Love the iPhone Pro Max, purchased from Amazon IN, on Oct 14th 2019. That is the main reason I upgraded from iPhone X to 11 Pro Max. The Ultrawide lens, the improved telephoto lens, night mode, improved portrait options, all give exceptional results. The snaps taken by this phone could compete with some of the most professional DSLRs. I used to charge my iPhone X every night, whereas for the same amount of usage, now I have to charge the 11 Prod max once in 2 nights.3. I was already a big fan of the 5.8' OLED display on the iPhone X. At 6.5' , 11 Pro Max offers the best OLED display I have come across smartphones.4. The 11 Pro Max is definitely a phone for amateur & professional photographers.",
    "brand": "Apple",
    "model": "Apple iPhone 11 Pro Max  - Space Grey",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Face ID is faster.",
    "brand": "Apple",
    "model": "Apple iPhone 11 Pro Max  - Space Grey",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "The apps and the interface work smoothly as ever.5.",
    "brand": "Apple",
    "model": "Apple iPhone 11 Pro Max  - Space Grey",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "I was much elated to receive the iPhone 11 so fast, next day of dispatch i.e. 28/09/19, but the thing I got started heating up every now and then.",
    "brand": "Apple",
    "model": "Apple iPhone 11  - White",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "The overall look of the phone is premium and face unlocking is fast.",
    "brand": "Apple",
    "model": "Apple iPhone 11  - White",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "The phone comes with 5W charger which charge your phone slowly.",
    "brand": "Apple",
    "model": "Apple iPhone 11  - White",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Best Processors A13 Bionic ChipCons-1.",
    "brand": "Apple",
    "model": "Apple iPhone 11  - White",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "As a title it is obviously a monsterAnd very very good performance",
    "brand": "Samsung",
    "model": "Samsung Galaxy M21 (Raven Black, 4GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "its really smooth.",
    "brand": "Apple",
    "model": "Apple iPhone Xs Max  - Gold",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "If you are confused between apple and android flagships, let me tell you, I was on HTC for 3 years, then shifted to iphone 6s plus for 3 years and briefly shifted to pixel 2 xl, and  now finally to Xs Max, which I intend to use for the next 3 years.",
    "brand": "Apple",
    "model": "Apple iPhone Xs Max  - Gold",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "The iPhone XS Max combines a big OLED screen, great speakers, great cameras, great battery life, and blazing fast speed into the best user experience on a smartphone. fast and smooth- Siri has been given shortcuts- upgraded cameras are just as good as Samsung cameras now and the front camera is better than the Note 9 front cameraCons:- expensive- slow speed charger-",
    "brand": "Apple",
    "model": "Apple iPhone Xs Max  - Gold",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "It’s an iPhoneGold colour colour done the job very wellA12 Bionic chip processor is strongBuilt quality is good then iphone xr and iphone 11Camera perfectPeople will love this 2camera design not the iPhone 11 pro max design",
    "brand": "Apple",
    "model": "Apple iPhone Xs Max  - Gold",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "It's not worth itThe features are okishIt's pretty smoothBut at this range everything is smooth:-=-OI am more happy with the performance of my note 9Go n buy apple airpods n a note 9 or one plus 6tThis is just a waste",
    "brand": "Apple",
    "model": "Apple iPhone Xs Max  - Gold",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "Very important, it runs on High graphics mode where as my Note 8 use to work on medium graphics even when I used the mobile on Gaming, High performance or Entertainment mode...",
    "brand": "Apple",
    "model": "Apple iPhone XS  - Space Grey",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Considering the XR is now priced higher than X. XS is only marginally better, and didn't feel it was worth the extra 30K.- Even after a year of being on the market, this phone is an absolute beast in terms of performance, especially after iOS 12.- The Camera is a beauty. With moderate usage, you can get 8 hours barely.- With the price of the phone, should have at least come with the fast charger in the box.",
    "brand": "Apple",
    "model": "Apple iPhone X  - Space Grey",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "I was satisfied as the product was 100% genuine.iPhone is buttery smooth and the full screen is an awesome experience.",
    "brand": "Apple",
    "model": "Apple iPhone X  - Space Grey",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Pros:1) A11 Bionic Processor is blazing fast and coupled with 3GB ram you will never have any issues with any of the heavy duty tasks you throw at it2) Snapdragon X16 LTE modem while the iPhone X A1901 has the Intel XMM 7480 modem) which is better than the A1901 model as A1865 covers more cellular bands (GSM and CDMA networks and frequencies) and the performance of Qualcomm’s chips has always been better than Intel’s.",
    "brand": "Apple",
    "model": "Apple iPhone X  - Space Grey",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Redmi phones cameras are great, of course iPhone is better but is the 6 more Redmi phones that I can get for 1 iPhone justifiable for such a difference in price? Well, absolutely yes.iPhone camera is not just better, it is so much better than comparing them are like comparing a Alto with BMW, yes both have 4 wheels, both have AC, both can run at 100 kmph, but you know the difference. The high price of iPhone is so justified by the sheer brilliance of camera it has. Sure it is just 12 MP, but the clarity, my o my!Sure the battery is just about 2600 compared to 3500 of a Redmi, but it lasts longer than a Redmi. My last iPhone was a 4S and then since I love buying phones every 6 months, I shifted to Android (Redmi, Samsung, Honor) to satiate my hunger for new phones. All these phones are superb, no doubt, but once you use the iPhone 7, you know that the difference between these phones and iPhone 6s has got much bigger because of the camera. Bottom line, iPhone 7 has jumped a big leap from the 6s and the 8 is almost similar. The X is double the price of a 7, so probably all things taken in account, the iPhone 7 is the best value for money among all phones in India",
    "brand": "Apple",
    "model": "Apple iPhone 7  - Rose Gold",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "I don’t feel the need to upgrade to some other device (iphone 8, x or xs) because it works flawlessly without any lag or delay whatsoever.",
    "brand": "Apple",
    "model": "Apple iPhone 7  - Rose Gold",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "I love this ❤️ mobile because it's designed so good 🤩🤩 and performance is also  good ☺️ but phone charger is so slow 😣 😑 but overall phone is so good 👌",
    "brand": "Vivo",
    "model": "Vivo Y20i (Nebula Blue, 3GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Best camera, very good battery life, eat body material, average weight, best performance,  best display.",
    "brand": "Samsung",
    "model": "Samsung Galaxy M31 (Black, 6GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Battery back up very impressive. Front camera outstanding.",
    "brand": "Vivo",
    "model": "Vivo V19 (Piano Black, 8GB RAM, 256GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "This phone is not worth for 28k, performance is very bad. Finget scan is not fast compare to competitor phones.",
    "brand": "Vivo",
    "model": "Vivo V19 (Piano Black, 8GB RAM, 256GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "I am not a gamer or don't run any app to consume high performance.",
    "brand": "Vivo",
    "model": "Vivo V19 (Piano Black, 8GB RAM, 256GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "But some what slow the mobile.",
    "brand": "Vivo",
    "model": "Vivo S1 (Skyline Blue, 6GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "front camera awesomerear camera good and better in sunlightbattery back awesome with 4500 mahawesome designawesome black with blue graphicsfast charging good4 gb 128 gb still no laggingheadphone good8 out of 10must go for it",
    "brand": "Vivo",
    "model": "Vivo S1 (Skyline Blue, 6GB RAM, 64GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Nice phone camera super super fast",
    "brand": "Vivo",
    "model": "Vivo S1 Pro (Jazzy Blue, 8GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Charging very slowAnd draining very fast like 2500 mah bttryBuy for who don't use much",
    "brand": "Vivo",
    "model": "Vivo Y91i (Ocean Blue, 2GB RAM, 32GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "The product is fine and working well. Battery and camera quality is phenomenal and met the expectations.",
    "brand": "Vivo",
    "model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Finger print and face unluck are Very fast with compare to other mobile. UI is very good and smooth with compare to so much hyped mi os.",
    "brand": "Vivo",
    "model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Value for money. Good camera, wide angle features should have been better. Good front camera n excellent battery backup.",
    "brand": "Vivo",
    "model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Don't buy this product mobile was very slow and one week charge is standard but one week after automatically charge is decreased point to pointAnd touch is also response is very lowBut now decided to replace the item return policy amzon description given to 10 days but they gave only one week",
    "brand": "Vivo",
    "model": "Vivo Y30 (Dazzle Blue, 4GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "Mobile phone meet with my expectation but only one prblem that charging is slow and price is too high on the basis of processor and overall mobile phone is good",
    "brand": "Vivo",
    "model": "Vivo Y30 (Dazzle Blue, 4GB RAM, 128GB Storage)",
    "stars": "4",
    "aspect": "performance"
  },
  {
    "text": "Product is very bad slow process and hanging issue I want ruturn this product",
    "brand": "Vivo",
    "model": "Vivo Y30 (Dazzle Blue, 4GB RAM, 128GB Storage)",
    "stars": "1",
    "aspect": "performance"
  },
  {
    "text": "Class product really nice but need to improve processor",
    "brand": "Vivo",
    "model": "Vivo Y30 (Dazzle Blue, 4GB RAM, 128GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Gaming performace is good when playing freefire in smooth and standard settings.6.",
    "brand": "Vivo",
    "model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "performance"
  },
  {
    "text": "Finger print reader and face recognition is fast.",
    "brand": "Vivo",
    "model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)",
    "stars": "5",
    "aspect": "performance"
  }
]